
{
"keywords":[
"1",
"2",
"3",
"4",
"5",
"6",
"7",
"8",
"9",
"10"
],
"reviews":[
{
"review":"5.0 out of 5 stars\nAN AWESOME GAME, firstly u will get confused by short ...\nBySatyam M.on 29 January 2017\nHardware Platform: Pc\n|\nVerified Purchase\nAN AWESOME GAME, firstly u will get confused by short amount of bullets, but as u upgrade it the game will become super cool, awesome storyline and graphics, neeeds only an update of 460mb , depends on u want to update or not, u can play even without updating, but updates bring more superrior graphics for me.\nComment\n|\n3 people found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nBut Tomb Raider is better than this\nByamanon 3 February 2017\nHardware Platform: Pc\n|\nVerified Purchase\nFar cry 3 is a game similar to Tomb Raider...But Tomb Raider is better than this.. . but anyways this game is also good. Thanks to Amazon and beyond toys and gifts.\nComment\n|\n2 people found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"4.0 out of 5 stars\nI enjoyed\nByAmazon Customeron 22 November 2016\nHardware Platform: Pc\n|\nVerified Purchase\nThis game is amazing 😁😂. I could give 5 Star but no because I got difficult is to install the game . There is no guide inside the CD . To tell you what to do. A part of this everything is fine . I enjoyed all day. Thank UBISOFT for the game . And Amazon for selling.\nComment\n|\nOne person found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nFive Stars\nByPrashant Agrawalon 16 January 2017\nHardware Platform: Playstation 3\n|\nVerified Purchase\nNice product as expected !!\nComment\n|\n2 people found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"4.0 out of 5 stars\nGot in time and a very beautiful game:);)\nBySoumya Ranjan Mallickon 5 January 2017\nHardware Platform: Xbox 360\n|\nVerified Purchase\nVery NYC game!!\nComment\n|\n2 people found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nBetter than Far cry 4\nByAmazon Customeron 11 February 2017\nHardware Platform: Playstation 3\n|\nVerified Purchase\nThe best ubisoft game on ps3.\nComment\n|\nOne person found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"3.0 out of 5 stars\nFps problem\nByAmazon Customeron 31 October 2016\nHardware Platform: Pc\n|\nVerified Purchase\nAs such I have no problem with cd and is working perfectly but just fps is very low.\nComment\n|\nOne person found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nI required more than five star\nByAmazon Customeron 27 December 2016\nHardware Platform: Pc\n|\nVerified Purchase\nNo words to say...\nAmazing game....\nComment\n|\nOne person found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"1.0 out of 5 stars\nBad\nByAmazon Customeron 20 March 2017\nHardware Platform: Pc\n|\nVerified Purchase\nIt's not working\nComment\n|\nOne person found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nFive star\nByASHISH GOUTAMon 17 February 2017\nHardware Platform: Playstation 3\n|\nVerified Purchase\nIt was a nice\nComment\n|\nOne person found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\n_Definition Of Insanity_\nByManish Kotawadekaron 31 May 2015\nHardware Platform: Pc\n|\nVerified Purchase\n\"Did I ever tell you, the definition of... insanity?\"\nFrom the moment you start playing this game you realize that the world is not a sweet good place that you hav always believed it to be. And this feeling goes on getting stronger as the game progresses till the end.\nEven the most good & gentle people have to wear the cloak of insanity when it is required for survival & revenge.\nJason (main protagonist) & his friends, along with his siblings, are on a trip to Rook islands. They are misguided by a spotter onto an island filled with pirates & smugglers, who kidnap wealthy people, extorts money from them & then sell them to slavery or sex trafficking.\nOnce caught by the pirates & wathibg his family killed by the pirate overlord Vaas before his very eyes, changes start occuring in Jason. Given a chance to escape he slowly learns to use the island & it's powers to his advantage.\nHunting, killing & collecting bounties help him get stronger, maniac for power. In the end he finds out that he himself has become the very person he had set out to slay! But he has a choice.\nBe sure to experience this crazy adventure pf psychological changes!\nTechnical aspects:\n1. There are lies by people who have given 1, 2 stars. They either never played good fps games before or never know how to install them. NO 5-6GB download is required.\n2. You need good internet connection to install the game. Ubisoft account is must required if you are playing for first time. For that the game installs a \"ubisoft launcher\".\n3. After the game is installed a 250mb upgrade patch has to downloaded from official website. (The link opens after installation.) You can download it before too & install it later in the main folder. Without it you will get glitches. Other patches are optional.\n4. After installing the patch you can definitely play it offline by selecting \"offline\" mode in the ubisoft launcher menu.\n5. If you are uninstalling the game, make sure to copy the patch installations in different folder, in case you want to play the game in future. 'Cuz uninstalling the game deletes the patch installation file too.\nComment\n|\n13 people found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nGreat game with good graphics..\nByAjay Rajputon 25 January 2017\nHardware Platform: Pc\n|\nVerified Purchase\nFar cry 3 is a very good game.. actually I played it on pirated version but it has lots of performance issue and save bug . Even I completed it 3 times.. but original is original .. love it. Im not supporting piracy . From 3 years not bought a single pirated games dvd.\nComment\n|\n6 people found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"4.0 out of 5 stars\nFAR BETTER than 1 and 2\nByManion 7 October 2014\nHardware Platform: Pc\n|\nVerified Purchase\nFar cry 3 is far better than 1 and 2. Lot of improvements in terms of graphics and game playing objective.\nIf you love violence then this is a game that gives you lot more to enjoy.\nWork very well with 512MB graphics card and 2GB of RAM.\nInstallation is pretty straight but after installing the game - it is controlled by Uplay which would ask you to update recent patches released (may be 5 patches ). No issues found on game performance.\nWhen you play in offline mode, it would check for connecting to server each time when you press ESC button (bit annoying but ok).\nLot more side objectives are there apart from main missions so this game might take longer days to complete.\nComment\n|\n2 people found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nGreat Game & Great service by Amazon.\nByKaustubh Patilon 15 March 2017\nHardware Platform: Pc\n|\nVerified Purchase\nI played far cry 4 first & now I am playing far cry 3. Both parts have lots of similar aspects but still manage to hooked me up with its storyline & world to explore.\nLast but not the least, great service by Amazon.\nComment\n|\nOne person found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nFive Stars\nByAbhignaon 26 November 2016\nHardware Platform: Pc\n|\nVerified Purchase\nGreat graphics, superb story and great action. Great game to play. Lot of things to do. Very nice story.\nComment\n|\n2 people found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"1.0 out of 5 stars\nAmazon cheated me not buy this game i your getting in RS 1/-\nBySpartanson 19 October 2016\nHardware Platform: Playstation 3\n|\nVerified Purchase\nduplicate PS 3 game ,amazon cheated me.......\nComment\n|\nOne person found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nNice\nByAmazon Customeron 10 December 2016\nHardware Platform: Pc\n|\nVerified Purchase\nAuthentic\nComment\n|\nOne person found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"3.0 out of 5 stars\nThree Stars\nByShreeshayon 27 March 2017\nHardware Platform: Playstation 3\n|\nVerified Purchase\nGood game but unrealistic and story is very animeted\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"3.0 out of 5 stars\nThree Stars\nByAmazon Customeron 24 March 2017\nHardware Platform: Pc\n|\nVerified Purchase\ngame doesnt start in win 10 after installation.\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nIts THE GAME that lets shoot U shoot people and Animal with out mercy and you enjoy every bit of it ! !\nByAbhishekon 1 November 2015\nHardware Platform: Pc\n|\nVerified Purchase\nFarcry 3 (PC)If you are a fan of shooter and loves blowing things in people face, you will like it for sure. I won't go spoilers on stories , but this game has everything u want in shooter with Survival and few RPG system like Skill and various weapon choices. The game is so vast and full of things to do you will have few hours just to check all. Just a caution don't be Guns Blazing from start. Do level up higher and go kool. If u encounter levels on increasing , it is likely level cap for region. This game has so many side stuff and achievements. Also Twist and turns ! It is one the best shooter Out there !\nComment\n|\n3 people found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"1.0 out of 5 stars\nnever buy this, it requires a additional file of ...\nByganeshon 12 April 2015\nHardware Platform: Pc\n|\nVerified Purchase\nnever buy this, it requires a additional file of 5.6 gb\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"4.0 out of 5 stars\nBest series ever\nBySakshamon 23 September 2016\nHardware Platform: Pc\nOne of the best fps game I have ever played but started boring me after killing Vaas Montegaro.This have much improvements on graphics than 1 and 2.But still searching for the fourth one\nComment\n|\n2 people found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"4.0 out of 5 stars\nAwesome game but prolonged installation\nByPradeepon 20 December 2014\nHardware Platform: Pc\n|\nVerified Purchase\nI got this game during the Google Online Shopping Festival 2014 for Rs.300 and it is a steal at that price. The game has beautiful graphics, huge open world, freedom, challenging enemies, an assortment of weapons and a good story.\nThe most irritating part is installing the game. The box comes with 2 DVDs. It takes more than 30 mins to install from both DVDs. After this the DVD will install Uplay(needed to play Far Cry 3) after which it'll start updating Uplay after which you need to create a Uplay account(yay another account! Steam and Origin accounts weren't enough I suppose) and register the CD key to the account. Then when you finally try to launch the game it'll start updating the game(another 280MB) and then it finally lets you launch the game.\nThe game takes about 2 mins to load even the main menu. If you don't have the latest drivers or if you are playing on a decent laptop, get ready for crappy performance. After updating to latest drivers, performance increased a lot. However I still get less than 30fps at lowest graphics possible even though I'm using my laptop at high performance and its overheating to 90C(I recently cleaned the laptop and used Arctic Silver thermal paste). I have AMD APU and GPU but still the game performs horribly.\nYOU ALSO HAVE TO BE CONNECTED TO THE INTERNET(BECAUSE EVERY ******* GAME NOWADAYS NEED 24x7 INTERNET CONNECTION FOR SOME ******* REASON). You can still play even if you are not connected but the ******* game keeps trying to connect to servers whenever you press Esc for main menu. WTF happened to the days when you could play games hassle free without needing a hundred accounts and being connected to the internet 24x7???\nIf you have a good desktop or laptop and don't mind long installations then you're sure to enjoy this game throughout. I am really annoyed with the installation procedures.\nUpdate:\nI finally finished the game and am not too impressed with the second half of the story. Still worth playing though. The most irritating part is the loading time. Even with an Intel quad core desktop processor and Nvidia GTX 750Ti, it takes more than a minute to launch the game and load the main menu. It takes some time even to load a saved game. If you are not connected to the internet the stupid game will still try to connect to servers every time you press Esc for menu.\nComment\n|\n9 people found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nBest at what I do.\nByGabrielon 19 June 2014\nHardware Platform: Pc\n|\nVerified Purchase\nNon stop fun. Unlimited fun. Totally worth my money. The multiplayer is very fun. The game is a thing of beauty. If you're reading this then buy it ASAP and play it. Stop wasting time and BUY IT.\nComment\n|\n2 people found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"4.0 out of 5 stars\nFar Cry 3 - Fun to play!\nByRahul KULKARNIon 10 August 2015\nHardware Platform: Pc\n|\nVerified Purchase\nPros: Beautiful world to explore, Great variety of weapons\nEven Greater variety of playstyles (stealth, action, hybrid) Strong cast of characters with is good story arc.\nCons:\nSide quests are a bit light on content.\nMultiplayer is a bit weak\nOverall:\nOne of the best games of 2012. A huge return to the greatness of FC1 mixed with the best parts of FC2. An open world game with a great cast and great story, mixed with flexible gameplay that really gives something to any player. The action is explosive, the direction of the story sequences is intense at times, but still I can't really feel at home on these islands. Far Cry 3 is the ultimate open sandbox: The player can do what he wants, where he wants it, when he wants it. But the credibility of the world suffers – and with it my motivation.\nIt is an exceptional FPS with fun mechanics and excellent characterization. Unfortunately it wastes a fair number of opportunities offered by its huge open-world background. Plus, the secondary activities are not as fun as they could have been, and the island is too extensive to be interesting in the long run.\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nFar Cry is a great game that is very similar to the Grand Theft Auto games\nByChristopher J. Cowenon 9 October 2014\nHardware Platform: Playstation 3\nFar Cry 3 is a great game that will having you wanting for more once you finish the game. This game is very similar to the Grand Theft Auto games. The game is an open world game that is set in the jungle. The game has tons of different missions and none of the missions feel repetitive in nature. The game mechanics are good and there are some good Role Playing Game (RPG) elements to the game which makes you want to upgrade your character. You can easily get about 50 hours of gameplay out of this game. The game does not have any dead spots and is definitely not boring.\nI enjoyed this game and would definitely recommend this compilation.\nThank you for reading my review, if you have any questions feel free to email me, I would be happy to help you with any questions you have.\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nGreat game\nByGurjap Singhon 24 May 2014\nHardware Platform: Playstation 3\n|\nVerified Purchase\nAs far as games for PS3 go, it's competitively priced. The SP campaign has a good, decent length, and features a notorious Final Boss: Vaas. Vaas proves himself to be crazy as hell early in the game, and hovers like a shadow throughout the campaign. Mos Def's character (can't think of him as anything else) is great, and I won't spoil a surprise regarding his role.\nFeatures a good array of weapons, great topography and well designed AI for enemies. Unlike FC2, enemies don't seem to respawn. One advise: Try it at hard settings or else it might be too easy.\nGraphics are pretty good, and remind you of Creed: Black Flag or Tomb Raider.\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nA Worth Buying Game! !!!!\nByabishek veererajaon 24 October 2014\nHardware Platform: Pc\n|\nVerified Purchase\nI was stuck in deciding which game should I buy far cry 3 or dmc 5 (both for pc).I ended up buying far cry 3 after reafing al the positive comments and let my tel u it does not disappoint. I don't didn't expect much from the game as I was not a first person shooter fan but after playing this game I have become a fan.This game delivers in all the 3 aspects 1.the story 2.the game play 3 . graphics. .I strongly recommend this 2 any gamer who looking to have fun\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nThe game is awesome the graphics and the gameplay is too good\nBykallol sarkeron 13 November 2015\nHardware Platform: Pc\n|\nVerified Purchase\nThe game is awesome the graphics and the gameplay is too good, if you are a FarCry fan then you don't wanna miss it, and in regards to Amazone,it was great like the delivery was in time and the customer care was also very good & unlike the other online shop I didn't have to return the product and say that the key is not working ,In the first try the game got loaded and its a new cd with no scratches at all​, thanks amazon\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"1.0 out of 5 stars\nDVD was faulty\nByRavish Malikon 9 June 2014\nHardware Platform: Pc\n|\nVerified Purchase\nDVD was not working. Ther was no provision to replace and hence had to return back the order. Quite unlike Amazon but still...\nComment\n|\nOne person found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nFinish it off quick..for you go to Kyrat after this !\nByAnubhab B.on 29 December 2014\nHardware Platform: Pc\n|\nVerified Purchase\nLegendary. superceded only by the mighty Farcry 4. Kyrat is waiting for you in the next series. finish this quick !\nComment\n|\nOne person found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nTHE BOMB!!!!!!!!!\nBysumedhon 21 August 2015\nHardware Platform: Pc\n|\nVerified Purchase\njust received the game today.\npros:\n* extremely reasonable price\n* best graphics (looks like real)\n*long campaign\n*good sound\n* and millions more!!!!!!!!!!!\ncons\n*have to download about 1 - 2 gb of updates and patches but is worth it\nso overall go for it\nit better than getting gta 4 or any game in this budget\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nGAME OF THE YEAR -2012\nByAmazon Customeron 21 December 2015\nHardware Platform: Pc\nThis is the best game that I have played....Total insanity...Great epic story....This game is a must for fps players...PLZ IGNORE WRONG REVIEWS.... This game although it has Minor glitches but it is indeed a fantastic game....Lots of places to expore, hunting, combat....Really enjoyed.. I would definitely say to you guys....GO FOR IT\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\n\"Definition Of Insanity\"\nByDhaval Mistryon 25 June 2015\nHardware Platform: Playstation 3\nDefinition of Insanity.. No words for this game just play it... Feel it... One important thing expand the jungle then you will have everything.\nIf you have never played this game you have played nothing. Play this guys coz \"Vaas\" is waiting for you to teach you the real meaning of \"Insanity\".. play it once guys...\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nAmazing game and perfect service!!\nByHarshilon 15 December 2014\nHardware Platform: Pc\n|\nVerified Purchase\nAmazing!! Just amazing gameplay and intense gameplay!! The game.looks very good and story is also interesting. There are interesting side missions and crafting option in this game. Really enjoyed this FPS game so much!!!It was damn easy to install and just play. Really loved the work from amazon pls keep up!!!\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nEXCELLENT!!!!!!!!!!!! And Amazing\nByHrishabhon 19 April 2015\nHardware Platform: Pc\n|\nVerified Purchase\nEverything is just perfect, graphics are excellent and u will not regret buying it, GO for it. It will easily get installed on your pc without problems, multiplayer and co op is also superb. It will update u play which is no big deal after that u can easily start playing. Must Buy.\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nGreat Game\nByRaja Deivalingamon 3 August 2015\nHardware Platform: Playstation 3\n|\nVerified Purchase\nI've never been a big fan of FPS but this game got me hooked because of its storyline still keeping the open world fun intact. Apart from humans , how often do you get killed by Crocodiles,sharks,Tigers and comodo dragon? It's that much of a crazy game.\nA must buy.\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"3.0 out of 5 stars\nawesome game and very good price\nByRahul sinhaon 27 May 2014\nHardware Platform: Pc\n|\nVerified Purchase\nPros:\n-Good overall storyline\n-Good gameplay\n-Good amount of physics\n-Great Graphics\n-Long distance travel has been fixed nicely. It has a Fast Travel feature available on specific locations unlike Far Cry 2.\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"3.0 out of 5 stars\nproblem with voice\nByAmazon Customeron 29 May 2014\nHardware Platform: Pc\n|\nVerified Purchase\ni purchased this game,i installed it and started to play for the 1st time i found that the characters voice was low or there was any voice to hear in story mode,it worked but there was problem with characters voice.overall it was ok.\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"3.0 out of 5 stars\nThree Stars\nBydharmesh umraniyaon 5 February 2015\nHardware Platform: Playstation 3\n|\nVerified Purchase\nfun adventure game but nothing special.\nEDIT\nnow that i look back at it, there are plenty of things to do, good story and graphics but main major flaw for me was the shooting mechanics, never felt any precision.\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"4.0 out of 5 stars\nGreat game..but slow in pace..\nByAmiton 5 May 2015\nHardware Platform: Playstation 3\n|\nVerified Purchase\nGame is great but still need some improvements.. Holding the camera mode while walking is a slacking thing.. Instead of gunfire there could use of silent fist fights.. Guns vibration feedback needs improvement..\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"4.0 out of 5 stars\nawesome\nByManju cson 13 September 2016\nHardware Platform: Pc\n|\nVerified Purchase\nbest ever i played storyline is awesome graphics very good. i played fps games like cod, battlefield but this is totally different...\"did i ever tell you the definition of insanity\"\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nIN LOVE with FAR CRY 3\nByAdnanon 27 September 2014\nHardware Platform: Playstation 3\nOne of the BEST open world games ever.\nInsane action. Superb missions.\nRecommended for all gamers.\nBUY IT. IT WILL BE THE BEST DECISION OF YOUR LIFE. :D\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"4.0 out of 5 stars\nThe best open world gaming\nByMrinal H.on 5 November 2016\nHardware Platform: Playstation 3\nIt is the best open world gaming CD I have ever played . You have the freedom to explore island and activate radio towers or do missions and find your lost friends .\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nfar cry 3\nBymanzaron 21 May 2014\nHardware Platform: Playstation 3\n|\nVerified Purchase\nInteresting and interective game.good engrossing gameplay. Graphics as good as real.driving .speed boat. gliders fun.Must buy for gamers . Highly recommended.\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nLoved the gameplay\nByAjay Raikwaron 28 October 2014\nHardware Platform: Pc\n|\nVerified Purchase\nImpressive game. Loved the gameplay, graphics, location. I enjoyed its co-op mode very much. But the main story campaign is why you should buy it.\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nThe game is too good and the story is awesome\nByYogesh Sharmaon 6 February 2016\nHardware Platform: Pc\nThis is one of my favorites. The game is too good and the story is awesome, I really like the villain in these game and smooth gameplay\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nA beautiful game which makes for a thrilling experience\nByAmazon Customeron 16 December 2015\nHardware Platform: Xbox 360\n|\nVerified Purchase\nMy first xbox game and what a way to start...A beautiful game which makes for a thrilling experience. Got it in a good deal too...\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nGreat game!\nByLakshay DilawriTOP 1000 REVIEWERon 15 March 2015\nHardware Platform: Pc\nIt's one of the best shooting games for PC. The graphics, storyline, game play are really good. Nice work Ubisoft.\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"4.0 out of 5 stars\ngood\nByVibhanshu T.on 30 May 2014\nHardware Platform: Pc\n|\nVerified Purchase\nits worked really well but have a problem getting a game name total ovrdose please send an inquire if available\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
}
]
}