
{
"keywords":[
"1",
"2",
"3",
"4",
"5",
"6",
"7",
"8",
"9",
"10"
],
"reviews":[
{
"review":"5.0 out of 5 stars\nEpic Game Far Cry 'Primal\" The Best Far Cry In The Far Cry Franchise.\nByAkmathambil | XplCreRTOP 500 REVIEWERon 22 January 2017\nHardware Platform: Pc\n|\nVerified Purchase\nFar Cry 'Primal\" The Best Far Cry In The Far Cry Franchise. (Game play, Items Included, Benchmark, Installation & Result)\nDuring the last 10 days of my game play the game has taken me away to a set of 10,000 BCE where giant beast rule the world of Oros, where human are in the bottom of the food chain, need to survive, hunt for food or become a food, Kill or Live.\nIn this Game Play you are a Takkar (The Beast Master) who need to find his Lost Brother (Brashta) in the Land Of Oros, Gather Them, Tame Beast & Learn New Skills & Deadly Weapon to Defeat the Enemy Tribes. The Enemy Udam (Ull Flesh Eating Monster) & Izila (Batari The Sunwalker) Takkar (The Wenja) need to defeat their enemy to Conquer the Land of Oros & Rise above Extinction.\nBox Included Items:\n1. Far Cry Primal (Special Edition) 2 DVD [Dual Layer DVD]\n2. Important Note (Contains CD Key & Instructions)\nGame Installation: (Shown in Pic Also)\n1. Insert the DVD into the DVD drive. (Double Click the Drive to start automatically or just Locate the Setup from the drive & Run.\n2. Once the Setup is Run it will ask to 'Install' Just Click on the Install.\n3. Then a Uplay Login will Pop up as this is a Uplay Installer so Uplay Account + App is Mandatory on Your PC, Just Install & Create an Account.\n4. Next you have to put your CD Key in the Activation Code & then click Continue...\n5. Select where to Install a Game (I Prefer it to be Default Location for novice Users)\n6. Then in Between the Installation you will be ask to Insert the Disc 2, Just Insert It & press OK.\n7. After the Installation complete, Just launch from the shortcut which has been created in your Desktop.\n8. Once Lauched it will look for patches available. So Patch 3 is Available, it is around 1.13 GB file need to download for Latest Update via Uplay\n9. Game Updated then just lauch the game from Uplay or From the Desktop Shortcut. Now You Are Ready To Play.\n+. Make sure you have All your Driver up to date for ease pleasant game. (Graphic Card Driver the most Important)\nAfter Playing The Game: (Checkout the Snapshots In Pic)\n1. It's a Long Way Journey in this game. The Outpost, The Bonfire, Free Wenja, Tame Beast etc...to capture the Land Of Oros.\n2. It Take Me About 60hrs of Game Play to Complete the whole Game.\n3. There are no Gun to Shoot or Car to drive but there is much more to explore & upgrade your skills to learn takedown from Club, Spear, Arrows, traps, bee bomb & Shard takedown & even OWL & Beast command them to attack your enemy with You & have Lot of Fun.\n4. All your Weapon you have in your hand Play As You Want to Conquer The World Of Oros.\nGame Played System Specification: (OS - Windows 8.1 Enterprise) [DirectX 11]\nCase - iball (Legacy Modded)\nCPU - Intel i7 4771 GEN 3.5 GHz (no Turbo 3.9GHz)\nMobo - Asrock Pro BTC H81 (no OC Tweak)\nRAM - Corsair Vengeance 16GB DDR3 (XMP-1600Mhz Dual Channel)\nHDD - WD Purple Survellence 2TB (6Gbps for Games)\nGPU - Nvidia Geforce GTX 750 Ti OC MSI (Running on PCIEx16 [2.0])\nSMPS - L&C technology 400 ATX (Modded Max-450W)\nNote: Before Purchasing the Game make sure your System met atleast Minimum Requirement.\nResult: This is a Must Play game with New Experience in Far Cry never before. A Open World Game which are High Demand. Get Ready For Original Fight For Mankind's Survival. Welcome To The Stone Age (10,000 BCE)\nComment\n|\n3 people found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nFULL ADVENTOROUS GAME....MUST BUY..YOU WILL SURE LOVE IT..\nByUmasankar Ghukuon 22 March 2016\nHardware Platform: Pc\n|\nVerified Purchase\nHI MY ALL FRIENDS(AMAZON FAMILY)...I AM VERY HAPPY TODAY AFTER BUYING AND PLAYING THE GAME..IT'S UNBELIVABLE ADVENTOROUS OPEN WORLD STONE AGE GAME..\nI BOUGHT IT FROM AMAZON 16 MARCH 10 PM..(VIA GAME ADDICTS AND GOT SPECIAL EDITION)DELIVERED TO ME ON 21 MARCH..AFTERNOON..\nINSIDE THE BOX=>>>2 DVD ROM {NORMAL DVD ROM(8.5 GB EACH)NOT BLUERAY}AND ONE ACTIVATION KEY...\nNOTE=>>>1)INSTALL ADOBE READER TO VIEW MANUAL FILE(PDF)\n2)INSTALL ADOBE FLASH PLAYER IN PC\n3)THIS GAME ONLY SUPPORT IN 64 BIT ONLY..\n4)INSTALL LATEST GRAPHICS DRIVER(INTEL) AND GAME GRAPHIS DRIVER (NVIDIA OR ATI REDON)WHICHEVER YOU HAVE..THIS IS MUST..DOING THING\n5)INSTALL IDT AUDIO LATEST DRIVER(IF YOU HAVE IDT)OR ANY DRIVER FOR SOUND QUALITY AND NOT INTEREPTIONING...\n6)INSTALL UBISOFT UPLAY FROM UBISOFT..WEBSITE..THIS IS MUST OTHERWISE THE GAME WILL NOT OPEN..\n7)YOU HAVE TO CREATE UBISOFT UPLAY ACCOUNT TO LOGIN AND INSTALL THE GAME(MUST)DO...\nHOW TO INSTALL=>>>1)INSERT DVD 1(THEN IT WILL ASK YOU THE CD KEY JUST PUT THE KEY)INTERNET CONNECTION REQUIRED.. THEN A POPUP OPENS..(ISTALL FROM THE UBI GIVEN ISTALLER)\n2)IN CONTUNING TO INSTALLATION IT ASK YOU TO INSERT DVD 2 JUST OPEN THE PLAYER AND INSTALL DVD 2(IT AUTOMATICALLY DETECTS FOR CONTIUNING ISTALL)\n3)IT IS AROUND 13.79 GB (TWO CDS)..\nNOTE;=>>>>>THERE IS ADDITIONAL 922 MB(DAY 2 PATCH)REQUIRED TO DOWNLOAD..IT AUOMATICALLY ASK YOU WHEN YOU WANT TO LAUNCH THE GAME..\nHOPE THIS HANDS ON REVIEW WILL BE HELPFULL..I WILL GIVE YOU SOME SNAPSHOTS..THANK YOU ALL...\n1 Comment\n|\n35 people found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\ntribe expansion\nByKiranjith Non 4 May 2016\nHardware Platform: Playstation 4\n|\nVerified Purchase\nlovely game, just getting hours of endless play, games updates improves graphics and user interface without changing settings, new game for ps4 platform, you get to conquer tribe villages, outposts, tame beasts, claim bonfires, expand your own village and population.\nComment\n|\n2 people found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nReclaiming the Oros land is Satisfying.\nByAmazon Customeron 9 February 2017\nHardware Platform: Pc\n|\nVerified Purchase\nOpen world is harsh and ruthless ..The graphics visual i rate 10/10 ..Taming the rear beast in game is challenging..Average story. 13 Main Missions.Side Mission are pretty good. Playing the game in survival mode is challenging.. Fan of far cry series you can definitely try this one..\nComment\n|\n2 people found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"4.0 out of 5 stars\nGot to play it if you haven't played the far cry before\nByy0geshon 9 May 2016\nHardware Platform: Pc\n|\nVerified Purchase\nFar cry primal is great game if u haven't played the previous far cry games because there's no change in game play compare to previous once as I was playing far cry 3 & 4 continously and I was looking for something different in gameplay strategy but if u are looking 10,000 BC experience with tamming beast it's the game u want to purchase.\nComment\n|\n2 people found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nGraphics is awesome. Gameplay is awesome if you are going for ...\nByRatan Kant Vermaon 25 January 2017\nHardware Platform: Xbox One\nI have played FarCry 3, I have not played FarCry 4. Now I am playing this game. It is simply on the another level and is different from others in FarCry series. Graphics is awesome. Gameplay is awesome if you are going for main missions. But for that you need to have many important skills like taming of beasts and weapons like bee cluster (kind of work like a Granade). Overall best game in FarCry series. Still FarCry 3 is on higher ratings.\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"1.0 out of 5 stars\nInstallation problem..\nByAmazon Customeron 7 September 2016\nHardware Platform: Pc\nI ordered this game before 5 days n it reached today on 6 th september 2016..but the problem is when the first cd i inserted it made me open an ubisoft account n in the process it asked for the cd key n i add that..then after the whole process is done..the installation is not started..nothing is happening..n i have adobe reader upgraded windows 10 8gb ram nvidia gtx 960 i5 4th gen\nPlz help someone...\n2 Comments\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nFive star\nByANOOPon 2 September 2016\nHardware Platform: Pc\n|\nVerified Purchase\nAwesome game better than any other farcry serious. There is a lot more skills in this game that make wonderful game play .after 10 hours of game play I would like to say I am really addicted.\nThere is no lag even ultra settings in my gtx970,I got 56-60fps .I think new patch improved the game performance .so everyone should be update the new patch before playing.\n1 Comment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"4.0 out of 5 stars\nGood game and nice concept\nByP. P.on 1 May 2016\nHardware Platform: Pc\n|\nVerified Purchase\nThe game is made in prehistoric time scale and is beaitifully done. The animations of many vital things are dine beautifully. Tame beasts and ride them. Use of environment is the best thing of this game. Save your people and build your village is a nice concept. Overall the game is very good and Ubisoft has made it masterfully. Enjoyable and addictive, the game turns on your thinking power to analyze and find solution to various things in the game world\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nJust awesome\nByAmazon Customeron 7 January 2017\nHardware Platform: Pc\n|\nVerified Purchase\nAmazing game with awesome graphics and gameplay\nMany new things are introduced first time in far cry series very easy to install just need 1.13 gb of download\nFast delivery from Amazon\nJust loved it !!!!!!!!!!!\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"4.0 out of 5 stars\nAwesome Game!!!!!!\nByMeliodason 11 December 2016\nHardware Platform: Pc\n|\nVerified Purchase\nAwesome game!!!!\nOutstanding graphics.. and very good story. I got special edition with 3 extra missions. But little disappointed by Amazon's delivery this time as the box was not in good condition.\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nopen world game .....with prehistoric stone age theme\nByrajendra wableon 22 October 2016\nHardware Platform: Playstation 4\nI got this game from psn store for 1830 ruppess Best open world game. .ever created in the history of far cry series....\nits completely different from the farcry games ubisoft has made...\ngraphics are awesome no matter which platform you buy it on....\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"4.0 out of 5 stars\nExcellent game\nBySARAT CHANDRAon 15 April 2016\nHardware Platform: Pc\nAwesome game.The good part is you can play offline.It gets better if you have good headphones on while playing,cuz you really feel like you are in the Stone age.Another good part is that the story is not linked to any of the previous games in the far cry series.The only bad part is that you can complete the story if you sit for 24 hours.overall a very good experience\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"4.0 out of 5 stars\nAwsome also\nBydeepakon 6 August 2016\nHardware Platform: Pc\nAwsome game with awsome graphic.\nBut the game is about primal so dont expect more the main killing weapon is bow&arrow.\nBut u will low playing it the hour will pass like lightning speed ;-)\nSo go for it a good game with a good story line it will definetly entratine u\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nGrt campaign and map. A must buy for open world lovers.\nByOhm R. Charanon 11 October 2016\nHardware Platform: Pc\n|\nVerified Purchase\nThis game is very grt. It is a must buy for every far cry franchise lover. The only thing bad about this game is no co-op or multiplayer. And you got lesser weapons but it's stone age. And the new features aee grt. The graphics of environment and animals are so realistic.\nComment\n|\nOne person found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\n2nd best far cry\nByMichael Mathewon 6 March 2016\nHardware Platform: Pc\n|\nVerified Purchase\nGuys this is a wonderful looking game on pc and well optimized one too. U would have to download just about 850MB of the day 1 patch which is actually quite fine unlike the unoptimized Batman arkham knight pc version. The gameplay though quite similar to far cry 3 and far cry 4 is great but it is not exactly the same. The bow and arrow and the spears were great. The only con that i felt ,which is also mentioned in most of the reviews, is the inability to dodge or side step when fighting in close combat. Hope they release a patch where that could be made possible.\nI dont know why it has mixed ratings on steam. But if u are a a far cry fan then this is something u definitely must check.\nComment\n|\n3 people found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nBest & Fresh in Far Cry Series\nByRaza Rahil Hussainon 7 March 2016\nHardware Platform: Pc\n|\nVerified Purchase\nGreat game as expected, different than normal Far Cry game. Primal series brings the freshness to Far Cry series.\nThere are no Guns in the game, you've to fight with Spear, Bows, Shard & Club. But good things is that the game has throwable weapons like Fire Bomb, Sting Bomb, Berserk bomb etc. Bombs will unlock in the later stage of the game.\nUSP of this game is the Beast, If you've played Shangri-la stage in Far Cry 4 game then you remember there is tiger which follows with us and kills the opponents. Same thing happened with Primal, you can choose variety of animals as your pet. And they'll follow with you everywhere. There are also master animals which require special skills to tame them but there are very useful if you tame these in an early stage.\nThe bad part of the game is you need resources lots of them, you'll fed up with the resource gathering.\nThe Box comes up with 2 DVD and after that you need to download 800 MB extra to start playing game( Size changes when you'll purchase)\nComment\n|\n4 people found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nExcellent game with lot of amazing skills\nByAmazon Customeron 3 May 2016\nHardware Platform: Playstation 4\n|\nVerified Purchase\nExcellent game with lot of amazing skills. Felt like i am watching Apocalypto movie\nSo many things which makes this game interesting like Survival skills, taming wild animals, stealth mode and huge open world\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nGame is like Darwin theory\nByPerfection seekeron 29 February 2016\nHardware Platform: Playstation 4\n|\nVerified Purchase\nIt's a difficult games no guns and nothing Stone age bow and arrow always vulnerable to animals and other tribes and terrain which make it difficult. Every time you have to think you should go out or not. Your senses always at alarm. Game is like Darwin theory. I give it 5 star because of it difficulty level.\nComment\n|\n7 people found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nOne of the best open world survivor game ever made\nByKapil Vyason 6 March 2016\nHardware Platform: Playstation 4\nOne of the best open world survivor game ever made. The game is undoubtedly difficult and thats where the fun begins.. The most interesting thing about the game was the language and english only used as subtitles that gives an amazingly realistic view..\nAnd last but not the least bloodfang sabsrtooth 👍👍👍\nThe only thing i miss in the game was that it should have some online connectivity the whole game is offline :(\nComment\n|\n3 people found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nMy Opinion\nByRPMon 3 March 2016\nHardware Platform: Playstation 4\nThis is one of the best games I have seen so far. It has a great story-line which most of the games these days lacks. Along with this great story-line stunning graphics makes this game a must buy. I have started playing this game and I love it so far. Even the absence of guns doesn't matter when you have a perfect piece of cake like this. Good job developers.\nComment\n|\n3 people found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nFive Stars\nByAmazon Customeron 15 March 2016\nHardware Platform: Playstation 4\n|\nVerified Purchase\nEXCELLENT PACKING AND WORKING VERY WELL\nComment\n|\n3 people found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nFan or No Fan .. You should still go for it...\nBySaurabh S.on 19 May 2016\nHardware Platform: Playstation 4\n|\nVerified Purchase\nIt's a great game if your into First Person and a Far Cry Fan then you should go for it.. Since it's open world and set back in 10,000 B.C certain things could make it look lengthy as you have to collect items and craft them so if you don't craft your items well it could get tricky to complete this game.\nOver all good game probably 2nd best after Uncharted 4 - A Thiefs End.\n:)\nComment\n|\n2 people found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nthe fun begins, then its really interesting to play\nBysurajon 7 March 2016\nHardware Platform: Pc\n|\nVerified Purchase\nPre-ordered PC version of this game, done with 10 hours of gameplay time, its superb, graphics at daytime and night is superb, The game is undoubtedly difficult but once you learn to tame the beast, the fun begins, then its really interesting to play. Great story-line, stunning graphics makes this game a must buy.\nComment\n|\n2 people found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nMust have game\nByMadhur Guptaon 2 March 2016\nHardware Platform: Playstation 4\nAwesome graphics best ever far cry, i preordered from game the shop and got free steelcase, sabretooth ulc and legend of mammoth mission\n1 Comment\n|\n8 people found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"4.0 out of 5 stars\nGreat offer by amazon\nBySupreeth Nagarajon 13 March 2016\nHardware Platform: Pc\nGreat offer by amazon. They are saving 25bucks from us. Great 1% offer guys.. Dont wheather to laugh or to get impressed by this offer. Have given 4 stars for the game and not for this offer by amazon\n1 Comment\n|\n2 people found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"3.0 out of 5 stars\nStone age, tame beasts, great game.\nByRahul Amazonon 17 April 2016\nHardware Platform: Pc\n|\nVerified Purchase\nI had pre purchased this game, got some extra mission. FarCry is one of my fav. Franchisee. Graphics and Story line is great. Taming of animals is the best part in the game. The game would have been much interesting,but ok. However, i was bored playing with guns, but this game was a great change for me. Completed the game in 3 days, playing it again.\nThe package of the game case is not at all good. I had brought far cry 4(rest of the series had got it from steam) ,its packaging and user manual was great comparatively.\nOverall, a must play, but the price is too high for it!\nComment\n|\nOne person found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nNo guns! Who cares!\nByShubhrav Phate - Techie | Camera Junkie | PC Enthusiaston 3 March 2016\nHardware Platform: Pc\nSo I've bought this game directly off steam and here are my impressions.\nAfter playing all the FarCry series games and a true admirer of Ubisoft I must say that this game at first may sound a little boring.\nFPS itself describes itself as First Person Shooter but there is no shooting just throwing clubs, hitting with clubs and occasional archery.\nNevertheless the game doesn't lose it's appeal. Why?\nThe story line is breathtaking. The scenes are phenomenal.\nI'm still in the early stages of the game with roughly 2 hours of game play time.\nI will update this review as I go ahead.\nAnd the experience will be superior on PC as it is a FPS game and you have more flexibility in terms of graphics and when you have a super hot rodded rig like mine you won't look at that console which is actually gathering dust behind my TV.\nFARCRY PRIMAL ❤\nComment\n|\n4 people found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"1.0 out of 5 stars\nAn average game overall\nByAmazon Customeron 14 September 2016\nHardware Platform: Playstation 4\n|\nVerified Purchase\nSince i have played far cry 4 thus i found this game not upto that level. Anyways its a nice game, developers must have worked hard creating it.\n1 Comment\n|\nOne person found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"4.0 out of 5 stars\nNice game !\nByAmazon Customeron 11 July 2016\nHardware Platform: Xbox One\n|\nVerified Purchase\nThis is my first game of the far cry series and it's a good game. U start as takkar gathering resources and bringing together the wenja tribe. There are other rival tribes called the udam and the izila. We can take over the outposts one by one until we reach the final boss character. Overall is a polished game and u will have fun playing it ! Thanks for reading 👍🏻 btw I got it for the Xbox one if u are wondering !\nComment\n|\nOne person found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nWORTH THE MONEY !!!!!\nByRoneyon 18 August 2016\nHardware Platform: Pc\n|\nVerified Purchase\nAwesome open world gameplay. Note that you will have to download 1.16GB update from uplay before playing the game.Graphics and storyline is great. Taming of animals is the best. No cd is needed to play. JUST GO FOR IT !!!!!\nComment\n|\n3 people found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nWonderful\nByAmazon Customeron 11 March 2016\nHardware Platform: Pc\n|\nVerified Purchase\nReally loving it .\nBut it needs good PC specification.\nDelivery is very fast .\nComment\n|\nOne person found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nFive Stars\nByGamelover☺💝on 10 May 2016\nHardware Platform: Playstation 4\n|\nVerified Purchase\nOmg game best far cry game graphics were really good and delivery was also good\nComment\n|\nOne person found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nGreat work Ubisoft\nByMyworld2912on 26 November 2016\nHardware Platform: Pc\n|\nVerified Purchase\nThe gameplay will feel a wee bit repetitive if you already have played another games in this franchise but overall it's a new experience as the game is set in 10000BC, graphics are great and runs flawlessly even on my mid end gaming laptop and as expected of Amazon got it 3 days before the delivery date.Give it a go and you won't regret it.\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nawesome game\nBylalit sonkeshariyaon 2 June 2016\nHardware Platform: Pc\n|\nVerified Purchase\nJust received at 999\nBought from cloudtail\nSpecial edition with 3 extra mammoth missions\nOnly in 998₹\nAwesome deal\nPackage contain only two dvds and key\nFeels little disappointed on ubisoft they atleast include a plastic case for dvd\nOverall\nGame is too fine for me\nEnjoying it since 3hrs\n1 Comment\n|\n2 people found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"4.0 out of 5 stars\nneed update of 1.6 gb in order to play offline...\nByShashank Kaundalon 27 June 2016\nHardware Platform: Pc\n|\nVerified Purchase\nyet slow delivery but good product ..but packing was not as good as flipkart ....this game runs perfectly fines on win 10 but u need to download 1.6 gb of update in order to play online and offline ....overall good product.\nComment\n|\nOne person found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nDON'T LET 1 STAR REVIEWS DERAIL YOU\nByBIG BOSSon 24 February 2016\nHardware Platform: Playstation 4\nI've been a fan of Far Cry since Far Cry 2 and h ave to say that this is a breath of fresh air in the series and one that was overdue. The stone age setting is new terrain and Far Cry does this really well. At the start of the game, you feel really vulnerable when you're out exploring and coming across a few beasts that will tear you limb from limb with only a stick and stone to defend yourself. An hour in and the beast mode is really fun to use such as taming an owl which can scout an area and mark enemies and a wolf that you can command to attack enemies. The world is green and lush and you will be in awe of the detail and colour of the land as you would normally associate the stone age with dullish tones. The story, for me anyway, is actually quite gripping so far. The crafting system has been heavily been re-designed and you now need specialist villagers to upgrade certain things on this menu. Oh and you get your own village with its own population and gain more based on what you do out in the world which is also fully upgradeable. In short, the game is worth every penny and it is a blast to play. Go For It without thinking. Its a Far Cry game afterall\nComment\n|\n6 people found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\na best game to buy this summer\nByANBUKIRANon 6 April 2016\nHardware Platform: Pc\nIts beyond the limits.high end graphics😀😀😃😄😊☺😉😍 love it.\nComment\n|\nOne person found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nI'm loving it.\nByPrashant Anandon 11 February 2017\nHardware Platform: Pc\n|\nVerified Purchase\nAwesome game as far cry series good realistic environment.\nComment\n|\nOne person found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"4.0 out of 5 stars\nAddictive.\nByMahekon 10 August 2016\nHardware Platform: Playstation 4\n|\nVerified Purchase\nWhile the gameplay can be repetitive as there is not much novelty in terms of storyline or the narrative structure, it's still highly enjoyable and addictive, too. Quite rewarding when you finish the game!\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nOne you need.\nByChirag Vhatteon 12 July 2016\nHardware Platform: Pc\nAs usual, on time delivery by Amazon. Purchased for Rs.999 on Lightening deal so hats off for the discount. Although Amazon could provide more PC games at a better discount. Although a nice game .\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nExcellent Game but I have a GEFORCE GTX 610 a ...\nByAmazon Customeron 5 September 2016\nHardware Platform: Pc\n|\nVerified Purchase\nExcellent Game but I have a GEFORCE GTX 610 a 2GB Graphic Card and Intel i5 with 8GB Ram but Farcry Primal Runs very slow on it and gets stuck in a certain place during a mission I don't know why???? Can someone help me with that because it's a nice Game after all that I am still anxiously waiting to play without any lag\n2 Comments\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nOne of the Best game series Ever\nByNivedon 17 July 2016\nHardware Platform: Playstation 4\n|\nVerified Purchase\nBuy ASAP if u haven't played it yet & still thinking. It's worth every penny. Have finished game twice but still want to play more. A must in every Gamer's collection.\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nTotally amazing!\nByAmazon Customeron 7 December 2016\nHardware Platform: Xbox One\n|\nVerified Purchase\nIf you are a fan of the far cry franchise, then you won't be disappointed.. I thought the lack of guns would bother me but I was wrong. It's an amazing game. Try it!\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nBest Game in last 1 decade\nByMax Don 14 February 2017\nHardware Platform: Pc\n|\nVerified Purchase\nThis is the best game ever in last 1 decade. Soo realistic gaming experience.\nI wonder if anyone can write bad review about this game? Anyone? ;D\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nAwesome game really enjoying.....\nByAmazon Customeron 1 June 2016\nHardware Platform: Pc\nIt's an special edition.....\nComment\n|\nOne person found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"4.0 out of 5 stars\n... set in the stone age but still a very good game with lots of stuff to do\nByPrachi Raion 14 January 2017\nThe choice of weapons in this game is very low as its set in the stone age but still a very good game with lots of stuff to do.\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nGood one !\nByJeffyon 22 May 2016\nHardware Platform: Pc\n|\nVerified Purchase\nAwsome game ! Frst i got bore with thos game but slowly am adicted to this game , stunning graphics and a good story.\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"1.0 out of 5 stars\nworstfar cry game ever\nBysadon 7 February 2017\nHardware Platform: Pc\nthe worst far cry game ever.dont buy it.its a caveman simulator.no story .no action.dont waste your money and time\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"4.0 out of 5 stars\nFour Stars\nByRonak P.on 12 June 2016\nHardware Platform: Pc\n|\nVerified Purchase\nExcellent experience of stone age no other game has done that better in describing the 10000 BC era\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
}
]
}