
{
"keywords":[
"1",
"2",
"3",
"4",
"5",
"6",
"7",
"8",
"9",
"10"
],
"reviews":[
{
"review":"4.0 out of 5 stars\nExplosions. EXPLOSIONS and MORE EXPLOSIONS!!\nByShubhamon 3 April 2016\nHardware Platform: PS4\nJust a few weeks back from its release I had stumbled upon just cause 3's trailer. Since I was completely oblivious to the series, I checked it out. Surprisingly , it blew my mind with its awesome visual appeal and mind boggling stunt sequences!\nComing to the game, just cause 3 looks like a fantasy come true of action fanatic directors Michael Bay and Rohit Shetty. The game world is set in a Mediterranean island, Medici which is spread across whooping, jaw dropping and panting 400 square miles of area! Rico Rodriguez's job in this world is to destroy the military bases of general Di Ravello and end his dictatorship.\nIn order to succeed, Rico flies (and walks on) jets and helicopter , drives everything from a tractor to a classy F1 car, rides a rocket conveniently and glides across the sky like a hawk with its wingsuit and a parachute ( which actually needs some time to get used to ). It makes one feel like a superhero crafted out of spider man and bat man which is absolute fun when mastered. Just cause 3 does full justice to its beautiful massive world when it comes to travelling from one point to another. One can merrily glide across seabed , forests and mountains. Entering into combat mode is an absolute pleasure as the beautiful world can be slaughtered and turned into a debris with extremely loud and radiant explosions . It's usp is the freedom that it offers to a player rather than dictating terms of accomplishing something. Say if you wish to blow up a tower? Nose dive a plane into it or blow it up with a tank. Your choice. Want a helicopter to buzz off? Smash it into the ground with tethers or latch on to it and throw the driver out and take control! Your choice ! Most of the action in the game takes mid air while gliding and you can easily blow up guys while airborne . 'Stealth ' is not to be found in Rico 's dictionary . The open world is full of challenges such as skydiving , racing , bombing etc. Which offer you upgrades after completion. This adds another variety to game play.\nWhere just cause 3 disappoints is its short storyline. It is not even a fraction of the size of its open world. When I finished the campaign in 1 week, I was like THAT'S IT?? Nor The voice acting and neither the side characters impress much . Also , somewhere down the line, the massive open world certainly entertains you with its beauty but does not charm you enough to leave a lasting impression. Imagine a world which is stuffed with forests , mountains and seabed which are only meant as a playground for you to glide across but does not offer you anything more than explosions and race courses to make them iconic. It certainly feels incomplete . And last but not the least. It seems like the game is not optimized nicely for the PS4. It runs at 30 fps in normal conditions but when you jump into action and things heat up with explosions, tanks and helicopters , the frame rate drops to 20 fps. In a couple of cases I have even noticed 5-10 fps which left me fuming! It should not be happening on such a powerful console.\nOverall, just cause 3 is an absolute entertainer. It knows how to laugh at itself and how to provide non stop hours of action and thrill. If you are one who wants a break from stealth based games which are full of dark and gore theme. This one certainly breaks the cobwebs and gives a chance to live your wild fantasies to the fullest.\n7.5/10\n3 Comments\n|\n14 people found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"3.0 out of 5 stars\npretty fun\nByritvik narangon 9 March 2017\nHardware Platform: Pc\n|\nVerified Purchase\nThe graohics destructability physics are great but the non sensical plot repetitive n tideous missions are some problems.The most fun moments are skydiving destroying everything and most importantly THE BADASS WING SUIT OH YEAH and the that shooting is really solid\nComment\n|\nOne person found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nCountless Hours of Fun and Destruction.\nByUtkarsh Kalmeghon 15 September 2016\nHardware Platform: PS4\n|\nVerified Purchase\nIf you are a leisure gamer and dont care much about story, but like smooth and longer gameplay, well this is the game for you.\nGiven your apetite for redundancy is strong, pretty much nothing is wrong with this game.\nGuns. Check\nCars. Check\nPlanes. Check\nChopper. Check\nRocket launchers. Check\nMIND NUMBING DESTRUCTIIN. CHECK\nGo for it.\nComment\n|\n3 people found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nAWESOME GAME\nByAmazon Customeron 20 February 2017\nHardware Platform: PS4\n|\nVerified Purchase\nGot this game for PS4 today played for 2 hours and this game is just awesome. Story is just average but the gameplay is simply best.if you are fond of action games then this is a must buy.i got this game for 1300 which is tottaly worth it.You should also download 2.33gb update for ps4 which makes game run more smoother and faster.\nGameplay- 8/10\nStory-7/10\nGraphics- 8/10\nComment\n|\n2 people found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nExcellent\nByUnbox Rebellionon 21 March 2016\nHardware Platform: PS4\n|\nVerified Purchase\nNice game by square enix. The story mode is good.\nThe power Rico habe is awesome.\nIf you play the full game you will chaos.\nToo much of explosion in game which makes it more good.\nHijack vehicles, grapple etc.\nComment\n|\nOne person found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nI love this game , amazon is best\nByDargeyon 27 October 2016\nHardware Platform: PS4\nBest game man worth the price . Buy it now don't get other games now . Buy just cause 3 now . I love this game . Holy s*** ! !!!!freaking amazing game . Best open world I love it . TrusT me best game.I love it .\nComment\n|\nOne person found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"4.0 out of 5 stars\nThe story is not bad either. You have to liberate many bases\nByInduManuon 11 June 2016\nHardware Platform: PS4\n|\nVerified Purchase\nThis game has come a long way from previous Just Cause games. The world (which is Medici,Italy) seems a lot more bigger and interactive than JC2. The story is not bad either. You have to liberate many bases, cities, outposts etc. You can drive anything from sports cars to tanks and fighter jets. The missions are repetitive. This game can get over very fast. But if you are looking for a shooter game, you must definitely buy it.\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"1.0 out of 5 stars\nDid not work with my pc!\nByv manojon 31 October 2016\nHardware Platform: Pc\n|\nVerified Purchase\nDid not work with my pc, as I had a intel i3 processor. And no return was available 😢😢😢\n1 Comment\n|\n3 people found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"3.0 out of 5 stars\nThe game easily deserves a 3 star rating since the gameplay is ...\nByUlayeron 13 July 2016\nHardware Platform: PS4\n|\nVerified Purchase\nThe game easily deserves a 3 star rating since the gameplay is smooth... The graphics are immersion and the storyline is somewhat modern with a touch of nature and detour... Equipped with a grappling hook a parachute and a wingsuit u needn't think twice before jumping.. While I feel this game is a little high priced for the story is small and it gets monotonous after some time.. There are better games out there.. But if u only wanna play this for the gadgets and the fun of shooting then this is the game for you\nComment\n|\n2 people found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"4.0 out of 5 stars\nShould You By This Or Not ?\nByBEST GAMER ALIon 28 December 2015\nHardware Platform: Pc\n|\nVerified Purchase\nHello Everybody,\nThis Is Bestgamerali , And Today I Am Going To Tell You, That Should You Buy This Game Or Not .. So First Thing , Just Cause Game Series Has Been Awesome , And Especially The Just Cause 2 Which Got Too Many Of Good Reviews And Ratings .... We All Have Been Waiting For Just Cause 3 For A Long Time .. And Now After Its Arrival We All Just Wanted To Buy The first Edition Of This Game ..\nSo Some Important Things This Game Pack Includes Dlc Contents ( Weaponized Vehicles Pack) ... So You Get A Game With Dlc ( Just Like First Edition ) ... Now Lets Talk About The Price , When I Bought This Game It Was Around Rs 1500 .. So At This Price Buying A Game Like This Is Like Finding A Treasure ... Now Lets Talk About The Performance .. The Game Runs Fast In High End Desktops ... Remember If You Have A Mid Range Desktop .. I Prefer Not Buying This Game Until You Get A New System Or Upgrade Your Desktop ... Make Sure To Check Out The Game Requirements .. And When The Game Requirements Meet Your PC Requirements Then You Are Good To Go With The Purchasing Of The Game ....\nNow You Might Have Seen Many Videos Of This Game , Saying That The Game Lags And Has Some performance Issue ... That My Friend Has Been Fixed ... As A Patch Has Been Released ...\nMy Suggestion ... Buy The Game , If You Got A Good Pc.. And This Is Probably The Best Game Ever Created By Anyone .... You Will Love The Game As It Has More Than 2 Times Bigger Map Than Gta 5 .\nMy Rating For The Game\nGameplay - 10/10\nStoryLine - 5/10\nGraphics - 9/10\nPerformance - 8.9 / 10\nCome On Buy This And Enter The World Of Chaos ...\n[...]\nComment\n|\n32 people found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nAweosome game☺☺\nByAditya Guptaon 21 August 2016\nHardware Platform: PS4\n|\nVerified Purchase\nExcellent got the game very early . Amazing game. Bought it for just Rs.2000 from the seller BEYOND TOYS AND GIFTS. It's a genuine review . I bought this game because of other reviews I read and all were true. So u should buy this game to complete your game collection!!\nComment\n|\n5 people found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nJust Causing chaos\nByAyush Tavaron 28 December 2015\nHardware Platform: PS4\n|\nVerified Purchase\nJust cause 3! More like Just mayhem 3!\nThe game is just amazing in terms of open world gameplay and the visuals are just stunning. The fictional island of Medicci is one of the most beautiful world's in a game.\nContrary to what I've heard, the loading times aren't bad,2 mins at max. I did experience some bugs but they weren't severe. And the online logging in can be tedious at times. But these are the only things wrong with this incredible game.\nThis a must play and will offer hours of explosive gameplay.\nComment\n|\nOne person found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nGreat Game But ..\nBySubham Kumaron 3 December 2015\nHardware Platform: PS4\n|\nVerified Purchase\nJust Cause 3 is a great game plagued by two issues that constantly rear their ugly heads to break up the fun. The unbearable load times and incessant login attempts can often times sap the energy right out of the excitement. Luckily, just a few seconds with the game can bring the life right back for those willing to deal with the constant frustration.\nPS : And there's no point of Pre-Ordering games from Amazon cause they never deliver the product on launch day.\n1 Comment\n|\n7 people found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"3.0 out of 5 stars\nOpen world game with some huge blast sequences !\nByAnubhab B.on 17 December 2015\nHardware Platform: Pc\n|\nVerified Purchase\nSquare enix was very particular to state that this game has 400 plus square miles of virtual playing area in all the pre-reviews that they had done. And prior to the 12th December update from steam, that was basically bundled with a game which has numerous frame drops in extreme settings and high load times. The blast sequences and physics are pretty nice, with the added bonus of the parachute climber.\nCons :\n1. Random frame drops and high load times\n2. Linear story line with mediocre cut scenes to bundle with\n3. Repetitive after some time\nPros:\n1. Very expansive gameplay level\n2. Weaponised vehicle DLC (for pre-orderd retail)\n3.Blast and movement physics\nIn all, its passive fun, but it has a long way to go before it catches up with the likes of Farcry and GTA in the level of replay dynamics. But if its a consolation, it does have some of the best blasts in-game\nComment\n|\n2 people found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"3.0 out of 5 stars\nVisual treat but sickening frame drops.\nByMilindo Ghoshon 14 March 2016\nHardware Platform: PS4\n|\nVerified Purchase\nThe game's a visual treat. However, there are frequent frame drops in the gameplay (improves after the 1gb+ update on PS4). Still, worsens during prolonged/heavy explosions. I don't know what Square Enix NY is going to do with this but it's really disappointing.\nComment\n|\n4 people found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nGreat game\nByAakash sethon 21 March 2016\nHardware Platform: PS4\n|\nVerified Purchase\nGot it for my ps4\nAwesome game with good graphics and great gameplay\nComment\n|\nOne person found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nU must know this!!!\nBySush2on 29 December 2015\nHardware Platform: PS4\nI have been using it for 2 months and it working real fine.. U should got it now.. No issues.\nI got it at 10% discount from here--http://amzn.to/1NSQKnP\nIf you liked it please click \"Yes\"\nThanks\nLove. Peace. Unity\nComment\n|\n4 people found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nRico Rodriguez is a SuperMan | Just Cause 3\nByAbhinav Singh Salariaon 13 December 2015\nHardware Platform: PS4\nAmazing for Fun Total destruction, defying the law of physics ......Rico Rodriguez is SuperMan\nBTW here is an awesome fun video : https://www.youtube.com/watch?v=8vOUpU0BgHk\njust get it not just for the story line but also for great fun\nComment\n|\nOne person found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nAddressing Some Concerns.\nByAumkaron 3 December 2015\nHardware Platform: Pc\n|\nVerified Purchase\nNot reviewing the game here, addressing some of the concern people are having.\nNo you don't need to download 38GB from Steam, you will be forced to if you activate directly in Steam but this can be easily avoided by using the included discs to install, just follow the Wizard.\nAnother comment I saw was invalid key errors while validating to install, keep in mind there are 3 codes in the package. The \"Steam Activation Key\" is hidden behind the discs and is not easy to find, bizarre packaging flaw. The other two codes will be a SquareEnix registration code - just spam and a DLC code for some \"Car Pack\" or something like that, depending on when you actually buy it, the codes work just fine, none of the Arkham Knight mess here.\nJust so you know, you will need to download like 2GB from Steam after the Steam CD install, that's about it.\n1 Comment\n|\n3 people found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nGreat in ps4\nBySakthi Eswaron 20 February 2016\nHardware Platform: PS4\nI'm a ps4 user i know ps4 is good in graphics i have purchased this game from a local store working well on my ps4 great graphics but installation take 40 minutes ..\nComment\n|\n3 people found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"3.0 out of 5 stars\nAhem...\nByCapt. Obliviouson 11 December 2016\nHardware Platform: Xbox One\n|\nVerified Purchase\nIt's a fun game, the open world is fun to play. The game gets repetitive after a while and the story could have progressed a little faster.\nAll in all, it's a decent but forgettable game.\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"1.0 out of 5 stars\nDon't buy, defective game product. Neither seller supports nor SquareEnix (game supporter). Won't find your problem soltn at all\nByWolverineon 12 March 2016\nHardware Platform: Pc\n|\nVerified Purchase\nMy system requirements & recommendations are perfectly matching with this game. Still I installed game as per instructed step by step. Still game doesn't start, I contacted SquareEnix, they told me to change resolution, I started game with all resolution still nothing happens. My problem is that when I start game via steam game doesn't run at all (only it shows in task manager), & shows me Error: \"dumping info thread\" with all resolutions\n1 Comment\n|\n14 people found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nFive Stars\nByAmazon Customeron 17 August 2016\nHardware Platform: PS4\n|\nVerified Purchase\nMust have\nComment\n|\n2 people found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nHuge world + Immersing Graphics\nBySunitt Brahmaon 16 October 2016\nHardware Platform: Pc\n|\nVerified Purchase\nThe world's very huge ....The graphics is top notch. But my one complaint is that the camera angles/flexibility and blur gives a little daze after playing for too long.\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"4.0 out of 5 stars\nFour Stars\nByAmazon Customeron 19 December 2015\nHardware Platform: Xbox One\ngreat game but some loading issues\nComment\n|\nOne person found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nThe game is really good..\nByEric Singhon 18 January 2016\nHardware Platform: PS4\n|\nVerified Purchase\nThe game is really good... Just love the game... Great graphics... But the story is kind of short when u just do the story and not do other stuff\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"3.0 out of 5 stars\nAverage Game\nByPiyush Saxenaon 6 March 2017\nHardware Platform: PS4\n|\nVerified Purchase\nnot that good, you will play this game only once. once you have completed the game you will not feel like to play it again.\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nBEST JC SERIES GAME\nByMakarandon 12 August 2016\nHardware Platform: PS4\n|\nVerified Purchase\nTOOOO GOOD..\ngraphics are awsome. explosions and tether are fun. huge map. best game ever.\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nFive Stars\nByPrithvion 13 March 2016\nHardware Platform: PS4\n|\nVerified Purchase\nWorth buying ! 9\\10\nComment\n|\nOne person found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nBike, Car, Parachute or walking - full fun...\nByAnkithon 16 November 2016\nHardware Platform: PS4\n|\nVerified Purchase\nJust like the previous Just cause games with more fun... what else do you want...\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nFive Stars\nBymohiton 22 August 2016\nHardware Platform: PS4\n|\nVerified Purchase\nIts a huge game. Dont know when it will get finish but graphics looks amazing\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nFive Stars\nByrameshon 1 August 2016\nHardware Platform: PS4\n|\nVerified Purchase\nBig Bang boom.\nComment\n|\nOne person found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nFive Stars\nByAmazon Customeron 14 August 2016\nHardware Platform: PS4\n|\nVerified Purchase\nbest sandbox game tones of gameplay almost infinite style of playing\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nFive Stars\nByAbhijiton 7 June 2016\nHardware Platform: Xbox One\nawesome game.....but have some issue like fps drop sametime ......\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nFive Stars\nBySamrath 9216997777on 4 August 2016\nHardware Platform: PS4\n|\nVerified Purchase\nNice game worth of mony gamers should buy this game it's cool\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nFive Stars\nByAmazon Customeron 7 December 2015\nHardware Platform: PS4\n|\nVerified Purchase\nIt is a great game👍🏽👍🏽\nComment\n|\n3 people found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"4.0 out of 5 stars\nFour Stars\nByMadhavan parthasarathyon 18 July 2016\nHardware Platform: Xbox One\n|\nVerified Purchase\nIt works very well. My grandson is crazy about it.\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nFar Cry 4 meets GTA 5\nByBIG BOSSon 3 December 2015\nHardware Platform: PS4\nDidnt purchase it from Amazon but im here to write a review. This game is just excellent. If you people are thinking about changing from serious games like MGS V and Fallout 4 then go for this one. Im a huge Jc2 fan and this is no different. It got even bigger, better and badder. Just ignore the story, it might be weak for some as Just Cause is only meant for causing the destruction and mayhem throughout the game. This is the game where you can do anything your creativity. Having a huge blast playing this after weeks of serious gaming from MGS 5, Fallout 4 and The Witcher 3. Yes, like mentioned everywhere, all platforms suffer performance issues with Xbox One being the worst.... I've ps4 version and i can definitely say that this is completely playable albeit the load times can be abit longer ( which can be 2mins at the max) but still can be ignored and almost all the bugs are solved after updating the day one patch which stands at whooping 2.58gbs..Kudos to Avelanche for such an excellent game\nEDIT : Load times has been decreased ( as mentioned in the changelog) after recent update deployed by the developers\nComment\n|\n4 people found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nBest\nByVishal the bossson 28 July 2016\nHardware Platform: PS4\n|\nVerified Purchase\nSuper funny game, just cause'(in) chaos 3\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nFive Stars\nByAmazon Customeron 23 September 2016\nHardware Platform: PS4\n|\nVerified Purchase\nThe game and the service both were great\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"4.0 out of 5 stars\nFour Stars\nByAmazon Customeron 14 March 2017\nHardware Platform: PS4\n|\nVerified Purchase\nExcellent graphics and visual effect....\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"1.0 out of 5 stars\nPoor one!\nByHarshwinder S.on 10 February 2016\nHardware Platform: PS4\nThis game is fine but can never be equal to gta 5.. idk how people are saying its better then gta 5 just bcos of big maps as theres nothing good in this map and no good graphics of vehicles too.. completely disappointed for my money wasted over this! Should be of 1500 only as it deserves only that much amount!\nComment\n|\n2 people found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nFive Stars\nByshivang jingaron 15 February 2016\nHardware Platform: PS4\nAwesooooommmnesssss starts here\n1 Comment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nGood game\nByAmazon Customeron 4 April 2017\nHardware Platform: Xbox One\n|\nVerified Purchase\nVery good game\nShould buy\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nOne among the best!!\nBygowthamon 4 December 2015\nHardware Platform: Pc\n|\nVerified Purchase\nIf you are looking for an alternative to far cry,this one is the best one to go for! love the detailing of the explosions and the environment! is one among my favs after cod bo3.the huge map and the gameplay is too good!\nComment\n|\n2 people found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nFive Stars\nByAmazon Customeron 23 February 2017\nHardware Platform: PS4\n|\nVerified Purchase\nmassive open world game\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"4.0 out of 5 stars\nGood Game\nBySachin Sikkaon 6 December 2016\nHardware Platform: PS4\n|\nVerified Purchase\nA good fast moving game\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nGreat graphics and BGM!\nByDhruvBabaon 30 November 2016\nHardware Platform: PS4\n|\nVerified Purchase\nGameplay is also good.\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nFive Stars\nByANNAMon 17 January 2017\nHardware Platform: PS4\n|\nVerified Purchase\nbeast of action gaming\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nFive Stars\nByAmazon Customeron 21 June 2016\nHardware Platform: PS4\n|\nVerified Purchase\nGood my kids loved it\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
}
]
}