
{
"keywords":[
"1",
"2",
"3",
"4",
"5",
"6",
"7",
"8",
"9",
"10"
],
"reviews":[
{
"review":"5.0 out of 5 stars\nMax Payne 3 is awesome in its unique way.\nByVignesh Jayaramon 25 July 2016\nHardware Platform: Xbox 360\n|\nVerified Purchase\nExcellent game with great graphics.\nAwesome slow motion captures.\nThe best version of Max Payne so far.\nGo ahead and buy from Amazon without second thoughts.\nThe seller dispatched the item and made sure that the delivery of the product was on time.\nComment\n|\n3 people found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nAwesome game\nByNandanon 26 May 2016\nHardware Platform: Pc\n|\nVerified Purchase\nRockstar has raised the bar of max payne series by this game the game has awesome story Installation is easy but you cannot activate the game without downloading the patches which are around 1 gb then just create the account on rgsc and select remember me by which you can play offline and good delievery by Amazon package was in good condition\nComment\n|\n8 people found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nJust nice.....amazing\nByRavi GKon 12 October 2016\nHardware Platform: Xbox 360\n|\nVerified Purchase\nMax Payne's home has always been on the PC. The original 2001 game and its sequel debuted on the PC, and though they received console versions--some of which captured the excellence of their PC counterparts and some of which didn't--it was on PC that he first made his mark. Times have changed for Max, and his latest outing hit consoles first and PC second, which may raise concerns about whether, this time around, it's the PC version that feels secondary and the console versions that feel definitive. As it turns out, such concerns are unfounded. Max Payne 3 is just as gorgeous and intense on PC as it is on consoles, and the pinpoint precision offered by a mouse makes the PC version the best way to enjoy this brutal and haunting shooter.\nWherever you go, there you are. It's a truth Max Payne knows better than anyone. Fleeing his New York life to take a job working security for a wealthy family in Sao Paulo, the hard-drinkin', pill-poppin' Max finds that his demons come along for the ride. Though the details of the plot add up to your typical story of conspiracy and corruption, of the rich and powerful preying on the poor and helpless to become even more rich and powerful, the writing, acting, and presentation elevate this tale well above a boilerplate video game crime story.\nIt's hard to stay ambivalent once you see the horrors being suffered by the innocent here, and you'll likely want to see Max's quest for vengeance through to its conclusion just as badly as he does. Max reveals a complexity here not seen in earlier games, as he hits rock bottom and must either stay there or face his demons head-on and make himself anew. Other characters, too, reveal a surprising humanity. You might be tempted to write off Marcelo, the youngest brother in the wealthy Branco dynasty Max is hired to protect, as the shallow playboy he often appears to be. But in moments of disarming honesty, he reveals to Max a depth that lies beneath the facade he presents to the world.\nCutscenes use multiple moving panels to pay homage to the graphic-novel-style storytelling of previous games without feeling beholden to it, and the considered use of blurring and other visual effects echo Max's state of mind, perhaps making you feel as if you're the one who has been hitting the bottle a little too hard. James McCaffrey does an excellent job reprising his role as Max, bringing a wider range of emotions to a character who has previously often been one-note. The writing is terrific; Max's world-weary wit is as bone-dry as ever, and as he ruminates on things like loyalty and loss, much of what he says has the sound of hard-earned wisdom. Subtle touches throughout the game make Max seem convincingly alive, such as the complex look that crosses over his face at the start of one stage when bloodshed seems inevitable; it's as if he dreads what's coming, but does his best to mentally prepare himself for it.\nComment\n|\nOne person found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"3.0 out of 5 stars\n2nd disk was currupt, install on day 1 to verify disks.\nBySubir S.on 29 November 2016\nHardware Platform: Xbox 360\n|\nVerified Purchase\nThe second disk was currupt. I found out after the expery of the return policy. Same reason I didnot reach out to anyone.\nGive 3 star because I would like to give benifit of doubt to seller.\nMy learning is to install the game on day 1 and avoid such problem.\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nMax Payne... Hell yeah!!\nByAmazon Customeron 23 November 2016\nHardware Platform: Pc\n|\nVerified Purchase\nEverything about this game is awesome... Be it gameplay or graphics. Story is also good.\nHaven't tried the multiplayer mode yet... The story itself is so gripping that it will make u play for hours\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nITS ROCKSTAR!\nBySatyam M.on 11 August 2016\nHardware Platform: Pc\n|\nVerified Purchase\nas always its a rockstar game and u know what i m talking about its awesome and runs even at low settings, require an update of 1 GB to play the game, awesome storyline awesome graphics and hey its rockstar.\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nGreat game, but an even greater multiplayer mode\nBySanket Mhatreon 5 October 2015\nHardware Platform: Playstation 3\n|\nVerified Purchase\nGreat game, but an even greater multiplayer mode...superbly addictive. However the PS3 disc provided by Amazon is the Asia Version and addon multiplayer maps when downloaded aren't compatible with it, those require an European version of the game.\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nAwesome Game - good price\nByVadid Valiullaon 2 September 2015\nHardware Platform: Pc\n|\nVerified Purchase\nA great game and an awesome price by the seller... Got it for Rs499 which is the actual price of the product... The game is awesome as expected... Must play for people who have experienced Max Payne 2...\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nLoving it\nBySuman Barickon 24 September 2016\nHardware Platform: Xbox 360\n|\nVerified Purchase\nBought it for my XBOX 360 Xbox 360 4GB Console (also bought from Amazon)...\nThis game gives the same experience and pleasure as earlier 2 Max Payne titles, only with better graphics, greater gameplay.\nAnd yes if you are worried about the bald look, among the 2 DVD story, Max does have hair all the time in DVD 1 just like old time... only at the end of DVD 1 story, he shaves it :)\nDoes not matter if you are a Max Payne fan or not, just buy it now when it is only Rs 350, if you don't want to regret later :)\nComment\n|\nOne person found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"3.0 out of 5 stars\nSTOP & START, wait for a.sequence , STOP AND START all over again...\nByAmazon Customeron 21 September 2016\nHardware Platform: Xbox 360\n|\nVerified Purchase\nwith times changing and adapting itself comes new designs implementations. developed by rockstar and not remedy , gone are days of noir styling winter settings of new york , this is the new payne who seems to booze regularly for his actions in the past for being a killer in his backstory and yet jumps from cover to cover in a john woo style with bullet time slowmo effects ripping through so many dudes even arnold in commando would be ashamed. gunplay and gameplay is polished and extremely well designed , however my biggest critism is that the developers want to rather show.me the cutscenes.and scripted sequences rather than making me.play for more than minutes every freaking time . this diminshes the goodwill and replayability for the game as the game is very tight and concise. the new setting for brazil is an interesting take on for a modern payne.saga and sound design is well presented. did you know this game is inspired from denzel washington's movie MAN ON FIRE. recommended only for fans looking to rip through painkiller addled bullet time shlowmoe action with expectation for a stop and go start in terms of gameplay and story loops.\nComment\n|\nOne person found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"4.0 out of 5 stars\nGood job, Rockstar!\nByAmazon Customeron 5 October 2016\nHardware Platform: Xbox 360\n|\nVerified Purchase\nMax Payne series is one of the best series that Rockstar games publishes. Well, I had great expectations of how the game play would turn out. Even with improved graphics, controls it was disappointing. The first 15 minutes unskippable cut scene, Unwanted movements, ridiculous health of the protagonist took the spark away. For a easy game play even in harder difficulty, simply enable the auto-aiming and you are done! Press and Hold LT then fire with RT and release both of the triggers. Repeat this as wanted. Story is somewhat interesting though. Hence my 4 stars out of 5 stars!\nComment\n|\nOne person found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"3.0 out of 5 stars\nexcellent game marred due to sellers negligence\nByVikas Kumaron 3 November 2015\nHardware Platform: Xbox 360\n|\nVerified Purchase\nEven though I loved the game, the fact that seller sent me max payne game case with broken seal and game booklet missing hampered my overall gaming experience\nComment\n|\nOne person found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nWorth every Penny\nByParamon 1 July 2015\nHardware Platform: Playstation 3\nA game totally worth buying. Hours of fun for the price that's totally worth it. The slow motion game play is awesome. The storyline is good. The use of different weapons and the changes in environment never let the game get boring.\nComment\n|\n2 people found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"2.0 out of 5 stars\nMax Payne Disc 2 Sucks\nByAmazon Customeron 1 December 2016\nHardware Platform: Xbox 360\n|\nVerified Purchase\nAfter finishing my Disc 1 Gameplay.I Inserted Disc 2 which is not working at all.Really waste of money...\nComment\n|\nOne person found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nAwesome game!!!\nByRockyon 11 December 2014\nHardware Platform: Pc\n|\nVerified Purchase\nGot it very fast. Game is excellent but i had to download 5 patches. With my 56KB/s downloading speed it takes more than 2 hours but anyway game is excellent, both single-player and multiplayer. Must go for it!!!\nComment\n|\n2 people found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nit really made me feel what it's like to be in that situation\nByAmazon Customeron 8 March 2016\nHardware Platform: Pc\n|\nVerified Purchase\nI haven't played any games from the Max Payne series, till now. When I played M3, it really made me feel what it's like to be in that situation.By progressing through it I felt the taste of M1 as well as M2, all alongx, provided, M3's story was going on simultaneously.Truly a game not to be missed...\nComment\n|\n4 people found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"1.0 out of 5 stars\nAbout a week has passed since i received it. ...\nByabhishek aggarwalon 29 October 2015\nHardware Platform: Pc\n|\nVerified Purchase\nAbout a week has passed since i received it. Installed 5-6 times in two different computers.\nImmediately after installation, auto updater starts and after about an hour everything stops and vanishes.\nGame should be installed automatically, but it doesn't work at all.\nComment\n|\n4 people found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nit's a very good game so far with superb\nByN.v.k.lohiton 10 May 2016\nHardware Platform: Xbox 360\n|\nVerified Purchase\nBought it a day ago, it's a very good game so far with superb cutscenes\nComment\n|\nOne person found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\ngreat game must buy for ps3 owners\nByDEVon 13 May 2016\nHardware Platform: Playstation 3\n|\nVerified Purchase\nI have tried to play max payne 2 on ps2 but for me graphics were not great or playable ,after listening so much about this one and reviews i knew it would be much better at ps3 ,got the game and its rocking great .story is great u feel his emotions and struggle to save his clients only few games have such binding story which u makes feel real and emotional whoile playing ,not like call of duty etc just senseless shooting .\ngraphics are great and i m quite fussy about it it has to be relly good if i would term it good but graphocs are really good gameplay is very smooth ,cut scenes and story are spell binding .\nits bullet slow down feature makes u see flying bullets and kill enemy faster,\nbut AI is not to mess with set it on high difficulty and it will torturing u ,well i mostly play normal dificulty because i m not here to compete or boast my skills for nothing but i love to enjoy game be with protagonist and enjoy playing game not stomping game controller which u need if u directly hit hihger difficulty\nanyways great game must buy for any ps 3 owner who is thing for third person shooter ,i wonder why is it called third person because logically third person is 2nd person technically comparing with first person shooter .\nwell kudos order and get started on adventure with mr max payne\nComment\n|\n3 people found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nBest Game In The Series!!!!!!\nByAmazon Customeron 23 September 2016\nHardware Platform: Pc\nThis game is the best in all the third person shooter that I have played till now...installation is quite simple and it installs some patch through internet from rockstar server after that you can play the game in offline mode.. There are about 6 patches (24-30)mb each.\nGameplay is awesome\nStory 10/10\nGraphics 10/10\nCombat 10/10\nThere is a lot of improvement from the previous parts shooting,combat,graphics all of them are now on a different level...\nEnemies are tougher than before...\nLast chapter is my favourite...\nIt is a must buy product...!!!!!!!!\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"3.0 out of 5 stars\ncan't play\nByAmiton 12 September 2016\nHardware Platform: Pc\nwhen i open this game i see it's say screen resolution is 1366×786 60ghz needed.then i change my screen resolution i see again this problam...help me what i can do for fix it!\nComment\n|\n3 people found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nRock* Rocks\nBySatyamon 19 July 2016\nHardware Platform: Xbox 360\n|\nVerified Purchase\nEarlier I have no interest in Shooting Games and I always wondered why people are amazed with such kind of games, but trust me this game has changed that opinion for me. Amazing Game from Rockstar.\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nAwesome fps game!!!!!!!max payne 3\nByManojit Paulon 6 March 2015\nHardware Platform: Pc\n|\nVerified Purchase\nGame is great with an excellent story line.It works on windows 8.1 very smoothly after downloading a patch of about 1.5 gb.if you like fps games then dont think just go buy it.\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\ngood\nBysudheeron 16 May 2014\nHardware Platform: Pc\n|\nVerified Purchase\nvery good experience i really like to play this game game is very good thanks for amazon for giving good cost thanks fr rock star its good game every one must like this game\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nVery good\nByA. Jainon 4 April 2014\nHardware Platform: Pc\n|\nVerified Purchase\nApart from the Rockstar DRM, this game is very good. A nice story and a bit different from the usual FPS genre. Has a good story, a good continuation to Max payne 1 and 2\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\namazing game\nBykaran s.on 5 November 2016\nHardware Platform: Xbox 360\n|\nVerified Purchase\nits not a game its a movie .... really i have never played this type of game ever,,,,,, rockstar has made a great game compare to previous max payne parts ,,,,,, love it\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nMax Payne at it's best\nByWondermanon 27 March 2015\nHardware Platform: Playstation 3\n|\nVerified Purchase\nOne of the best games / story line.. wish I had got this earlier.. gameplay similar to other max payne games.. however very nice and intriguing storyline and execution\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nYou need pain then I'll give you PAYNE !!!!\nByAby Christy Philipon 12 November 2014\nHardware Platform: Pc\n|\nVerified Purchase\nAn awesome game for the series definitely worth playing more than once. I bought this a month back and just recently finished playing this, even though this game was big I still wanted more.\nSo installation requires 30GB which took me almost 20 mins I think.\nSecondly this is not steam activated but you still get achievements from Rockstar Social Club\nThirdly there is an update for this game which I think was huge (maybe close to 1GB) and it is recommended you do the update or else the game will crash on multiple areas, hence do the update.\nFourthly multiplayer won't work because everybody is on GTA5 so don't bother trying.\nAnd finally stop reading this and if you haven't bought it then buy it and KICK A$$ !!!!!!!!!!!!!\nComment\n|\n6 people found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nNice without any problem I installed the game in Windows ...\nByS.JassalTOP 1000 REVIEWERon 15 September 2016\nHardware Platform: Pc\n|\nVerified Purchase\nNice without any problem I installed the game in Windows 7 I3... nice and quiet thanks agen Amazon excellent work.....!!\nComment\n|\n3 people found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nRuns smoothly......\nByTushar chauhanon 11 October 2016\nHardware Platform: Pc\n|\nVerified Purchase\nThis is the first game I have got with no problems started at first click without applying any fixs and cracks and game is also awesome you will love it........\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"1.0 out of 5 stars\nDAMAGED DISC\nByrdbon 22 July 2016\nHardware Platform: Pc\n|\nVerified Purchase\nPlease do NOT buy the game from Amazon. The disc is not readable. I am also not able to download this game online as the product key which I got doesn't work.\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"3.0 out of 5 stars\nVisually game is beautiful especially slow-mo shots\nByAmazon Customeron 13 August 2016\nHardware Platform: Xbox 360\n|\nVerified Purchase\nGame's story-line is not as appealing as its predecessor.\nVisually game is beautiful especially slow-mo shots.\nSTORY - 3/5\nVisual Appeal - 4/5\nGame-play - 3.5/5\nOverall Rating -3/5\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nGreat game..but doesn't feel like Max Payne.\nByGabrielon 19 June 2014\nHardware Platform: Pc\n|\nVerified Purchase\nIt's good to be back in the shoes of Payne. The character is exactly as I remember but the game is not. It's not gloomy enough. The tragedy is not enough to make Max what he was in Max Payne 1 and 2.\nRegardless the games is awesome with some kickass action sequences and also bullet time. Must play game. Totally had fun while playing it.\nComment\n|\nOne person found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nAMAZING SERVICE AND PRODUCT...:-);-)\nByaksheshon 13 December 2014\nHardware Platform: Playstation 3\n|\nVerified Purchase\nWooow amazon.in you rock man just got product with in 2 days amazing service and product just love it and very amazing game thank u amazon love it...:-D\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"4.0 out of 5 stars\nIts a great game but the dvd I got has white patches\nByJeezon 4 March 2015\nHardware Platform: Xbox 360\n|\nVerified Purchase\nIts a great game but the dvd I got has white patches. I returned and reordered the game again to find that even that has similar white patches on dvd-1\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nBest game\nByAmazon Customeron 16 June 2016\nHardware Platform: Xbox 360\n|\nVerified Purchase\nA very great game and It matches my expectations. The amazon.in makes it very easier to me to buy as it was not available in any leading store nearby\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"4.0 out of 5 stars\nGoooood and awsme game with fantstc stry Worth 5 stars ...\nByswaraj son 23 December 2014\nHardware Platform: Pc\n|\nVerified Purchase\nGoooood and awsme game with fantstc stry\nWorth 5 stars.Only 4 stars bcoz of delay in delivery i got it after 10 days after ive made this order\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"3.0 out of 5 stars\nexcellant game..\nByPrakashon 19 June 2014\nHardware Platform: Pc\n|\nVerified Purchase\nnice game but it needs online to enter the game..\nJust finished playing MP3 & am a little bit miffed in some chapters.\noverall good game..\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"4.0 out of 5 stars\nthanks\nBymuthu kumaron 17 May 2014\nHardware Platform: Pc\n|\nVerified Purchase\nThanks. It is within the cost expected and time saving process of procuring throu amazon. It is working well\ns.muthu kumar\nBangalore\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nAwesome.. Must Play Game\nByAmit Sharmaon 9 September 2014\nHardware Platform: Playstation 3\n|\nVerified Purchase\nAwesome.. Must Play Game\nHard with free Aim is best Play option to enjoy the hardcore action.\nGreat Delivery by Amazon... :) :)\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nYeah it's good\nByOmkar game play videoson 11 October 2016\nHardware Platform: Pc\n|\nVerified Purchase\nFully awesome game. Just download some patches up to 25 to 80 mb, s only . Story is great and multiplayer too, kind of graphics like gta 5.\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nMust Buy!\nByYash Goenkaon 17 January 2015\nHardware Platform: Playstation 3\n|\nVerified Purchase\nAmazing game! Though its years old now, its still very relevant and the graphics and gameplay are simply amazing even by today's standards. Got this game NEW on Amazon for around Rs. 450 which is simpl spanking deal!\nComment\n|\nOne person found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"4.0 out of 5 stars\nA good game at a very good price\nByNitesh Sharmaon 25 December 2016\nHardware Platform: Xbox 360\n|\nVerified Purchase\nA good game at a very good price .. only hate the past time mission in the game.. thats why 4 stars other wise awesome action movie game\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"2.0 out of 5 stars\nI dont know how does it work it always show ...\nByAmazon Customeron 23 March 2016\nHardware Platform: Pc\nI dont know how does it work it always show upon the 1st boot of dvd rom that data2.cab error-the device is not ready.how it can resolve\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"4.0 out of 5 stars\nOverall good game\nByAKHIL_gpon 13 October 2015\nHardware Platform: Pc\n|\nVerified Purchase\nOverall good game, well optimized perfomance and nice graphics, a lousy story line but interesting gameplay good deal for 400 bucks!\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"4.0 out of 5 stars\nOne of the best by Rockstar games\nByAmazon Customeron 13 December 2016\nHardware Platform: Xbox 360\n|\nVerified Purchase\nOne of the best by Rockstar games . Good thing the continued the story line . A great combination of a RPG and a action pack game\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nActivation Problem, Don't Buy It\nByHarry (Writer India)on 22 April 2014\nHardware Platform: Pc\n|\nVerified Purchase\nActivation Problem, Don't Buy It, Social Club Account problem, Compulsory of net access many time to download 2 gb updates etc.\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nVery good\nByAnkush Srivastavaon 20 April 2015\nHardware Platform: Playstation 3\n|\nVerified Purchase\nMax Payne 3 is the best game of its series. A totally different game than the rest of the two of its series. Very good game.\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nMax Payne 3\nBystephenon 9 October 2015\nHardware Platform: Pc\n|\nVerified Purchase\nThe game is awesome and your delivery was very swift.Gameplay is top class enjoying every second I play.Max payne 3 rocks!!!\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nOriginal xbox 360 dvd\nBypradeepraoon 10 June 2016\nHardware Platform: Xbox 360\n|\nVerified Purchase\nThank you Amazon and seller .\nI happy with Game nice Buy from seller at low cost.\nBring more games at low cost.\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
}
]
}
