
{
"keywords":[
"1",
"2",
"3",
"4",
"5",
"6",
"7",
"8",
"9",
"10"
],
"reviews":[
{
"review":"5.0 out of 5 stars\nI love this game so muchhhhhhh\nByritvik narangon 1 November 2016\nHardware Platform: Pc\n|\nVerified Purchase\nWhat an amazing game. Hideo kojima is the king of stealth games.This game is almost perfect but the main issue is the story.Its lacking and not up to the previous titles. Nevertheless the rest of the game is freakin PERFECT.Just get it. Even if you don't like stealth games. There is something to do for everyone in this huge open world.Sadly it's the last good mgs game because stupid Konami fired hideo kojima and without him there's no metal gear.Thankingfully hideo kojima has started his own company and a new title is coming out next year named Death Stranding.Im totally oftopic, just get this game.\nComment\n|\n4 people found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nThe Future of games\nByImthiyazon 1 January 2016\nHardware Platform: Playstation 4\n|\nVerified Purchase\nFirst of excellent delivery speed and quality (good job amazon) and secondly no u dont need to download anything for playing the game on A console.\nAs for the game, konami is going to cry rivers for letting kojima go. The game is best described in one word.\nEpic.\nThe gameplay style and the multiple ways of achieving your goals is amazing. And the ooen world of Kabul and the Angola Zaire Border Region are juet breathtaking.\nMy best buy of december 2015\nComment\n|\n6 people found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nAmazing game!! amazing graphics!!!! Salute \"hideo kojima\"\nByPro Pranavon 31 August 2016\nHardware Platform: Playstation 4\n|\nVerified Purchase\nThe game is absolutely amazing , the graphics are way up on the top. I'm very new to this series of metal gear solid. Bought this game it was rated 10/10 by Amazon, so thought of trying it out. Can't say much about the story coz started playing it yesterday but the graphics are Amazon on ps4, the nature/environment in the game looks very real .\nAbout Amazon service:-\nNo doubt Amazon's the best on this globe. Chose one day delivery , recieved it within 24 hours. Amazon always lives up my expectations.\nComment\n|\n3 people found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nA solid game\nByH.Drizzleon 2 February 2017\nHardware Platform: Pc\n|\nVerified Purchase\nI've never played any of the previous Metal Gear games from the series. I picked this up not expecting much out of the gameplay, but I was wrong. It turned out to be one of the best action/stealth games of this generation. The gameplay unarguably the best thing about this game. The story was weird, to put it mildly, it never explained the inner workings and happenigns of the game world through cutscenes or dialogue, instead choosing to let you decide if you want to know more or less by putting the story in \"cassette tapes\" for you to collect and listen to. Even then the story doesn't have an actual conclusion. It just abruptly ends. However that did nothing to stop me from enjoying the 300 or so hours I put into this game and how much I loved all the characters (Quiet and DD for life!).\nNOTE: A little reading up on previous games will be required to fully understand this one and where it fits chronologically in the Metal Gear series. A solid game otherwise, no pun intended.\nComment\n|\nOne person found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nRuns incredibly well even on old PC configurations ! (SPOILERS)\nByK10TOP 1000 REVIEWERon 28 November 2015\nHardware Platform: Pc\n|\nVerified Purchase\nI'm playing at low settings on my laptop having config :-\na) Core i3-330M 2.13Ghz\nb) 4 GB RAM\nc) ATI Radeon HD 5450 1 GB with 675 MHz clock speed\nPros:\n1. Highly optimised game engine (FOX engine) & almost bug free. Works flawlessly even on old PC configurations having graphics card or apu.\n2. Highly replayable as game's AI adapts to counter your playing style.\n3. Photo-realistic world particularly with lighting & characters even on low grahics settings.\n4. You can go sneaky as James Bond or blast in as Rambo. You're not forced to follow a playstyle except during boss battles.\n5. Incredible innovative gameplay unlike any other shooter games + one can tackle missions in multiple & also funny ways.\n6. Character animations with lip sync & cutscenes are far superior than in Witcher 3.\nCons:\n1. World is empty & smaller than Witcher 3 or Just Cause 3. It's nowhere as artistic & rich as Witcher 3.\n2. Missions are mostly infiltration based. Can get you bored if you play too long.\n3. Main story is short with hardly no stories for side missions. Witcher 3 has epic stories in almost every mission.\n4. Mother Base has virtually no purpose except for Forward Online Base events.\n5. Sometimes the player can't even climb over small rocks & ledges which is ridiculous but frustrating when you're running away from attacks.\n6. D-Horse is not easy to manoeuvre & Quiet can only be used at certain points on the map.\nConclusion:\nIf you love shooting, don't bother about stories, have an old PC or a fan of stealth games, then folks ! this is it....\nN.B. :\n1. The disc comes only with 8 MB Steam online client installer. Game + full Steam client needs to be downloaded.\n2. Download size - a) game = 20.5 GB, b) Steam client = 300+ MB & c) game updates = 2 GB (depends with new updates).\n3. Steam updates itself automatically. Before downloading the game completely don't ever restart Steam if it asks to apply new client update. Else Steam will not recognise your incomplete download & starts from beginning by overwriting the files.\n4. Download your game in the default folder chosen by Steam client else you will have problems updating & backing up your game.\n5. Launch the game once while online to complete your activation. After that go to Steam>Go Offline. Now you can play the game offline.\n6. Create a copy of your game by going to Steam>Backup and Restore Games. Choose your game, destination folder which should not be in your OS partition, file size(CD/DVD but DVD preferably. If you're an advanced user you can try custom) & follow the instructions. Now you wouldn't require to download your game again. Or copy entire 'steamapps' folder if you want to retain all game updates offline.\n7. Game can be reinstalled by going to Steam>Backup and Restore Games. Follow the instructions. Or copy/ replace entire 'steamapps' folder back into Steam folder with your copied 'steamapps'.\n8. There is also a way to create offline Steam client installer. Refer the net.\nComment\n|\n20 people found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nIts Hitman in free roam with lot of cars and CHAOS\nByImmanuon 14 July 2016\nHardware Platform: Playstation 3\n|\nVerified Purchase\nThe game is amazing and its tactial espionage perfection our choices depend our victory or loss. To send a gunship or a sniper to out enemies or making a choice in a moment of crises is upto you and motherbase has a whole lot of upgrading the land sometimes feels empty and prolonged helicopter rides cannot be skipped yet the fun of inflitration or destruction is your choice entirely and the seasonal changes on the game help us or hinder us to subjugate the base such as sandstorms over all a 9.8 on 10 best Mgs\nComment\n|\n2 people found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"4.0 out of 5 stars\nWorth it if you have the network capability to download the data.\nByThe Lone Nihiliston 1 September 2015\nHardware Platform: Pc\n|\nVerified Purchase\nJust a heads up. The disc only contains an 8MB Steam installer. As per tradition (as that is what it seems to be with modern Steamworks games) you'll have to download all of the game data from Steam itself which amounts to a staggering 28GB. My review is for the game itself as I already have the game on Steam. If you can afford to download the game then it definitely is a must buy. It's Metal Gear. What more can I say.\nComment\n|\n15 people found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nthe best of the franchise gameplay wise\nBySharanon 7 September 2015\nHardware Platform: Playstation 4\nMGSV is, hands down, the best of the franchise gameplay wise, and a contender for best game all around as well.\nTPP takes a departure from previous titles (bar Peace Walker) in the sense that is no longer a linear, cutscene-plagued game. Cutscenes are less prominent than in previous games (except for the prologue, but it's expected for the introduction to ANY game to have plenty of cutscenes anyway), and missions are split. This means, no longer games where a single score was given to the whole playthrough. Each mission has it's individual score, and they can be redone if you're not sastified with the result, albeit with a reward reduction (half the GMP [money] reward).\nMain missions have the mandatory objectives to fulfill, and then hidden ones which are optional to complete but add up (either by score, or with personeel/gear). The game grants you total freedom on how to complete them. If the mission says \"Eliminate x target\", you can fulton him and it'll be fine (as a matter of fact, fultoning is preferrable to killing, as the targets are, more often than not, proficient at their job).\nThen you have side ops. These are missions which don't need to be completed to advance through the storyline, but whose rewards are so great that, in some cases, it's basically impossible to progress without doing them. Also, there are some side ops (tagged in yellow) which are still a must do anyway. Side ops are, imo, way more enjoyable than the main missions, since you have no scoring whatsoever for them, and you can do them the way you want without being punished.\nIn terms of freedom, MGSV is a game which, albeit rewarding stealth over action, still allows you go guns blazing and get an S score anyway (happened to me so many times). You can also just explore the vast Afghan world (not to spoil anything, there's more to explore than just Afghanistan), and take on outposts and main bases for new recruits, diamonds (GMP source), vehicles, and resources to build up your motherbase. Random events (sandstorms, rains, etc) will make it easier to infiltrate, but also harder to spot the enemy if you haven't done that beforehand (you can scout enemy positions with your binocs).\nThis game has more two unique features, when compared to previous titles; Motherbase, and buddies. While Motherbase isn't precisely a new one (already present in Peace Walker), here it's been reworked extensively. GMP is no longer obtained from recruits, but from sending them to Outer Ops, finding diamons, and doing Side Ops and Main Missions. It won't expand on it's own either; you need to order the construction of new facilities for it to expand, and such demands time, GMP, and resources. Unlike PW, you can also visit your MP, which is actually required because if you're away for too long, your soldiers will miss you and eventually fight amongst each other. While not mandatory to go back, some game events force you do it. You'll want to go anyway for allowing certain things to happen (there's a Main Mission which requires you to go back actually).\nThen, you have the buddy system. Basically, it's a companion which you can bring with you to combat. Only one is avaliable from start, with others being obtainable from certain events (if you don't do them, then you won't get them). They play a big role in helping you, so it's advisable to recruit all of them if possible.\nFor story telling, the game largely reduced the cutscenes and replaced the info delivery with cassette tapes (also getting rid of the CODEC this way). I find this to be a god sent as you can listen to the tapes when exploring the world or just wandering around your base, meaning that no time is lost.\nAll things considered (with my 30 hours worth of playing so far), this is my final score and pros-cons:\nPros:\nExcellent Gameplay.\nGreat Story (and it's delivery system. Not an overburden of cutscenes).\nUnparalleled customization capability for a MGS game.\nOpen world, non-linear experience, with results in basically being different for each player.\nMother base building (I love management, can be a con. Not too bothersome, just a two-minute browsing every now and then. You can do it while riding your chopper).\nCons:\nStaff morale mechanics (you have to go and see EVERY SINGLE SOLDIER to raise their morale. When your base gets big, there's no point in doing it. The penalty isn't that bad either way).\nShower isn't really needed to clean the blood. Just change your outfit and you're set. If the blood and it's cons were intended as a way to make you go back to MB, then it failed miserably.\nComment\n|\n8 people found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"4.0 out of 5 stars\nIronically satisfying and unsatisfying at same time.\nByabhishekon 25 November 2016\nHardware Platform: Playstation 4\n|\nVerified Purchase\nQuick Review\nEven though it is one of the best stealth shooter game out there, the story being incomplete and unsatisfying is the only sad thing about this installment. Apart from that, another masterful piece from Hideo Kojima.\nGame:-\nGameplay | 4.5/5\nStory | 2/5\nSound/Music | 3.5/5\nAmazon :-\n5/5 for delivery.\nComment\n|\nOne person found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"4.0 out of 5 stars\nGreat game!\nBykaranon 26 June 2016\nHardware Platform: Xbox One\nGot a day one edition game for just 1500₹. Thanks amazon! As for the video game, it is awesome. Definitely a must buy. The only reason I didn't give a 5-star is because the story is confusing and the gameplay does get a bit repetitive after a while. That being said the graphics are beautiful and the combat system is great. The controls take a while to get used to though. Definitely recommend this game to everyone who's into stealth action games!\nComment\n|\n2 people found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nGreat game!!! But....\nByAryaman J.on 14 October 2015\nHardware Platform: Pc\n|\nVerified Purchase\nThis game is just fantastic, it is a great improvement upon its predecessor, Ground Zeroes, but the only thing that I was led down with was the 20 GB download!!!! I know its mentioned in amazon's FAQ but still 20 GB's took some time to download.\nOne other thing that people should be aware of is the system requirements, while the game's optimization is great, if you want smooth gameplay on ultra settings you should at least have a GTX 750, i have a GTX 760 and play the game with ZERO lag.\nComment\n|\nOne person found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nPS4 - Best story game\nByBhargavon 10 July 2016\nHardware Platform: Playstation 4\nIt's very realistic. Story is good. Most important, it's total worth for money. I've played this game for over 40 hours and only finished 35% of the game. So many ways to play. See a review on ign. Its simply AWESOME.\nComment\n|\nOne person found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"3.0 out of 5 stars\nAwesome game but you can get this for cheaper on steam\nByAmazon Customeron 4 August 2016\nHardware Platform: Pc\n|\nVerified Purchase\nWell first of all this game will blow your mind the visuals are way beyond best even Witcher3 and Shadow of Mordor looks Lil bit like they are animated but this doesn't not even in 1080p I recently bought a 4k desktop and I'm really stunned with this game visuals they looks so damn real but the reason I'm giving 3 stars is because the package contains a steam key and a disk which doesn't include game data you have to download the whole game but that's not the issue the thing is you can get the game on steam for about 800rupees and Lil bit earlier on steam summer sale the game was available for only 524rupees\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nSuperb Stealth Game 👌👌👌\nByPrasanna Kumar Pon 21 September 2016\nHardware Platform: Playstation 4\n|\nVerified Purchase\nI bought this after going through several reviews in this page and some positive feedbacks from my friends, nothing goes wrong it's a very interesting game and a must buy for ppl who loves this type of games. Playing almost everyday from the day I received it, that much addicted 😊 Graphics and quality of the game is top notch, because I'm playing this in my projector and there are no complains about the resolution. Go for it 👍\nComment\n|\n4 people found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"4.0 out of 5 stars\nBrilliant!! More ever released by the Developers for ...\nByalke2007on 6 September 2015\nHardware Platform: Pc\n|\nVerified Purchase\nAs a Metal Gear Solid game, Brilliant!! More ever released by the Developers for PC, even better!!\nI bought this 'DVD' without reading the seller Q&A, and yes this package is just a DVD to install Steam (which you can download from steam.com), and the Serial Key..The DVD does NOT contain the game- You still need to download the actual Game (20.3 GB) via Steam onto your PC to play.. So essential I waited for about a 6 days delivery time just to have a physical printed copy of my 'Steam key' delivered to me in a DVD case so that I can use that to 'begin' downloading the game from Steam.. Would have given 5 stars to the Seller if they had facility of emailing the key to us, after the purchase is verified so that we can get on with our business right after!\nContents of the package-\n1) DVD (contain Steam setup and nothing else!)\n2) Printed Steam key (this is the sole content of the package that you made this purchase for)\n3) Advertisement pamphlet for some free on-line Piggyback guide to MGS 5\nWould have been nice, that considering we bought this physically and that it doesn't exactly contain the game, some value add material (brochure, booklet, OST CD, etc) could have been included\nComment\n|\n13 people found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nin long run that is a good thing. The game can be stored in external ...\nByJayanta Sahaon 27 October 2015\nHardware Platform: Pc\n|\nVerified Purchase\nThis is a game by Hideo Kojima and where Kojima is involved that project is surely worth checking.Metal Gear Solid V is no exception. Though one needs to download the whole game from Steam, in long run that is a good thing. The game can be stored in external drive for future use.As per gameplay matters ,it is very detailed and almost realistic. It contains dynamic day-night circle,dynamic weather simulation and also enemy AI is pretty good.Enemies will react to players' tactics and will force players to take different approach every time.\nThough it is a stealth game ,players can go loud any time except certain mission and it does not affect the ratings in game.However blowing things may lead to less resources.I will suggest to play it at once.\nP.S.:The story is not a strong suit of this game however presentation and gameplay will make up for that.\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nMotherbase of all action games!\nByVypeRon 2 October 2015\nHardware Platform: Playstation 4\n|\nVerified Purchase\nThis game doesnt need any reviews. Most - or I should say - all professional reviewers have given this 'ten on ten', and thats for a reason. This is, by far, the best Action Game, ever.\nIt is a tactical espionage stealth game, but you can play this open world game, as openly and as u want, as possible. Approach \"a\" base in russian-military-occupied afghanistan at any time in24 hours, from any direction, at any pace, all guns blazing, or, calmly with tranq guns, doesnt matter, all that matters is the end result of that particular mission. How you do it, is up to the \"player\". The game does have a huge learning curve for those coming to the series for the first time, but those who have played any MGS before, especially Ground Zeroes will feel right at home.\nThis is the best MGS ever.\nEnjoy playing it\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nBest game i have played\nByAmazon Customeron 5 October 2016\nHardware Platform: Playstation 4\n|\nVerified Purchase\nI have played almost all the latest games uncharted 4, witcher 3, GTA 5 etc etc. This game is the best it has 50 main missions and 157 side missions and infinite possibilities to complete them. This game is for the intelligent gamer. No other game comes close to this. This one and witcher 3 are your best bets if you want to buy a open world game. Hideo kojima is a rock star and he proves it again.\nComment\n|\n4 people found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nTerrific packing and delivery by Amazon\nBy46to93on 7 September 2016\nHardware Platform: Playstation 4\n|\nVerified Purchase\nFirst, Terrific packing and delivery by Amazon. Ordered through Amazon Prime and damn it was spot on.\nComing to the game, I'm a solid Metal gear fan. Love this one a lot. Lot's of people complain about the story, but I feel that the game makes up for it in the gameplay. And the world, OMG! it's so huge and fun.\nWill update once I finish the game\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nJust buy it!!!\nByvarunon 1 December 2015\nHardware Platform: Playstation 4\n|\nVerified Purchase\nSome just meant to be bought. Pros:\n1. Storyline is good\n2. Building your own special kind of base and recruiting people never gets old.\n3. Difficult at first but instead of annoying you want to get better.\n4. Free roam is fun not like other open world games.\n5. Graphics are great and feels like they put a lot of effort to make it more immersing for the players.\nCons:\n1. Some missions are repeated and have highly increased difficulty are pain in the as*\n2. Ending is sloppy and rushed considering the story until the end was good.\n3. No badass antagonist.\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nYet another brilliant game by Hideo Kojima\nByAnjayon 17 November 2015\nHardware Platform: Pc\n|\nVerified Purchase\nYet another brilliant game by Hideo Kojima and his team. This games takes the open-world sandbox style gameplay that most games today have, there is tons of things to do and explore. The game offers great replay value, I've played around 36 hours and still at around 25% completion. My only complaint is with the re-use of the maps and locations for the side missions. That just feels like you're replaying the side missions over and over again. Game AI is brilliant and difficulty is pretty forgiving for most players, graphics is good and performance is decent at Max settings.\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nBut that crap aside, lets talk about the game itself\nByPushan Panditaon 18 December 2015\nHardware Platform: Pc\n|\nVerified Purchase\nDamn it!\nNot a single bit of the actual game on the dvd! Just the installer! Gotta download the rest from steam. Curse you, steam! And thats 20 gb in all, just in case you are wondering.\nBut that crap aside, lets talk about the game itself, the real thing, right? The real deal. So how is it?\nF***ING AMAZING!\nYeah. But i dont think i need to convince you on that. It's everywhere.\nIf you can handle that steam annoyance, buy it. Even if you cant, go for it nevertheless. Yes, its that good.\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nAfter a terrible time dealing with flipkart\nByAmazon Customeron 22 November 2015\nHardware Platform: Playstation 3\n|\nVerified Purchase\nAfter a terrible time dealing with flipkart, I decided to try my look with another service. Amazon were very efficient with updates and informing about the arrival of my product and its delivery. As far as the game is concerned, it is one of the best games I have played so far. However it is highly addictive and difficult. Even though the graphics are not as detailed as the PS4 version it is still worth purchasing and a lot f fun. Thanks for supplying this to me Amazon\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nGreat Game\nByPrachi Raion 30 August 2016\nHardware Platform: Playstation 4\nThe phantom pain is amazing.The graphics are the best so far i have seen in a game. The storyline is great and so is the gameplay but then again nothing less would be expected from Konami. So if you're thinking about buying this game after months of the release date..go for it.\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nIts a great game and would recommend people who like both stealth ...\nByAmazon Customeron 20 November 2015\nHardware Platform: Pc\n|\nVerified Purchase\nIts a great game and would recommend people who like both stealth games and action games to check it out. It allows for you playing different playstyles and mixing things up if you get bored with one.\nSpoilers\nI would not complete this game 100% because the last few C2 missions (you'll know what that means when you get to it) are half arsed and artificially difficult. but until C2 I enjoyed the entire game.\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nA Masterpiece By Hideo Kojima Must Buy Game\nByAmit Kumaron 20 September 2015\nHardware Platform: Pc\nThis game is great i did not buy it from amazon i purchased a gtx 970 and then i go to nvidia to redeem code of the phantom pain.steam servers are great on my mobile internet was between 400-600kbps but connected to steam i got 1.6MBPS maximum and 700kbps minimum.i started the download at 12:30 at midnight and when i got up 6:30 i saw game is downloaded and when i play the game the story is amazing.a must buy game if you have any console or pc.\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"1.0 out of 5 stars\nThere is NO Game in the DVD\nByYauzaaon 23 October 2015\nHardware Platform: Pc\n|\nVerified Purchase\nDO Not Buy, the DVD only contains 8MB Steam Setup, the DVD does not has any Game setup files, Why pay 999 to purchase a game and then pay an additional amount to download 20GB of Data over the Internet\nInstead, Just buy directly from Steam and Download the game\nThese guys should mention clearly on the box as well as in product description that DVD does not contain setup files\n1 star only for Amazon for refunding my amount\n1 Comment\n|\n2 people found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nNot flawless but one of the best games I've played\nByAmazon Revieweron 4 November 2016\nHardware Platform: Playstation 4\n|\nVerified Purchase\nIncredible in most ways. There are a million MGSV reviews out there so I'll keep this short. The action here is not frantically paced like a regular FPS, instead it makes you think - there are a million different ways to accomplish the objective and the AI intelligence is top notch. There are so many bells and whistles, all kinds of weapons, gadgets, easter eggs. I've coded a chess game all by myself and it still blows my mind how mere mortals can accomplish these incredibly intricate AAA games. Hats off. Oh and if you're a hardcore Kojima fan like I've become, follow him on Twitter... :)\nComment\n|\n4 people found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"2.0 out of 5 stars\nThe game is good. The reason behind me giving just 2 stars ...\nByNikhilon 16 December 2015\nHardware Platform: Pc\n|\nVerified Purchase\nThe game is good.The reason behind me giving just 2 stars is it comes with just one dvd which has only 8 mb of data ie the steam installer.The whole game of 28 gb has to downloaded in order to play it.Its like your just purchasing the product key .Just for the product key the price is steep.\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"4.0 out of 5 stars\nA great game, but sometimes restrictive.\nByRonyon 5 September 2015\nHardware Platform: Pc\nA great game from Kojima, though sometimes despite the open world it forces you to play in a certainw ay taking away from the USP of the freedom of teh stealth gameplay its advertised as.\nOther than that looks great and there's just so much you can do in the open world when its not forcing you to play in a certain way.\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"3.0 out of 5 stars\nDidn't try it but is very cheap compared to directly ...\nByKarthikon 26 December 2015\nHardware Platform: Pc\n|\nVerified Purchase\nDidn't try it but is very cheap compared to directly buying on steam . It costs 3 thousand on steam but only 1 thousand on amazon. The disc does not contain the game . Only a 9 mb steam installer . 20.5 gb download required so buy if have high speed broadband only\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nIt's an MGS game by Hideo Kojima! What do you expect?\nByKaran Dason 4 September 2015\nHardware Platform: Pc\n|\nVerified Purchase\nYou can tame a dog and take it with you on missions 10/10\nThough on a more serious note you do indeed just get a steam installer on one single disc and a steam key. And the download size is a hefty 20.3 gb so make sure your monthly cap (if any) would suffice for such a huge download.\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nthe stealth is amazing and the amazon packaging was awesome\nByParth Sarthi goelon 23 September 2015\nHardware Platform: Pc\nThis game will surely will the game of the year, the stealth is amazing and the amazon packaging was awesome , nothing to say about delivery , always up to the mark.8 mb installer and then download 28gb , uff , a big big con.Otherwise , KONAMI HAS PRODUCED A MASTERPIECE.\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nA must buy...\nByRaghavendra Halluron 19 January 2016\nHardware Platform: Playstation 4\nGame is astonishingly beautiful.. I was not at all aware of metal gear solid saga before this game was out.. but now I am a big fan. I have completed about 10% of the game even after spending good 30 hours. The thing I liked most about this game is how the characters are shaped. You feel engaged & responsible while playing the game & there is an additional responsibility of managing your base too.\nIn short, this game is a package of excellent nonlinear gameplay, interesting story & characters. Probably a best open world game of the year.\nComment\n|\n3 people found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nAll for Revenge\nByAmazon Customeron 26 October 2015\nHardware Platform: Pc\n|\nVerified Purchase\nThe Best game i could get. With a price of 999 and awesome story and gameplay. The FOB was a charm. However you have to download 20.5 Gb i still love it. Great work Hideo Kojima and Team. For me atleast it is the most PHOTOREALISTIC.\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\n10/10\nByDeepak S.on 10 September 2015\nHardware Platform: Playstation 3\n|\nVerified Purchase\nThe best video game ever made! Every little detail is intricately thought out. Incredible scale, spectacular gameplay mechanics and great longevity. I've clocked over 15 in-game hours and only finished 3% of the game. A true collectors item! Just buy it!\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nOne of the best stealth mode games out there\nBypavitra singhon 6 January 2016\nHardware Platform: Pc\n|\nVerified Purchase\nOne of the best stealth mode games out there. Gameplay is amazing. Worth playing. Although you'll have to download it from steam (around 20 GBs), but it's worth that trouble given the price concession.\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"4.0 out of 5 stars\nPlay until the end of Chapter 32 and shut the ...\nByRBon 16 December 2015\nHardware Platform: Pc\n|\nVerified Purchase\nPlay until the end of Chapter 32 and shut the game off. That's the end. There's nothing after it and that's how Metal Gear Solid ends. You'll be doing yourself a favor. GOTY contender ruined by Konami.\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nV has come to.\nByKevin Vegdaon 9 September 2015\nHardware Platform: Pc\n|\nVerified Purchase\n*In Sirius Black voice* \"I did my waiting! 5 years of it!\". I've been an MGS fan for a long time and I knew V would turn out to be the best game of the recent times. Wasn't disappointed. Thank you, Based Kojima.\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"4.0 out of 5 stars\nIf i have already downloaded files of metal gear solid ...\nByGameDaddyon 19 September 2015\nHardware Platform: Pc\n|\nVerified Purchase\nIf i have already downloaded files of metal gear solid v the phantom pain from other sources, do i have to still download it ovwr steam?! Or can i run it without downloading it and just by activate it on steam?!\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nDon't waste your time reading reviews of this game just buy it\nByAniket Sarkeron 10 September 2015\nHardware Platform: Xbox One\n|\nVerified Purchase\nnow that called a real one man spy mission game...and about the graphics, storyline, and gameplay??....mindblown...i m not a big fan of tactical shooting game but this game only this one touched my heart.\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nMASTERPIECE FROM KOJIMA, DISASTERPIECE FROM KONAMI\nByShakti Chaturvedion 6 September 2015\nHardware Platform: Pc\n|\nVerified Purchase\nEnsure you have unlimited internet plan and lots of patience before you buy this.\nThe five star is for the game and the genius that is Hideo Kojima.\nThe game disc is essentially pointless as it contains only an 8.78 MB Steam Installer so Konami gets a -2 star from me. Its a 999 worth CD Key\nLets face it downloading 20.4 gigs is a \"Pain\" in itself.\nBut is the game worth the time, money and download ?\nAbsolutely, a brilliantly crafted stealth action experience unlike any other. It will grip you right from the start, Kojima is a genius, the game feels like a movie. And the best part ? Its very very well optimized for PC's and runs very very smooth. This is my third Metal Gear game, don't worry about the story even regulars have trouble grasping it.\nA great way to end a 28 year old series.\nComment\n|\n2 people found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"1.0 out of 5 stars\nGreat game. Game disc doesnt contain the game.\nByShauryaon 5 September 2015\nHardware Platform: Pc\n|\nVerified Purchase\nThe game itself is fantastic, but the physical copy of the game only contains a steam installer and some game data after installing aforementioned data from the disc you have to download 20gb's of the game from steam. This is shameful. The only reason I am buying a physical copy is that I don't have to download that kind of data.\n1 Comment\n|\n9 people found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nMGSV = <3\nByadarshon 10 October 2016\nHardware Platform: Pc\nmust buy\nwish i could delete my memories and play this game all over again\nComment\n|\n2 people found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"4.0 out of 5 stars\nGet ready to download full 21.5GB ... on steam...\nByAjay Rajputon 4 September 2015\nHardware Platform: Pc\n|\nVerified Purchase\nGame is superb 5 Stars... but whats the point to buy a physical media... if it doesn't contain any game data... only 8Mb steam istaller .. You need to download full game data through steam... which is around 22Gb... But if we compare this price with steam price its cheaper.. On steam its price 59.99$ means 3600 rupees + download cost... Im downloading through 3G data... and 22 gb cost me lot paisa... Maar dala rai.... ''\nComment\n|\n2 people found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"3.0 out of 5 stars\nExcellent game but DVD is empty, you have to download 20gb\nBySomenTOP 500 REVIEWERon 9 September 2015\nHardware Platform: Pc\n|\nVerified Purchase\nGame files missing on the DVD.\nThis is cheating. The product description does not indicate 4his either.\nExtremely Disappointed with the distributer of this game.\nGad to download 20 GB over internet which effectively costs 2000 rupees on Airtel 4G.\nBad marketing.\nGame is excellent... just upset with the fact that the physical DVD was a bummer.\nComment\n|\n2 people found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nBest from KOJIMA\nByMikael L Chuaungoon 21 October 2015\nHardware Platform: Pc\n|\nVerified Purchase\nDefinitely Game of the Year 2015. Dont listen to people who say the missions are repetitive. Those guys don't know how to enjoy the game. They are not creative and simply choose the simple path..And please dont complain about the 8MB DVD content. You are paying Rs940 while the rest of the world is paying $60\nComment\n|\n2 people found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nThe Best Game Ever\nByVenom Snakeon 7 November 2015\nHardware Platform: Playstation 4\n|\nVerified Purchase\nThough I generally don't do product reviews on Amazon, but this game is worth mentioning. I got MGS V Ground Zeroes(prequel to this game) free on PS4 and though I was never into MGS series, that game blew my mind. I generally play for about 1 hour a day when i get time and I normally game about 6 hours a week. But for Ground Zeroes, I completed each and every mission and challenge on every difficulty and that was the first time in my life I played continuously for 10 hours. So I pre ordered this game from Amazon. The package arrived on time and was well sealed and I got the DLCs as per advertisement. Now, after playing this game for small amounts from September(with breaks obviously!) and finally completing it, I got to say that this game is a blast and a complete package. This game very well justifies it's price of 3500(sometimes i think it's a bit less😁).\nI won't say that this game is perfect, but it is fun and that what matters. Some people say that this game has a bad story or something like that, but it is subjective. For me the game's ending was the best in video game history as it delivered a very strong moral message which many people don't seem to digest . About the rest of the story, it was O.K because as I said earlier I have never been into MGS games and the story is a bit complex(as it has always been the case with MGS Games).But I don't expect a Naughty Dog like story from every game I play.The game is lengthy enough and even if you buy today and play in small amounts every day, you will have a blast with it. Coming to the graphics, they are quite good on the PS4 and so is the game performance. I can't comment on MGS online because I don't have a PS Plus membership. But for those people who are looking for single player fun I would suggest this game to everyone who is looking for a game with value for money.\nComment\n|\nOne person found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nOne of the best out there!\nBylakshay chauhanon 28 June 2016\nHardware Platform: Playstation 3\n|\nVerified Purchase\n+massive open world\n+dynamic weather\n+good graphics even on old generation\n+plenty of things to do from base management to recruitment process\n-none!\nComment\n|\nOne person found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nover 200 hrs\nBynamamon 4 September 2015\nHardware Platform: Playstation 4\n|\nVerified Purchase\nGot the day 1 edition as I preordred it and for people who says ground zeros was short it I gonna wipe it down I got it for ps4 don't know about pc\nComment\n|\nOne person found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
}
]
}