
{
"keywords":[
"1",
"2",
"3",
"4",
"5",
"6",
"7",
"8",
"9",
"10"
],
"reviews":[
{
"review":"4.0 out of 5 stars\nFour Stars\nByJoshAraujoon 8 March 2017\nHardware Platform: Pc\n|\nVerified Purchase\nI haven't opened it yet, but the box looks good\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nnice\nByAmazon Customeron 12 March 2017\nHardware Platform: Pc\n|\nVerified Purchase\nWorkimg perfectly but have to waste our data to download the game\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"1.0 out of 5 stars\nOne Star\nByAmazon Customeron 15 March 2017\nHardware Platform: Pc\n|\nVerified Purchase\nthis game is not compatible with my pc please help me return it\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nFive Stars\nByNeelufer ARon 30 September 2015\nHardware Platform: Playstation 4\n|\nVerified Purchase\nMy friend loves it\n1 Comment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"4.0 out of 5 stars\nFour Stars\nByNimit Ranaon 14 September 2015\nHardware Platform: Playstation 4\n|\nVerified Purchase\nI'm happy with the packaging and the product itself.\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"3.0 out of 5 stars\nExcellent game but a big letdown on PC platform\nByNikit S.on 8 May 2015\nHardware Platform: Pc\n|\nVerified Purchase\nThis was one game which I was waiting eagerly to get my hands on. Once I got it finally to my horror you had download the entire 35 GB of game in 29 parts adds to that a recently released patch of 15.8 GB. Since this is India & not US where there is allowance of much liberal internet usage- a fact which the developers could have taken into account. This humongous download was a big let letdown even if you can play the game with limited capabilities till the rest of the files are downloaded in background. Make no mistake the game is superbly designed & fun to play but on PC platform it does come with it's baggage of problems\nComment\n|\n2 people found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"4.0 out of 5 stars\nBuy only if you have fast internet with large bandwidth!!!!\nByKarthic T Uon 30 April 2015\nHardware Platform: Pc\nThe game is a masterpiece with top graphics and storyline. Combat, online gameplay faction amd Arena Interaction are all great. But the problem is, to enjoy it you have to download nearly 30+ GB of game data from the internet. Its really annoying to have purchased a physical copy of the game and still download such huge amount of data unlike the GTA 5. The only difference between the Steam copy and physical copy is that you actually pay less to the latter. Go ahead and buy the game if you are a fan of fighting games and ONLY if you have a large bandwidth with decent speed. Any players feel free to add me on Steam - karthictu\nComment\n|\n16 people found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\n5 stars for the game not the product!!!\nByJacobon 8 March 2017\nHardware Platform: Pc\n|\nVerified Purchase\nI had no option left but to purchase a PC version of the game since PS4 was so expensive and I already owned a PS3. Thanks to Sony they ruined my happiness with Steam (absolute nonsense platform) which forces its users to download obscene amount of data given our Internet provider speeds. It's as good as downloading 3-4 games at once which will slow you down until you lose all interest in the game. I have hardly played this game to my satisfaction and its asks for an update which takes eons to complete. I have uninstalled the game and god forsaken Steam from my computer for good. Never again will I go for Steam. Had to let out some steam myself!!!\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"1.0 out of 5 stars\nI purchased this game with high expectation. But what ...\nByShahanon 4 June 2015\nHardware Platform: Pc\n|\nVerified Purchase\nI purchased this game with high expectation. But what I experienced was, when I got the game the game box' lamination was not there. I double checked the product in YouTube and it's laminated. Also the poster of scorpion was missing. They're was no manual which contains the CD key. If the CD key was there I would have never mind the poster and lamination. Amazon should take serious action against this.\n1 Comment\n|\n10 people found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"2.0 out of 5 stars\nStunning gameplay, 30 GB download required for installation!\nBySameer D.on 4 May 2015\nHardware Platform: Pc\n|\nVerified Purchase\nThe 2 stars are for the amazing gameplay and the bonus Goro DLC that came with the pack. I hate that one has to download a 30 GB patch/installation for this to work. It seems a lot easier to provide 4 extra DVDs with the box. They seriously need to rethink their distribution. It took forever to download. Once it got installed, it was pure awesomeness.\nNote: I bought this from Cloudtail first, wherein I received a used product which wasn't wrapped in plastic and did not have anything (Serial Key) inside except the DVD. I returned it and was promptly refunded my money. I don't mean to tarnish the seller's image here as I have ordered other products worth a lot more and have been satisfied. But should anyone receive such a product, do return it promptly.\nComment\n|\n5 people found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nBest fighting I've ever played on a console\nByvickeyon 8 February 2016\nHardware Platform: Playstation 4\n|\nVerified Purchase\nBest fighting I've ever played on a console.And actually I did not download 30GB game data to play this game.\nComment\n|\nOne person found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"4.0 out of 5 stars\nNice but not worth\nByB V Krishnaon 4 June 2016\nHardware Platform: Playstation 4\n|\nVerified Purchase\nProduct is nice. Good for two players not for single. Its MRP is Rs 1899 only there is no 48 percent discount as shown in app. Not worth to buy. Made a mistake. Can help some poor people instead of purchasing this.\nComment\n|\n2 people found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"4.0 out of 5 stars\nAmazing Gameplay! Trip down the memory lane.\nByVivek Deepon 16 May 2015\nHardware Platform: Playstation 4\nhttp://deepbheep.blogspot.in/2015/05/top-ten-video-games-on-playstation-xbox.html\nPros\nStunning graphics\nThe best fighting mechanics of any game in the series\nInteresting character designs pop thanks to great-looking visuals\nCons\nSome new characters fail to stand out\nFighting can feel oddly staccato\nI have done a complete review on the game and the top 10 games currently out there with links to discounted price, Do check it out.\nhttp://deepbheep.blogspot.in/2015/05/top-ten-video-games-on-playstation-xbox.html\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"4.0 out of 5 stars\nIts a really good game nice campaign and the best fatalities ever\nByrichard georgeon 5 December 2015\nHardware Platform: Playstation 4\n|\nVerified Purchase\nIts a really good game nice campaign and the best fatalities ever. This is the type of games u should play with friends. I gave it a 4 star due to its long cinematics. But overall its an awesome game.\nComment\n|\nOne person found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"3.0 out of 5 stars\nGood fighting game!\nByShariqon 6 July 2016\nHardware Platform: Playstation 4\n|\nVerified Purchase\nFast and brutal fighting game, graphics are very nice. But there is no option to turn off the automatic match recording also didn't like the practice mode a lot there should be a demo for each move.\nComment\n|\nOne person found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nMortal kombat x should be bought on Amazon\nByAmith paion 29 April 2015\nHardware Platform: Xbox One\n|\nVerified Purchase\nExcellent game. Delievered on time by Amazon and with free pre-order DLC character goro included. I was really happy I bought this copy on Amazon .. A must buy if you are a fan of the genre.\nComment\n|\nOne person found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"3.0 out of 5 stars\nRecommended Only for High Speed Net Users!!!\nBysusheelon 18 April 2015\nHardware Platform: Pc\n|\nVerified Purchase\nI was very much surprised to see only 1 DVD in the Box. During installation, i was clear that we need to download entire game through Steam. Initially it downloaded 3GB. Now it is downloading 29 Game Parts individually each like 400-500mb sized. What is the use of purchasing DVD if are made to download the entire game? Pathetic Game Developers. Nothing wrong with Amazon. As always, Seller and Delivery duration both were satisfactory.\nComment\n|\n4 people found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nCool.\nByLatu Moni Devion 4 July 2015\nHardware Platform: Pc\n|\nVerified Purchase\nAwesome except the fact I had to download an extra 30 GB from the internet. Not convenient for Indian consumers. Thumbs up to Amazon.in for exceptional service.\nComment\n|\nOne person found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"1.0 out of 5 stars\nRidiculous, You have to dowload the game after buying it.... and its more than 30gb\nByPRAKASH NATHANIon 19 May 2015\nHardware Platform: Pc\n|\nVerified Purchase\nThis is cheating, I got the disk but not the game, not saying that its pirated but I have to download 30 gb of data on a 1mbps connection which will take ages. This was not mentioned when I bought the product, and the package arrived in very bad condition and not even in a DVD case but in a card board box with scratches on the DVD.\nComment\n|\n11 people found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nGREAT GAME. BUY FROM GAMESTHESHOP\nByAnkur Goelon 21 November 2015\nHardware Platform: Xbox One\nGreat game especially if you are a Mortal Kombat fan. I am playing Xbox One version. Also, buy from gamestheshop. Its available for ₹1,999\nComment\n|\nOne person found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nMK X PS4\nByAmazon Customeron 17 April 2016\nHardware Platform: Playstation 4\n|\nVerified Purchase\nAwsome game... requires no download for ps4, story mode one of the best part of the game\nComment\n|\nOne person found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nFive Stars\nByprathamgbon 25 September 2015\nHardware Platform: Xbox One\nit should have been there for x box 360 also\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nBest graphics with awesome gameplay.\nByManish R.on 20 February 2017\nHardware Platform: Playstation 4\n|\nVerified Purchase\nThe game itself is enormous and graphics are awesome. I would recommend it for playing in between games when you need you need a bit of change from your usual tomb raider, final fantasy. You can play PvP or go online join a faction and see how you fare taking down the towers.\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"1.0 out of 5 stars\nCaution: Not What you think it is.\nByRohit Barbaruahon 19 April 2015\nHardware Platform: Pc\n|\nVerified Purchase\nI should have waited and read more reviews before making this order. Honestly guys, the developers are just trying to suck the money out of you. I paid full for this game, and I got a disk with 1/10 game content in it. You have to download the whole freakin game. I have no idea how much because I am not going to download it myself. If you are rich, then get an internet plan and if you are the torrent guy then black box is out already so.... Go for blackbox. This is not worth the price. Thank you.\nComment\n|\n9 people found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nRegistered code to steam yesterday. Though I could not ...\nByLeon Kimon 16 April 2015\nHardware Platform: Pc\n|\nVerified Purchase\nRegistered code to steam yesterday.\nThough I could not test it because of its high graphic where my laptop's not suitable for running it.\nI heard there's no Jason and Predator yet but they gave me Goro DLC.\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"3.0 out of 5 stars\nRequires 32 GB of download\nBySuraj S.on 26 December 2016\nHardware Platform: Pc\n|\nVerified Purchase\nWell would not have mind paying additional money for a DVD instead. After installation it need additional 32 GB of download, Which was lost once due to steam etror and no specific resolution was mentioned.\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nTotal Gore Gameplay !\nByKislaya Srivastavaon 26 May 2015\nHardware Platform: Xbox One\n|\nVerified Purchase\nExcellent game !! Totally lived up to my expectations !!\nGreat graphics and great story line !! Timely delivery by amazon ... Keep it up amazon !! Must buy for people who love #SHEDDINGBLOOD ;) :D\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"4.0 out of 5 stars\nVery good game, stunning visual and nice online mood\nByDeependraon 19 May 2015\nHardware Platform: Playstation 4\n|\nVerified Purchase\nVery good game, stunning visual and nice online mood. Mk X got alot of expansion when we compare to it's previous version.\n5/5 for the game. -1 since i got it 2 days later after release date. :(\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nSHEER ENTERTAINMENT !\nByNabeel Khanon 27 July 2015\nHardware Platform: Playstation 4\nThis is probably the best multiplayer fighting game made for PS4.\nThe brutalities and fatalities are cruel and gory which really gives it the status of MATURE GAMING TITLE.\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nSolid game overall with some brilliant graphics (although non Titanfall 2-level) and old characters\nByKaran Jainon 9 January 2017\nHardware Platform: Xbox One\n|\nVerified Purchase\nThe *mandatory* 12 gig update makes this Mortal Kombat XL for some reason. Solid game overall with some brilliant graphics (although non Titanfall 2-level) and old characters.\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"4.0 out of 5 stars\ngood fighting game\nByajith mson 24 May 2015\nHardware Platform: Playstation 4\n|\nVerified Purchase\nStory mode is really good. 2 player Fighting mode is also good. Much better than previous mortal combat games. Special moves and fatalities easy to perform.\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nAmazing game! Great delivery as\nByShiv Badhwaron 26 June 2015\nHardware Platform: Playstation 4\n|\nVerified Purchase\nAmazing game ! Great delivery as usual\nComment\n|\nOne person found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"4.0 out of 5 stars\nI like it\nByRam Gopalon 16 April 2015\nHardware Platform: Playstation 4\n|\nVerified Purchase\nThis my first fighting game after playing age old Tekken 3 and I liked it very much. There is so much sophistication and creativity in this.\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nFive Stars\nByFaizan Rafiqueon 29 June 2015\nHardware Platform: Playstation 4\n|\nVerified Purchase\nReceived in very nice condition.\nComment\n|\nOne person found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"1.0 out of 5 stars\nWaste of Money\nByAndyon 28 April 2015\nHardware Platform: Playstation 4\nIt's not a double player game. The game has good graphics and that's it. Playstation became famous in its time due to the compatibility of group playing especially Mortal Kombat became famous as there was 2 player option in the story mode of the game in its playstation 2 version. Spending so much money on the game just to find out that it is single player is a total waste.\n1 Comment\n|\n2 people found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nDangerous\nBykartik kamal ranaon 24 December 2015\nHardware Platform: Playstation 4\n|\nVerified Purchase\nactually I gifted this game to my sister and jiju. pretty amazing reviews I saw on YouTube. brutal game\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"3.0 out of 5 stars\nIt's Good, but the price is a bit too high. A couple of months wait, might bring in some Discounts.\nBySunil M.on 16 July 2015\nHardware Platform: Xbox One\nThe first time I had played the Mortal Kombat game was on my old school gaming platform SEGA. That time I was hooked onto the game, the first time I laid my eyes on it. The graphics and the controls, and all the fatalities were amazing. Fast forward to 20 years later, and we have the Mortal Kombat X for the Xbox One. I am an avid Call of Duty gamer, and also play sport games as well like FIFA, NBA, Racing and more. The graphics on the Mortal Kombat X are really good and very detailed, and at times to the extent of being graphic. The bones cracking, spine crunching, eye ball gouging, head splitting, ball crunching moves are all good. However, after the first 4-5 times of playing it, I got bored. There is a storyline added to the game to make it interesting, but it still becomes monotonous. After 20 years, I would have expected something more than just an addition in storyline. When Call of Duty can bring something new year after year, I would have expected that Mortal Kombat would have been loaded with awesome stuff. But it does not. Otherwise, it was an ok game to play. Brings back memories to fight with the old players like Liu Kang, Rayden, Johny Cage and more. Compared to the Sega systems, the fatality combinations are much easier. It is costly for the level of eagerness if would generate once you have the game. I would prefer to play a game of COD multiplayer or FIFA multiplayer than put in the CD for Mortal Kombat.\nComment\n|\nOne person found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nI love the game but i hate the publishers\nByVaibhav M.on 30 June 2015\nHardware Platform: Pc\n|\nVerified Purchase\nI love the game but i hate the publishers. Made me download 15 GB patch for playing at the beginning, wonder whats in the DVD then?\nThen the latest patch,Also 15 GB +. Result, stopped playing it.\nComment\n|\n2 people found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"3.0 out of 5 stars\nPLEASE READ IT , HELP YOU IN TAKING RIGHT DECISION\nByRAJATon 18 April 2015\nHardware Platform: Pc\nTHIS GAME IS ONE OF THE BEST IN SERIES,BUT HAS A CON COMING WITH IT IF YOU ARE BUYING RETAIL DISK.WHEN YOU BUY RETAIL A RETAIL DISK YOU EXPECT THAT ALL THE GAME CONTENT GET TO YOU LOADED INTO DVDS BUT WHEN YOU WILL RECEIVE THE COPY OF THIS GAME YOU ONLY GET A SINGLE DVD CONTAINING LESS THAN 1.5 GB'S GAME CONTENT AND THE REST OF THE GAME YOU WILL HAVE TO DOWNLOAD FROM STEAM AND THE SIZE YOU HAVE TO DOWNLOAD IS AROUND 33 GB'S.THIS WILL NOT BE A PROBLEM IF WE ARE LIVING IN SOME WESTERN COUNTRY WERE THEY HAVE TO PAY $20( Rs 1200 ) FOR 25 MB UNLIMITED INTERNET.BUT WE ARE LIVING IN INDIA WHERE FOR 1 Mb INTERNET PLAN WHICH GIVE DOWNLOAD SPEED OF 128 KB/S WE HAVE TO PAY RS 1200.WE THIS SUCKY SPEED IT TOOK ME MORE THEN 80 HR'S TO GET THIS GAME IN TO MY PC,AD GUESS WHERE DO I LIVE ,I LIVE AT NEW DELHI WHICH IS UNFORTUNATELY CAPITAL OF INDIA.SO UNLESS YOU ARE SOME RICH MAN WHO CAN AFFORD A NET PLAN WHICH DOWNLOADS THIS GAME IN LESS THAN 10 HR'S(BECAUSE AFTER 10 HR'S SEEING THIS THING GETTING DOWNLOAD WILL BE VERY FRUSTRATING) MY OPINION IS NOT TO GO FOR IT.\nComment\n|\n3 people found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"2.0 out of 5 stars\nBroken case\nByHimanshu Karakotion 29 December 2016\nHardware Platform: Playstation 4\n|\nVerified Purchase\nReveived the product with broken case ... overall good game\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nFive Stars\nByVishal the bossson 18 May 2016\nHardware Platform: Playstation 4\n|\nVerified Purchase\nAwesome best fighting game and delivers very fast\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nFive Stars\nBymanpreeton 18 June 2015\nHardware Platform: Playstation 4\n|\nVerified Purchase\nGreat game storyline is short but still it's great\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"4.0 out of 5 stars\nFour Stars\nByRitej Bachhawaton 27 December 2015\nHardware Platform: Playstation 4\n|\nVerified Purchase\nPretty difficult controls..otherwise a good game\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nFive Stars\nByRaghavendra B Son 12 September 2015\nHardware Platform: Playstation 4\n|\nVerified Purchase\nAwesome game! Also no scratch on disk or case.\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nMortal Kombat X Review - Your Very Own Kung Fu Flick\nBySathishon 14 April 2015\nHardware Platform: Playstation 4\nMortal Kombat X offers the best story mode I've ever personally seen in a fighting game. Its cohesive plot and extended cinematics makes you feel much more like a participant in a film than a player on the couch. The fighting is frantic, fluid, and dynamic, with the glorious goriness of the X-Ray moves often turning the tides of battle.\nAn absolute must for franchise fans, and a really stellar bet for general fighting game fans, even those who just appreciate a good story will find a lot to love in Mortal Kombat X.\nComment\n|\n3 people found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nMortal kombat x\nByRadhika Bhargavaon 14 July 2015\nHardware Platform: Playstation 4\n|\nVerified Purchase\nExcellent delivery speed and a wonderful game\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nGreat game, awesome graphics!\nByaliasgharon 7 October 2016\nHardware Platform: Playstation 4\n|\nVerified Purchase\nGot what it said. Great game. Classic MK.\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nFive Stars\nByVinodon 28 April 2015\nHardware Platform: Playstation 4\n|\nVerified Purchase\nA must buy if you are fighting game fan\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nAlways a fan\nByCiju J.on 13 September 2015\nHardware Platform: Xbox One\n|\nVerified Purchase\nIve always been a fan of the series\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"3.0 out of 5 stars\nThree Stars\nByAmishon 24 May 2015\nHardware Platform: Pc\n|\nVerified Purchase\nGood game. Horrible pc port though.\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
}
]
}
