
{
"keywords":[
"1",
"2",
"3",
"4",
"5",
"6",
"7",
"8",
"9",
"10"
],
"reviews":[
{
"review":"5.0 out of 5 stars\nUbisoft\nByBiswamayon 24 December 2016\nPlatform for Display: PC\n|\nEdition: Standard\n|\nVerified Purchase\nubisoft again prove themselves by making this awesome game...Need Little Improvements though, the game works fine...Just need to download additional 13:65gb file from their server and their recent update 2 and half gb size..thats it ....u r ready to rock and roll..\nComment\n|\nOne person found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"1.0 out of 5 stars\nVery bad\nByChinnaon 22 March 2017\nPlatform for Display: PC\n|\nEdition: Standard\n|\nVerified Purchase\nGame 1st cd not installed. ....I'm download full game 32 gb ....2nd hand game cd.... don't purchase thez item..\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nFinally, the division is here!\nByAbhishekon 30 March 2016\nPlatform for Display: PC\n|\nEdition: Standard\n|\nVerified Purchase\nDelivered within 4 days, but the seller's packing was average, as their was no airbubble packaging, instead cardbox only!\nNow, coming to the game, i have been waiting for division since it's E3 trailer 2 years ago, and yes graphics have been downgraded just a notch, but its still looks gorgeous! I own gtx970 paired with i5 4690, getting constant 60fps at high, 40fps at ultra. Moreover the game also looks good in low! I have played the main campaign half way, and it's been a blast whenever i team up with my cousin for co-op campaign or in dark zone! The only con of the game is you have to grind all the way upto level 30 to stand a chance in dark zone, moreover it's hilarious to go rogue! If anyone is scared about the low speed Internet speed believe me guys, i live in Himachal Pradesh, and bsnl broadband suckS! No lags or server shutdowns are rare. Overall rating 9/10! .5 deducted for grinding through boring side missions to gain xp, and .5 deducted as uplay simply sucks! For any queries contact me!\n1 Comment\n|\n16 people found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nMust Buy Game Beast Game\nBySakthi Eswaron 27 March 2017\nPlatform for Display: PC\n|\nEdition: Standard\nOkay Done so this review is after 1 year of game launch so iam Here to tell you actually you can buy division or Not is it worthy or Not so Here a big review\nI bought this game at October 2016 i bought key only on Uplay For 800 on sale i played this game i liked first 5 hours after that this game got bored and i left playing This game For about 3 months and i started playing from January 2017 only 25+ missions , mission Price is required on mission difficulty Normal, hard , challenging, Legendary Like 2500+ Guns, armors , kneepads , gun , holster etc etc i played about 521 hours now i didn't get bored still this is the best shooting game you cannot play on Your Life if you miss this must buy game 100% my friends told after playing this game , this game is boring as he*l but you need o understand about your leveling up buy it and enjoy if you want to play with me add me on uplay id name: Sakthiesr\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"3.0 out of 5 stars\nNot worth the current price\nByVenkaton 15 October 2016\nPlatform for Display: PC\n|\nEdition: Standard\n|\nVerified Purchase\nAverage game, decent graphics, ok game play but nothing ground breaking. When this game was showcased in E3 2013, it awed everyone. The final release was disappointing as the graphics were downgraded & the core game play elements excluded.\nMultiplayer piece of the game is something which can be enjoyed though. Especially in the dark zone.\nThis is an online game & requires an active internet connection at all times. Even the single player campaign cannot be accessed if you are offline.\nCurrently it not worth the price, may want to wait it out till it receives a price cut.\nComment\n|\n5 people found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"4.0 out of 5 stars\nTRUTG ABOUT THE DIVISION AND SHOULD YOU BUY IT?\nByBen Gomezon 20 May 2016\nPlatform for Display: PC\n|\nEdition: Standard\n|\nVerified Purchase\nSHOULD YOU BUY THE GAME NOW?\nI buy tons od new Games from amazon or flipkart (rarely from flipkart) so if you think to buy this now or a few days from today I would say that would be like wasting money because it is an totally online based game which means even if you play any mission on normal mode (there is no easy mode) , It would require atleast three players and day by day people are not leaving it Why? Because it was launched on 8 march and today is 20th May which is not bad I can still get many players to roam about with but According to me or as I know people wouldn't even play this after a few weeks.\nWHAT ARE THE FRIGGIN' PROBLEMS I HAVE TO GET THROUGH TO PLAY THE GAME?\nFirst an Internet of 512 KBPS Speed would be better not 512 Kbps there is a huge difference between that Big \"B\" and Small \"b\" If you know the difference b/w bits and bytes.... You got it.\nInstallation requires an UPlay account you will be able to set it up later and the app UPLAY will be in the CD .\nAfter you are all done installing from 5 DISKS Don't forget there is 4GB Update waiting for you as for me it took several minutes but you do need a really good internet connection to play this game.\nWHAT SHOULD I DO ? SHALL I BUY IT?\nDepends upon if you like to play this now because dude... It's never too late and free updates are also coming one is on the way to be released on 24th may .... Which means more people are going to come online . Story is not much like as expected. .. I was disappointed alot but DARK ZONE ♡ didn't so another reason I play it today also is the humongous Dangerous Dark Zone .\nIf You guys liked my small review Like it and rare it If you guys dislike it then.... go KILL YOURSELF! Just kidding.... Dislike it! It might be helpful gor you guys and sorry that I've ruin your day by writing this review but it's the truth.\nUbisoft still did a great job making this game because it's very unique ,Combat is good and if you have already ordered it don't cancel it you're just lucky that you found my review\nGraphics 9/10\nStory 7/10\nCombat and perks 9/10\nDark Zone 10/10 Dangerous\nGame bugs 8/10\nAnd PC hackers in game 10/10\nComment\n|\n3 people found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"2.0 out of 5 stars\nSKIP\nByritvik narangon 1 November 2016\nPlatform for Display: PC\n|\nEdition: Standard\n|\nVerified Purchase\nWas pretty disappointed.First 2 hours were fun as hell.After that it was just the same thing over n over.Their's no reason to buy this.\nComment\n|\nOne person found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"3.0 out of 5 stars\nN. Y. Policeman set ULC code not working ...\nByAmazon Customeron 11 March 2016\nPlatform for Display: PC\n|\nEdition: Standard\n|\nVerified Purchase\nN.Y. Policeman set ULC code not working..... (invalid Code)\n1 Comment\n|\n12 people found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"2.0 out of 5 stars\nAn expensive chewing gum that loses its taste too quickly.\nByAby Christy Philipon 16 April 2016\nPlatform for Display: PC\n|\nEdition: Standard\n|\nVerified Purchase\n3 years ago when this ago was announced and revealed a gameplay, I was impressed, amazing graphics, spectacular dynamics and physics that are never seen before. So I waited patiently, 3 years later, pre-order it got it exactly the day after release, installed and came with an 1.5 gb update now it could be 3 I guess and after playing it a lot that is a month I got tired of it. I mean seriously the game is a magnet where every fight you encounter turns into a headshot rush. I've explored every part of the game and yes including dark zone and after I don't know finishing up all the missions it feels like I don't wanna play this anymore. I am actually done I mean I had more fun in Warcraft than this and it still is fun to play but The Division you will seriously get tired. I really wish they could have made this a single player campaign but no it's too late, and the funny part new DLCs are coming, you can pay for them or you can buy the season pass, I mean come on I still didn't get any value out of the money I spent for this now I have to pay more HELL NO !!!!\n1 Comment\n|\n12 people found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"4.0 out of 5 stars\nWorth the money\nByAmazon Customeron 9 June 2016\nPlatform for Display: PC\n|\nEdition: Standard\nThe division is a pretty good game. It's a bit monotonous though(you'll love the dark zone though, trust me). Intense graphics and 's good gaming engine. And u DON'T need an \"awesome\" Internet connection to run this game. 100kbps download speed is enough. Make sure that the ping is good, though. Great work, ubisoft. Oh, also....u need to riddle an enemy with a LOT of bullets to kill him....happy gaming....\nComment\n|\nOne person found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"3.0 out of 5 stars\nAdditional 10 GB is required to Download as updates\nByNahid K Non 29 July 2016\nPlatform for Display: PC\n|\nEdition: Standard\n|\nVerified Purchase\nI need to download additional 10 GB (as updates and patches) online in-order to play the game.\nIn INDIA its a frustrating thing with our broadband plans.......\nTotal 5 disks\n----------------\nDisk 1 - 7.9 GB\nDisk 2 - 7.9 GB\nDisk 3 - 7.9 GB\nDisk 4 - 7.9 GB (AFTER DISK 4 THE INSTALLATION REACHED AROUND 31.5 GB)\nDisk 5 - UNDER 1 GB~\nTOTAL INSTALLATION FROM DISK 31.85 GB.\nAFTER THAT YOU WILL BE ASKED TO DOWNLOAD ~10 GB AS UPDATES AND PATCHES (THAT REALLY SKS...)\nANYWAY GAMEPLAY IS FABULOUS., BUT UBISOFT PLATFORM IS SOO SICK.\n1 Comment\n|\n5 people found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nHow to Redeem your pre-order Code\nBySukumaron 20 March 2016\nPlatform for Display: PC\n|\nEdition: Standard\n|\nVerified Purchase\nAwesome Game!. Totally Worth it. For anyone not knowing how to redeem their pre-order code. Just go this link - [...]\n1.Navigate down the page.\n2.Click Redeem my code.\n3.On the next page, select your platform and connect with your profile.\n4.You should then be able to activate your code.\nEnjoy\n1 Comment\n|\nOne person found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nGreat Game\nByAniketon 2 May 2016\nPlatform for Display: PC\n|\nEdition: Standard\nUBISOFT has done a well well job in this game. After such a long time a satisfying shooter game from this franchise.\nPros: 1. beautiful graphics\n2. well optimized game (Ultra benchmark - [...])\n3. playing with 512 kbps broadband connection (local cable operator)\nHave not seen any game breaking issues while playing co-op ([...])\n4. multiplayer is hell lot of fun (even with matchmaking)\n5. Hackers have been ruining the game experience in PC, after a long time Ubisoft has finally declared that after initial 14 days (instead of 3 days) probation they will be banned forever.\nCons: 1. crouching can not be initiated manually (but the cover mechanism is way better than Watch Dogs)\n2. I have faced some DELTA errors and this link will help you through [...]\nOverall rating - 8.5/10\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nOnly one word.....beast\nByAkbaron 10 March 2016\nPlatform for Display: PC\n|\nEdition: Standard\n|\nVerified Purchase\nUbisoft is back.....this is one of the best next gen game....though the graphics are downgraded than E3....still the gameplay is solid..and this game is well optimised for lower gpu's....must buy game.(note:-u need permanent internet connection)....just go for it.\nComment\n|\nOne person found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nGreat game!!! Story could have been better.\nByarchieon 18 March 2016\nPlatform for Display: PC\n|\nEdition: Standard\nIts an amazing game. Graphics are too good. If u have a decent pc u'll love it. Storyline is okay could have better. Yes it needs internet connection to play story mode. But when you team up with other online members its really fun...\nComment\n|\nOne person found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nA MUST PLAY\nByTIMELORDon 12 May 2016\nPlatform for Display: PC\n|\nEdition: Standard\n|\nVerified Purchase\namazon did i prompt delivery , and as always packaging was amazing . Now onto the game -\nThe gameplay was amazing , at first i wasnt really interested in buying ,but all of a sudden it got really hyped . I wanted to try this out myself and wasnt dissapointed , it looked a lot like destiny , but there are differences , the story and character buildup could have been a lot better , took me 35hrs to complete story missions and reach lv 30 but this is where real fun starts so keep on playing . Make sure you have stable internet connection buying and it does have many upgrades prior you can play it . So kep that in mind . Other than that it is a must play .\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nAwesome GAME\nByy0geshon 21 May 2016\nPlatform for Display: PC\n|\nEdition: Standard\n|\nVerified Purchase\nAwesome game if u can Offord it you sure need to buy it not only it's game price but also data pack ( net ) price bc it's approximately consume 100md per hour . I am saying it again it's an awesome multiplayer game and it's not like other game which get finished under 10 - 15 days it is design in such a way that it will last atleast for a year and u will never get bored and if u get bored just become an rogue agent I liked these game so much. According to me it's a best game till now\nComment\n|\n4 people found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nFive Stars\nByAmazon Customeron 8 June 2016\nPlatform for Display: PC\n|\nEdition: Standard\n|\nVerified Purchase\nA really good buy for someone looking for multiplayer online gaming\nComment\n|\n2 people found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"4.0 out of 5 stars\nGame is great!\nBySarnendu C.on 17 March 2016\nPlatform for Display: PC\n|\nEdition: Standard\n|\nVerified Purchase\nNY Police ULC code not working !!!!!!\nGame is great!\n1 Comment\n|\n2 people found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nGAME OF THE YEAR FROM MY SIDE\nByUtkarsh S.on 11 March 2016\nPlatform for Display: PC\n|\nEdition: Standard\n|\nVerified Purchase\nGAME THAT IS THE REAL MASTER BLASTER\nGraphics-the game was originally downgraded but when you will play the game.....their is no game closer to the looks of this game\nGameplay-In beta we had that gun where we would just go in and just kill everything which made it to feel like an easy game but in final game you have to work quite hard.....really fun\nMy recommended card-well if you have close to gtx 650 ti, you can run this game in med high graphics at around 30-35 fps......but really to enjoy this game a gtx 900 series card is best specially 970(my card)\nShould you Buy It- you guys might have played many games but if you are not planning to buy this game....you have not played the real game that was in makes from a long time.\n1 Comment\n|\n3 people found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nGreat game.\nByislamon 25 March 2016\nPlatform for Display: PC\n|\nEdition: Standard\n|\nVerified Purchase\nGreat game ..\nFirst Game is Region locked work only On india\nsec Thank you Seller :) i will buy agine onther game :)\nThe Good\nDense, detailed world\nIntense campaign missions\nIntricate, rewarding loot system\nImpressive multiplayer integration\nClear structure with thoughtful touches throughout\nThe Bad\nPredictable enemy AI\nRepetitive side missions\nMechanical annoyances like no crouch option\nRating 8/10\nwill be Great with your friends make and play to be fun in game :)\nbe carefully on Dark Zone :))))))\nThanks , islam\nComment\n|\n3 people found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nbest ubisoft game for me\nByRANJANA SAHNIon 19 April 2016\nPlatform for Display: PC\n|\nEdition: Standard\n|\nVerified Purchase\nPlayed over a 100hrs of this now\nMax lvl and lvl51 in dz\nThis game is one of the best ubisoft games ever\nMust buy for third person shooter lovers\nIt's really hard and challenging and fun\nPlaying with friends in dz in fun too\nOverall 9\\10\nOnly servers are bad sometimes and modders are spoiling the game sometimes\nNice game buy it :)\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nQuite Massive!\nBySauMik Palon 10 March 2016\nPlatform for Display: PC\n|\nEdition: Standard\nThis is by far the most biggest game by ubisoft. And game looks crisp and fluid. Only one annoying part is there are 5 expansion pack for this game, at start you get only Manhattan area unlocked. And there are DLC for gears, maps and other content. Overall enjoyable game. Must buy to enjoy online content and play along with your friends to complete the mission esp. In dark zones.\nComment\n|\n3 people found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"4.0 out of 5 stars\nthe packaging is very poor all the four stares is for the game it ...\nByrangamon 12 March 2016\nPlatform for Display: PC\n|\nEdition: Standard\n|\nVerified Purchase\nthe packaging is very poor all the four stares is for the game it fulfilled my expectation but you got to have a good B.D. conec .\nComment\n|\n7 people found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nIts one hell of an addictive MMO\nByMriganko Mandalon 6 February 2017\nPlatform for Display: PC\n|\nEdition: Standard\n|\nVerified Purchase\nHonestly never thought this game would turn up so addictive. Its singleplayer sucks, rather it doesnt have a singleplayer but you know, if you are planning to play solo, very boring that way. Anyways add me up on uplay 'sourav321123' , fun playing together.\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nFabulous\nByAmazon Customeron 6 January 2017\nPlatform for Display: PC\n|\nEdition: Standard\n|\nVerified Purchase\nIntroduction on patch 1.5 has changed the game. With the introduction of the world tiers, there is no need to go to the Dark Zone for good loot. Only problem is when the host connection is poor. Make sure that you have stable connection. Amazing game.\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nKick Ass Game\nByRitik Singhon 21 March 2016\nPlatform for Display: PC\n|\nEdition: Standard\n|\nVerified Purchase\nI like the delivery speed of the seller. The package was well packed and when the thing come to the game. It is awesome. If You are searching for a new game.. Division Is the right choice\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nAWESOME NO DOUBT\nByVarunon 27 April 2016\nPlatform for Display: PC\n|\nEdition: Standard\n|\nVerified Purchase\nOk .. ! I am happy with the packing ! The game is worth buying ! There was no problem in the delivery it came 2 days earlier ! THE GAME IS AWESOMEE !\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"4.0 out of 5 stars\nBest tactics game ever\nByDEBABRATA DEYon 16 March 2016\nPlatform for Display: PC\n|\nEdition: Standard\n|\nVerified Purchase\nThis game is really awesome....\nComment\n|\nOne person found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nDon't think, Buy it\nByVinod Kumaron 23 March 2016\nPlatform for Display: PC\n|\nEdition: Standard\n|\nVerified Purchase\nfirst i wanted to tell people who thinking about system requirement, i'm running this game smoothly in 1080p in high settings.\nMy spec are I3 processor, 8GB ram and GTX960 Card and other peoples are telling if you have GTX 650 or higher can run it.\nAbout Delivery\nI pre-ordered the game but they delivered it after two days of lunch so i'm not satisfied wit hit because what is the use of pre-order if not getting on lunch day. Amazon may conceder this and start deliver on same as lunch day.\nAbout game\ni played for 40hr and i'm in level 20 in main game and level 18 in dark zone(my uplay id is Diablo_Ace). one of the best game by Ubisoft and Tom Clancy and its a masterpiece. i not yet completed the main story so i don't want to tell anything about it but as for i played its very good and keeps interesting.\nDark zone is multi player, where you can't trust anyone they may kill you and take your loots so best to play with team.\nP.S need permanent internet connection required.\nComment\n|\nOne person found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nFive Stars\nBySai Pranavon 6 February 2017\nPlatform for Display: PC\n|\nEdition: Standard\nExcellent multiplayer campaign..... paired with fx9590 and R9 Fury X.... xlent frame rates.....\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nnice and game is pretty good\nByYasin S.on 10 February 2017\nPlatform for Display: PC\n|\nEdition: Standard\n|\nVerified Purchase\ngreat gaming experience and nice price than any other websites\nthank you amazon\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nFive Stars\nByashwinon 10 February 2017\nPlatform for Display: PC\n|\nEdition: Standard\n|\nVerified Purchase\nhave 800 hrs in it no regrets one of best mmo/looter/shooter out there\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"1.0 out of 5 stars\nOne Star\nByAmazon Customeron 10 March 2016\nPlatform for Display: PC\n|\nEdition: Standard\n|\nVerified Purchase\nthey promised DLC called ny policeman gear set but... there was no dlc packed with the CD..\n2 Comments\n|\n7 people found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nBeast\nByAmazon Customeron 11 March 2016\nPlatform for Display: PC\n|\nEdition: Standard\n|\nVerified Purchase\nReally loving it .\nBut it needs good PC specification.\nDelivery is very fast .\nComment\n|\n2 people found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"4.0 out of 5 stars\nAwesome game!\nByAmazon Customeron 30 March 2016\nPlatform for Display: PC\n|\nEdition: Standard\n|\nVerified Purchase\nGood game but Amazon delivery was super slow!\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nawsom\nByChandanon 18 July 2016\nPlatform for Display: PC\n|\nEdition: Standard\n|\nVerified Purchase\ni love this game on time deleviry ......😁✌\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"4.0 out of 5 stars\nFour Stars\nByAmazon Customeron 1 December 2016\nPlatform for Display: PC\n|\nEdition: Standard\n|\nVerified Purchase\nGreat multiplayer game....i am loving it\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"3.0 out of 5 stars\nAverage game\nBySaurabhon 2 April 2016\nPlatform for Display: PC\n|\nEdition: Standard\nThe game graphics is revolutionary but uplay is a very bad platform. Most of times it gives error. While the gameplay is very repetitive. The game is not as hyped as shown in e3. The biggest problem is platform of uplay. All in all average game which permanent requires internet connection.\nComment\n|\nOne person found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nThe game is awesome awesome awesome got it on time too package was ...\nByAmazon Customeron 20 March 2016\nPlatform for Display: PC\n|\nEdition: Standard\n|\nVerified Purchase\nThe game is awesome awesome awesome got it on time too package was good not a scratch graphics r also awesome even if u play in medium settings my gpu is medium type gtx750ti and I didn't expect it too run this much better I am playing this in medium settings n trust me u will feel like playing in high . I have not experienced a single glitche or lag\nThe game requires a permanent connection to net through but that's not a problem for me\nIf u have net connection at least above 1 mbps then this game is for u ...\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
}
]
}