
{
"keywords":[
"1",
"2",
"3",
"4",
"5",
"6",
"7",
"8",
"9",
"10"
],
"reviews":[
{
"review":"5.0 out of 5 stars\nAwesome Game!\nByChinoon 9 April 2016\nHardware Platform: Playstation 4\n|\nVerified Purchase\nThis is without doubt one of the best games ever for PS4. You can literally hack anything and it's an open world game. Excellent graphics, story line and game play. It may take bit of time to understand the controls but when you are used to the controls then it would be fun :) Appreciate the on time delivery of Amazon. Cheers!\nComment\n|\n9 people found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nBig thumbs up\nByBhavik Minhason 19 March 2016\nHardware Platform: Pc\n|\nVerified Purchase\nBig thumbs up to Ubisoft, who just won't stop making awesome games and this game is an example of that. Awesome gameplay, fascinating story*line. Multi-player is decent too, laggy sometimes though. But the story-line will keep you interested till the end and you might get connected at the end, that sort of a game.\nComment\n|\n5 people found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nLoving it\nBySunnyon 14 July 2016\nHardware Platform: Playstation 4\n|\nVerified Purchase\nAmazing game, I was curious how it would be compared to GTA 5 and I am loving it, the online multiplayer is so much fun, the graphics are good, the rain effect looks really cool and the hacking system is pretty interesting as well. It was worth the money.\nComment\n|\n8 people found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nAwesome game\nBymanpreeton 26 February 2017\nHardware Platform: Playstation 4\n|\nVerified Purchase\n1st time i play this kinda game but it's awesome my frnd suggest me that great game new type of experience & my game favourite intro was C.O.D AD but watchdogs intro wow whole new level ubisoft did a great job.\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\ngreat game\nBybhanuprakashon 3 January 2017\nHardware Platform: Pc\n|\nVerified Purchase\nit works well.great game\n2 Comments\n|\n7 people found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nWonderful gameplayand conceptualization!\nByNamas Bhandarion 6 December 2016\nHardware Platform: Xbox One\n|\nVerified Purchase\nI was not sure whether I would like to play this game but one fine day I decided to take a risk and buy it, and it was definitely worth it. The eye-catching graphics and the extremely creative and innovative concept of being a hacker and being able to exploit almost anything in the entire Watchdog universe was amazingly interesting and something gamers have never experienced before\nIt keeps you wanting to explore the vast world inside the game because you never feel bored by the game. If you like an Open-world, Free roam as well as mainstream missions then this is the game you are looking for.\nI still play it and has definitely been worth each and every penny, go for it!Watch Dogs (Xbox One)\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"4.0 out of 5 stars\nOriginal product with expired codes for additional content!\nByRavi Sreenivasanon 23 October 2015\nHardware Platform: Playstation 4\n|\nVerified Purchase\nGreat deal and original product. However the codes for the additional content inside have all expired.\nIt would have been great if I had received a newer stock with working codes inside, so docking a star in the rating!\nComment\n|\nOne person found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"4.0 out of 5 stars\nDecent game\nByDarshan Satyaon 25 January 2016\nHardware Platform: Pc\n|\nVerified Purchase\nWell I like ubisoft for their different genre's of games.It is a truly different game.I dont understand why people compare it to GTA . Both are in different league's. Well this game is beautiful visually and you dont have to use guns but use the technology to kill.Its fun andb ou can intrude into peoples lives and know their secrets.Only let down is its weak story but there are numerous side missions and it is enjoyable.Enjoy the game guys.Its totally worth its price.\nComment\n|\n5 people found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"4.0 out of 5 stars\nHack the price of this game\nByDhanush.Son 8 January 2017\nHardware Platform: Pc\nI am giving 4 stars to this because of the price on Amazon. At 999 also the game is worth every penny spend but I bought the game from steam for just 149 during the winter sale. Without the sale also the price is only 499. Now about the game I give it a 11/10 . Just mind blowing .I want to become a hacker now after playing the game.I had no problem with driving.Its a bit easy since I play a lot of NFS and others. The story is also good.I recomend every one to buy this game. A lot of things are there to do without getting bored. But shooting is a bit tough but it doesn't matter.I think it beat GTA 5 in the run.But GTA 5 I think graphics is a little better. I get about 65 fps with my gtx 750 to and 4 GB ram\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nAN EXCELLENT GAME AND A MUST PLAY\nByRyanon 12 October 2016\nHardware Platform: Playstation 3\n|\nVerified Purchase\nDELIVERY: Fast delivery (before promised date)\nQUALITY: Good packing. No scratches or disorder of any sort.\nGAME-PLAY:\nBeautiful gameplay,lovely graphics and smooth game. Lots to do and time consuming. One of the best open world games (better than most of gta). Lots of fun and free will during missions. I love this game and recommend it to all game lovers (#MustPlay). Lovely job by Ubisoft.\nThe game was delivered much before date and no faults or disorders.\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nGreat Game!\nByOhm R. Charanon 21 February 2016\nHardware Platform: Pc\n|\nVerified Purchase\nIt's one of the best Ubisoft games I found till now according to me(best Assassin's creed Black Flag). Good graphics, great main character- Aiden Pearce, Great time pass things to do (which matters the most in a game.) Great story, Good things to do with hacking(creating huge disasters, accidents, invading someone's personal space). But i have to say its kinda like GTA+ Hacking- Many cool GTA features+ Many cool Watchdogs features. But over all it makes for a great game and deserves 5 stars right away. Can't wait for Watchdogs' and Assassin's creed's sequel.\nComment\n|\n6 people found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nGonna say just one word----\"Magnifico...\"\nByParamjit SinghTOP 500 REVIEWERon 5 January 2016\nHardware Platform: Xbox One\n|\nVerified Purchase\nI got the game in October 2015 sales for 1759/- and let me tell allu guys, this game is njust exceptionally brilliant. A total unique aspect of open world game developed by ubisoft. hats off to ubisoft for giving us such a brilliant game. the story is very rich and brilliant. The gameplay is excellent really top notch and marvellous. The graphics is just fabulous.. I definitely recommend this game to every gamer out there.\nComment\n|\n6 people found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"3.0 out of 5 stars\nVery good\nByRaghav Jollyon 3 December 2015\nHardware Platform: Playstation 3\n|\nVerified Purchase\nawesome game , very good graphics , very good. Dont get this game if u have an LCD tv , it will spoil the fun . Singleplayer mode is very good and good tasks , not that tough either , love the hacking part and stuff , and the profiling random people. Isnt like gta V u dont get to go running around shooting people . ur a good guy in this. Multiplayer isn't recommended in the ps3. Ps4 Must Buy\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nreally good game.\nByAmazon Customeron 4 January 2017\nHardware Platform: Playstation 3\nIts an interesting game, need to use mind in the missions. Just one improvement - Make the missions like Uninvited a little easier as I had to watch a video on youtube to complete it. Control and handling on vehicles is not so good. Life of player should be increased. The cars reeeeeeallly good.\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"2.0 out of 5 stars\nWatch dog 2\nByronaldoTOP 1000 REVIEWERon 18 July 2016\nHardware Platform: Playstation 4\nI have brought this game for pic because it was cheep for pc and I thought I would first see how will it satisfies me and if its4 but I didn't this game is s***. OMG I think gta VC is more better that this cra does I will buy it for pp the weather is always boring and controls are bad I recommend you to buy watch dog 2 it's a good one\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nOMG!!! A MUST BUY;)\nBysamaksh bhasinon 10 August 2016\nHardware Platform: Playstation 3\n|\nVerified Purchase\nPls buy this game for ps3 or any of your console this game is awesome and it is a new experience game I brought it for ps3 and I am like can't leave the game for hours.... I have 500 GB ps3 and it took 25 min to install without WiFi!!!! For me it is a must buy\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nAmazing game!\nBySuhas.B.Kon 18 September 2016\nHardware Platform: Playstation 4\n|\nVerified Purchase\nAmazing game!!! Delivery was as posted and expected. The one who likes stealth mode like Tom Clancy's Splinter Cell/Blacklist, this is it. You can buy it from amazon without any hesitation.\nA BIG YES!!!\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nAwsoomee!!!!!!!!but.....\nByV.vigneshon 29 September 2015\nHardware Platform: Xbox 360\n|\nVerified Purchase\nI was enjoying the game on my xbox but one day I just shared my xbox console it made the perfect scratch on my watch dogs disc 1.I am so worried how to fix it.I opened the game and get into a car and just start playing and it says the disc is unreadable try cleaning it with a soft cloth I am trying to solve this. Please don't shake your xbox 360 when your disc is in!!!!\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"4.0 out of 5 stars\nAwesome open world hacking game\nByCJ BrosTOP 100 REVIEWERon 19 October 2016\nHardware Platform: Playstation 4\nWelcome to Chicago. Where country's most advanced computer system controls almost every piece of city technology and holds key information on all of the city's residents. You play as Aiden Pearce, a brilliant hacker but also a former thug, whose criminal past lead to a violent family tragedy. Now on the hunt for those who hurt your family, you'll be able to monitor and hack all who surround you.\nThis is awesome open world hacking game. The main story is awesome. Side missions are also good. As the back cover says \"Hacking is your weapon\". You can hack almost everything in the city. You can stop traffic lights, download personal information, turn off the electrical grid and more. Graphics are good. Tech lovers and stealth killers will love this game for sure. Don't compare this game with Grand Theft Auto V (PS4). There is Version 1.05 (117 MB) patch that fixes some bugs. According to HLTB, the main story is around 18.5 hours.\nThanks for reading. Happy hacking.\nAdd me on PSN: \"jenishtrambadiya\"\nComment\n|\n2 people found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"4.0 out of 5 stars\nAwesome but Broken\nByKabiron 24 June 2014\nHardware Platform: Pc\n|\nVerified Purchase\nWatch Dogs, the game with a huge amount of hype lived upto its expectations (kind of). The game is awesome, the graphics are awesome, the gameplay is good (except for driving),etc. This game is awesome and the reasons that i have given it 4 stars instead of 5 is that it is practically broken. The game does not operate well in pc. You can search the pc problems on google. There are alot.\nSo you are better off buying the game on a ps4 or xbox one.\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nWatch dogs and Amazon - 5***** stars\nByharshpreet singhon 29 May 2014\nHardware Platform: Playstation 3\n|\nVerified Purchase\nWatch dogs is super dooper awesome. No complaints at all. Thank u amazon for an awesome video game and for an fast delivery within 2 days of release. Really it's just super awesome watch dogs and super awesome amazon. Got a special breakthrough pack edition. Once again Thanks a lot for watch dogs amazon.\nComment\n|\n4 people found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nNice and engaging game.\nBySravan Kumar Naramsettion 31 May 2015\nHardware Platform: Playstation 4\n|\nVerified Purchase\nA game that keeps you engaged through the play but for a few times. Nevertheless if you are bored of playing other games you may want to play this game the second time your life.\nI am a first time console user posting this. I loved it all.\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"1.0 out of 5 stars\nbad buy\nBySarath Chandra Repakaon 23 June 2015\nHardware Platform: Playstation 3\n|\nVerified Purchase\nNever buy it for PS3 As the graphics are pathetic May a computer with Intel graphic card has better graphics than this game\nWhy does ibis oft release such a Game when it knows that PS3 cannot handle it\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"4.0 out of 5 stars\nOnline ( Not Good )\nByDivyansh Chandelon 1 July 2014\nHardware Platform: Playstation 3\n|\nVerified Purchase\nWanted to give 5 stars but it's online is below the games dignity. It's bad to experience such a bad service from ubisoft to playstation 3 users. Watchdogs taked 4 years to be fully completed and when it launched ( no multiplayer free online mode ) is present in the game. This makes me little unsatisfied otherwise the graphics and gameplay is very amazing.\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nAwesome game ! Best optimization ever for NVIDIA card holders !\nByTryambakon 31 May 2014\nHardware Platform: Pc\n|\nVerified Purchase\nOk I use a NVIDIA card and this game is a NVIDIA optimized so it runs smooth no lag !\nOnline features are awesome and gameplay too enjoyed the service !\nThe actual thing which makes this product bad is the Uplay which causes lot of connection errors!\nExcept this everything is fine !\nThanks Ubi for this game !\nThank You !\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"3.0 out of 5 stars\nNot quite Thrilling\nByRaviTOP 500 REVIEWERon 6 August 2016\nHardware Platform: Playstation 3\n|\nVerified Purchase\nI am not quite thrilled while playing this, as i was when i saw the trailer. Quite confusing in the beggining, or maybe a little too complicated, dunno how to put it. But all my gaming life, this is one game that ive not felt like coming home to play. Maybe as the game progresses, it might get interesting.\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"4.0 out of 5 stars\nGreat gameplay.. Not much of a story..\nByRutwik Deokaron 17 June 2014\nHardware Platform: Playstation 3\n|\nVerified Purchase\nUll enjoy this game if u really like to do stuff and mess around in the open world.... The hacking just makes it better... And online multiplayer options are limited... There is no decryption and online free roam mode.... But the tailing, hacking and online races and ctos challenges are worth it.... Its a great game overall... :)\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nWatch dog is open world game like gta but it worked in diffrent way\nBygurjardineshon 11 January 2015\nHardware Platform: Playstation 4\n|\nVerified Purchase\nWatch dog is open world game like gta but it worked in diffrent way.our charachter control the city by his smartphone and can change traffic light,hack every thing which is operatable by his mobile.graphic is just wow,stunnig,gorgeus.\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"4.0 out of 5 stars\nGreat Game !!!!!!\nByPS3Feveron 22 June 2014\nHardware Platform: Playstation 3\n|\nVerified Purchase\nMaybe Watchdogs was hyped a lot by Ubisoft, so it was not as good as people thought it would be.But the game as a whole is really nice.The hacking feature is awesome and the gameplay is spectacular.It is a really good game for a hardcore gamer.\nAnd as far as amazon is concerned, as usual on time delivery!!!!!\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"4.0 out of 5 stars\nAn above average game\nByAmandeep Singhon 18 June 2014\nHardware Platform: Playstation 3\n|\nVerified Purchase\nA long awaited game that has an excellent background and concept. The game has substance in itself but is marred slightly by its comparatively tougher controls compared to other free runs like GTA 5 or even AC4. The game will slow down as you progress even on state of the art system.\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"4.0 out of 5 stars\nPretty nice but not that great!!!\nByMaheep Chhabraon 30 May 2014\nHardware Platform: Playstation 3\n|\nVerified Purchase\nNyc game but not as expected....graphics are not that great....GTA 5 is is much better in graphics...(ITS ON PS3 I DONT KNOW ABOUT PS4)!!!pretty nyc story and gameplay..!!!handling of vehicles is also not that great but still this game is unique in its own way and a must play!!!\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nAddictive N Thrilling!!!!\nByLakshya Saklechaon 29 May 2014\nHardware Platform: Pc\n|\nVerified Purchase\nWell,no doubt its the best game ever created by Ubisoft....but its challangable for others companies too....like GTA\nGreat work!!!!! I would recommend every game-lover to play this game as becz its graphic designing n game play is awesome!!!\nComment\n|\n7 people found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"4.0 out of 5 stars\nBad optimization, again\nBySachin Umashankaron 16 June 2014\nHardware Platform: Pc\n|\nVerified Purchase\nHorribly optimized PC port. Lot of stuttering even on high end hardware. Uplay is a mess, won't work half the time; especially the in game overlay, which won't work unless you've disabled all recording software with overlays like FRAPS and Afterburner.\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nFast Delivery, Great Game, Great IP\nByAngadon 16 June 2014\nHardware Platform: Playstation 4\n|\nVerified Purchase\nPretty fast delivery by amazon.in and was well packed.\nOverall a good game could have featured a better graphics for the PS4 version but then it has PS3 and 360 backward compatibility so I'm not gonna grudge about that.\nWorth buying.\n:)\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"4.0 out of 5 stars\nReceived it from nextworld seller with good packing. The game is not bad\nBySaurabh K. N.on 24 September 2014\nHardware Platform: Playstation 4\n|\nVerified Purchase\nReceived it from nextworld seller with good packing. The game is not bad. Graphic is quite impressive. Though gameplay is bit repetitive but i personally liked it after few days of gaming. Disk is running good\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"4.0 out of 5 stars\nGood game with some pros and cons..\nByAjay Rajputon 25 October 2015\nHardware Platform: Pc\n|\nVerified Purchase\nGame is good but... it has some good things and bad things too...\nPros. 1. Grapics are nice... not great .. 2 running smooth on my gtx 970.. 3. Small patch to update game.. 150mb... 4. Graphics looking awesome in rain time... im using E3 original mod...\nNow some cones which irtates me..1. Graphics are not that great... cars not looking real look like plasticy .. 2. No crouch functio which annoying me..auto crounch during mission... 3. No in car shooting.. and its funny. Because there lot of car chase missions.. 4. Repetitive looking mission... My Overall Rating 7/10...\nComment\n|\n3 people found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nmarve;lloussssss\nByPranavasrion 30 May 2014\nHardware Platform: Playstation 4\n|\nVerified Purchase\nthis game is simply amazing. got t delivered today i.e. may 30th. and was surprised at once when i saw that i got the special breakthrough edition. i got 1 ulc instead of 3. :( but the games awesome :o :). must have for anyone.\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"3.0 out of 5 stars\nMediocre: Left me wanting more.\nBySrivasTOP 1000 REVIEWERon 7 August 2014\nHardware Platform: Playstation 3\n|\nVerified Purchase\nThe game gets repetitive after the first few missions. All you have to do is hack into stuff on the CTOS network. I thought it would be like GTA V with hacking, but I was terribly disappointed. You'll like the game just as a casual means to get away from daily life, but if you're a serious gamer, I'd advise you to stay away from this title.\nComment\n|\n3 people found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nAmazing game and fully impressed with Amazon's service!\nBySankalpon 17 June 2014\nHardware Platform: Xbox 360\n|\nVerified Purchase\nThis is best game I've ever had after Assassin's Creed and Tomb Raider 2013. The only thing these versions (Xbox 360 and PS3) lack is online co-op and decryption mode (team mode). Otherwise this is amazing game!\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"4.0 out of 5 stars\nBrilliant game worth the price\nByUser2107on 19 June 2014\nHardware Platform: Pc\n|\nVerified Purchase\nThe PC version runs great if you have a capable rig and looks fantastic. Story is a bit weak but the gameplay in general is extremely fun. The online component of this game is unique and will you give you quite a bit of re-playability. But there are small bugs which I'm sure will be patched. Overall a great game but nothing very memorable.\nComment\n|\n3 people found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nThrilling!\nByrajeev singhon 17 June 2014\nHardware Platform: Playstation 3\n|\nVerified Purchase\nExcellent graphics coupled with excitement of hacking everything you want, makes this game addictive. However dodging police is more difficult than in GTA V. In all a good & compact gaming experience.\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"4.0 out of 5 stars\nScope for improvement\nBytoofast1227on 9 June 2014\nHardware Platform: Xbox 360\n|\nVerified Purchase\nThis game borrows many elements from Splinter Cell, Assassin's Creed and GTA. Though there are some parallels, it feels much like Splinter Cell and Assassin's Creed than GTA. It differs from GTA by a great deal in the tone of the story, the way the story is told and how it is executed.\nWatch Dogs has a lengthy campaign with a not so interesting story set to a Assassin's Creed like tone with a gameplay style that makes you feel like you are playing an open-world version of Splinter Cell sans Sam Fisher. Hacking sets it apart from the aforementioned games. Besides adding new kind of weapons to the catalog, it let's you plan the execution for achieving the objective. It's also a bit boring if you had any background in computer security. You don't get to fish for vulnerabilities and be clever in so many ways after all. Also, it feels like Watch Dogs doesn't explore the vigilantism part as much as it should.\nThe open world elements is another place where the game differs significantly from GTA V. You don't get to do much in Watch Dogs. Mini-games are a great value add though (esp. NVZN). I haven't explored the multiplayer part of the game at this point.\nOverall, Watch Dogs gets positive points for Splinter Cell like variety, original ideas like hacking and vigilantism, mini-games and mechanics. And negative points for uninteresting story, not so useful open world and undeveloped ideas. That would put it at 8/10.\nComment\n|\n2 people found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"4.0 out of 5 stars\nHacking is our weapon\nByAdwaithon 18 August 2014\nHardware Platform: Pc\n|\nVerified Purchase\nThis game is very much intresting that this game may become a reality in the future\nComment\n|\n5 people found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"4.0 out of 5 stars\none of the influential nd most hyoed title of 2014\nByOmkaron 15 June 2014\nHardware Platform: Playstation 4\n|\nVerified Purchase\nNt completed the game...so this review wnt be bout the story....the overall gameplay is gr8... its easy to get accustom in combat if u have played splinter cell ...nd the hacking mechanism is easy nd makes sense most of the time... the story missions are great...but I am addicted to its multiplayer...especially free roam...most things are taken frm gta 5....but if u really want to enjoy this game...my advice is dnt compare it to gta 5... although the world is not as vast as gta 5 ...but evry thing is detailed ...graphics are amazing on ps4 nd slighly better than high on pc .. fps hardly ever drops nd is quit smooth.. overall great game...but most probably nt the best game of 2014\nComment\n|\n2 people found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"3.0 out of 5 stars\nGood delivery by amazon!!!\nByAnkit Kumaron 7 May 2015\nHardware Platform: Pc\n|\nVerified Purchase\nHorrible shuttering! Not a game for entry level pc!\nAll ubi soft games are crap in optimization but they all are awesome too!\nI would not suggest wasting money on this and other ubi games instead buy other good games or lower ur graphics settings if u r ok with uggly graphics!..\nUbisoft=nvidia ≠ AMD\nnot for AMD users like me :P\nComment\n|\n2 people found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"4.0 out of 5 stars\nAwesome Game ! Really Enjoyable\nByAkshayon 24 July 2014\nHardware Platform: Xbox 360\n|\nVerified Purchase\nVery nice graphics , this game makes a remarkable hacking arena on our console and Ubisoft has made a good effort to make this game ! But the story concept of the game is a bit DULL (Boring) . But FREE roaming in the game is the real fun . -Hacking the security cams all around the city\n-Hacking the Bank Accounts of the people\n-And all the graphics supporting the missions 1\nAll these points make the game a 4 star rated game by me !\nComment\n|\n2 people found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"1.0 out of 5 stars\nOne Star\nByAliya khanon 31 December 2015\nHardware Platform: Xbox 360\n|\nVerified Purchase\nEvery time my son plays the game stops in every five min !!!! Can u send some one I want to return the watch dog cd and take the refund\nComment\n|\nOne person found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"4.0 out of 5 stars\nAwesome game,only fell short of the hype it received pre-release\nByRahul Bhamraon 28 November 2015\nHardware Platform: Playstation 3\nOther than not being able to jump,not able to melee attack unless prompted and not able to shoot while driving, this game is awesome!Despite people hating the protagonist Aiden Pearce,I actually think he's a decent protagonist.\nThis game looks absolutely fantastic on PS4/Xbox One.PS3/Xbox 360/PC have decent graphics.I played this game on PS3 and for a 2006 console,this game looks pretty good.Don't listen to those who say ps3 and x360 graphics look s***ty,because it doesn't.\nSure,this game fell just short of the hype,but a decent effort by Ubisoft.This game was different and good.\nYou won't regret buying this now since the price has dropped.\nComment\n|\nOne person found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"3.0 out of 5 stars\nAn average Game\nByM.D.Sabari Giri Nathon 10 June 2016\nHardware Platform: Playstation 3\n|\nVerified Purchase\nThis game is ok.The problem is with the graphics,the graphics are worse than a ps2 game...Though the Hacking element in this game should be appreciated..Overall the gameplay is Average and dull...But still it is worth a buy only for hacking mini game features..\nComment\n|\nOne person found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nAmazing Open World Game\nByJatin Kapadiaon 9 June 2014\nHardware Platform: Playstation 3\n|\nVerified Purchase\nHacking is your weapon, Ubisoft has built a great game and lives up to the hype created around it. Too sad few gamers are comparing it with GTA V and Assassin's creed when its clearly not. Besides a great campaign there is a lot to do in the Open World. But the best part is Online Multiplayer. 1v1 Online Hacking, Tailing happens so seamlessly that you don't even know when a player entered your game.\nComment\n|\n5 people found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
}
]
}
