
{
"keywords":[
"1",
"2",
"3",
"4",
"5",
"6",
"7",
"8",
"9",
"10"
],
"reviews":[
{
"review":"5.0 out of 5 stars\nFantastic storyplay!! I'm loving it!\nBysundaron 14 January 2017\nThe story is where this game steals my heart!! I know people are talking bad about the graphics, but once you start to play for a while you'll think that this game looks good!! Remember, You'll miss a great chance to play a game like this!! You'll be mesmerized by the story play !! This has to be in my favorite games list!!\nComment\n|\n2 people found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"2.0 out of 5 stars\nGTA San Andreas even better.\nByKiran Kishoreon 14 November 2016\nEven GTA Sand Andreas is better than this.\nRepetitive missions man.. do u wanna play it? Buy this if the price comes down, but certainly not at Rs.2500. Buy Watch Dogs 2 instead.\nThis game has neet this person, meet that person, shoot 3 guys mission complete. Drive here. Drive there. See this scene. See that scene. That's it. Weapons are few, there's not even a motorcycle, and story is quite old.\nI'm not gonna suggest anyone to buy this.\n1 Comment\n|\n11 people found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"1.0 out of 5 stars\nUtterly Pathetic\nByDr JAskaran Singhon 14 November 2016\nVerified Purchase\nBeing a mafia franchisee fan, something is off about this game besides from graphics. Definitely no more pre orders from now on.\nComment\n|\n3 people found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"1.0 out of 5 stars\nOne Star\nByRaman Narulaon 18 October 2016\nOh my God its 9 rs off after buying this i will become rich .\nComment\n|\n14 people found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"4.0 out of 5 stars\nNice game\nBySun Palaon 8 October 2016\nVerified Purchase\nThe game comes with 6 discs , still 5-6 gb files are to be downloaded via steam client in order to play the game (total size of the game on pc is 40.6 gb) . The game also includes New Boadeaux street and map guide along with family kick back pack (preorder bonus).\npros;-\n1. Splendid graphics.\n2. This is the first truly open world Mafia game.\n3. Soundtrack\ncons;-\n1. Random crashes.\nSystem config used to test the game is as follows;-\namd fx 8350\ngtx 660 2 gb ddr5\n8 gb ram\n1600x900p resolution\nAlthough the game runs just fine with almost no fps drops, the game was patched by 2k (on 9 oct patch size= 1.2gb) it is no longer capped at 30 fps.\nComment\n|\n15 people found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nBuy it if you're a mafia fanboy. Otherwise you might want to wait.\nByAlphaon 16 October 2016\nVerified Purchase\nThe game :\nPros:\n1) The story. PERIOD. No other reason is needed to buy this game.\n2) Setting. The game is set in the 60s and they have captured the time period quite well. Plus they've captured the racial tension at the time quite well. And yes, you can kill some KKK members.\n3)Shooting and driving feels violently satisfying. Hearing the roar of American muscle while you shoot some random gangsters with your Tommy gun, priceless!\n4)Vito is back and boy does it feel good to see an old face! Yes, Joe's disappearance is explained.\n5)The massive open world is just so pretty to look at.\nThe cons:\n1) As much as I hate to say it, this game is a s***ty console port and is plagued with numerous graphical bugs. 30 fps cap, blurry/muddy look etc. Patches have removed the frame limit, but even still people with gtx 1080s are barely touching 60fps. My recommendation is to run the game at 30 fps.\n2)Before you can get to a story mission, you have to do these repetitive mini-missions, which is pretty much rinse and repeat.\n3)The world is not as immersive as mafia 2, remember opening windows, shoe shining, buying food from a hot dog vendor, changing clothes, customizing your vehicle? These are simply not there in mafia 3. However, the game developers have promised to release an update allowing you to customize your characters clothes in the near future.\nThe package : 6 dvds, one key for the game, one key for the pre-order dlc and a massive map of New Bordeaux. After installing the game you'll still have to sit and install 6GB from steam, esp because 2 patches have been released for the game.\nVERDICT: If a story is more important to you, more important than 60fps then buy the game. I know it's not great, especially in 2016, but trust me it won't spoil your experience.\n7/10. - 3 for the optimization issues, I was really looking forward to playing this and they let my expectations down.\nComment\n|\n11 people found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"1.0 out of 5 stars\nWorst pc port of a game ever.\nByShekhar tyagion 6 March 2017\nFormat: Video Game\nThe developers didn't port this game right from the console and rushed it and ruined it.It could've been so much better.\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nBest\nByPehlajon 9 March 2017\nFormat: Video Game\nVery good game better than mafia 2 graphics awesome juat best. At 1.7k its a fine product\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"3.0 out of 5 stars\nIt is a not so challenging game and often too easy even with the most difficult of settings\nByShashank Chandraon 13 October 2016\nVerified Purchase\nInitially the game wasn't working and I had to contact amazon to initiate a refund. I bought it then off of G2A and heres what I think-\nOwning a GTX1080, even on ultra settings(MSAA OFF) at 4K I am not able to get a smooth, visually pleasing game performance. Optimal was 1080P at 60FPS with MSAA ON.\nThe game stutters occasionally.\nIt is a not so challenging game and often too easy even with the most difficult of settings.\nNo fast travel feature hence it can take ages traveling across the map for something like a 5 min objective and then back again to progress further.\nDO not buy the game unless you're a die hard Mafia fan. Wait for the prices to drop and then buy it as it isn't worth it just yet.\nI'd recommend a GTX 970 or higher for optimal game-play.\nComment\n|\nOne person found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nFive Stars\nByAdrian clayon 26 January 2017\n1 of d best game with superb graphics n gameplay\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"2.0 out of 5 stars\nVery average game and terrible PC optimization\nByUser2107on 13 October 2016\nThis is an absolutely terrible PC port. Very bad optimization and it feels like they rushed to release the game without finishing it. Using a GTX 970, I have to drop down to medium or even low settings to get a solid 60fps. The textures are awful and very blurry, it sometimes gets very distracting and the AI is also hilariously stupid, it makes dying in this game so tough even on the highest difficulty. There are also quite a few game-breaking glitches I have come across which leads to crashes or restarting.\nThe core gameplay is also a bit repetitive and gives the player no incentive to get anything done enjoyably and the world is empty and nothing like other open world games with very few side quests and activities. But the shooting and driving feels solid and really well done.\nThere are only two reasons this game deserves two stars. The soundtrack is amazing and totally fits the era that the game is set in and the story is excellent and really surprised me. The acting is superb and you can tell a lot of effort was put into this. Apart from this there isn't much to the game, it's not innovative and does many of the things other open world games like GTA does but worse. Mafia 2 is overall a much better Mafia game, this one feels like a huge step backward for the franchise sadly.\nComment\n|\nOne person found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"2.0 out of 5 stars\nPathetic\nByAmazon Customeron 6 January 2017\nMafia 2 has better graphics and details than this. Mafia 3 is full of bugs and glitches.\nComment\n|\nOne person found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"3.0 out of 5 stars\ngameplay was old felt like playing GTA Vice city(For example - A fall from ...\nByA R.on 19 October 2016\nVerified Purchase\nAverage game . Story was same old revenge plot , gameplay was old felt like playing GTA Vice city(For example - A fall from 10 m will kill you and driving your car into the water also kills you and then an alligator eats you Huh that was new).Characters were all boring except Donovan man was cheery as hell.If this game costs Rs.2500 and Watchdogs cost Rs.930 then it's definitely screwing over customers(Literally).\nComment\n|\n3 people found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nFive Stars\nByGyanateet Duttaon 12 October 2016\nVerified Purchase\nThis game is amazing!!! I love the series\nComment\n|\nOne person found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"4.0 out of 5 stars\nGood Game\nByMDon 7 October 2016\nI played the early access of this game (on PS4) and I would say it was very impressive. Good story, good graphics and very smooth. Driving was bit hard for me, rest everything was fine. BTW if you throw someone in water a crocodile may come and eat him up :P. I would recommend Mafia 3.\nComment\n|\n2 people found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"1.0 out of 5 stars\nOne Star\nByJeffyon 25 December 2016\nking of bugs and its a big dissappoitment ot fans\nComment\n|\nOne person found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"4.0 out of 5 stars\nFour Stars\nByNeeta Boroleon 7 October 2016\none of the best open world game.\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"1.0 out of 5 stars\nBad pc port....\nByHarry sidhuon 7 October 2016\nReally bad Port! The game is locked at 30 fps, frames dropping down to 28-29 while driving. Textures and text looka blurry. Before starting the game, you have a choice to turn on auto aim. You can only set the Graphics settings in the launcher and after the long intro cutscenes. No options menu in the main title menu. There are sound glitches when setting your audio to a higher sample rate. Bad mouse smoothing in menu, but quite decent in game.There is an FOV option but increasing it somehow decrease input text size.\nI'm really hyped for this game but they sabotaged the PC version (maybe gave us a beta build or something). Can't play for more than 2 minutes with the mouse and keyboard as it gives me migraine. They should have delayed the PC version when they clearly know it's not ready yet. Feels like playing afully priced Early Access game with Season Pass and micro DLC's and no support for sli. Developers promised patch. Game is crashing..\n1 Comment\n|\n7 people found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"1.0 out of 5 stars\nOne Star\nByMartin Deogamon 29 October 2016\nVerified Purchase\nbekar aur ghatiya\nComment\n|\nOne person found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"1.0 out of 5 stars\nNot happy with discs\nByAmazon Customeron 13 October 2016\nVerified Purchase\nThis game with 6 disc but after 1disc insert and activate the game on steam after this game going to download in steam of 40gb so other 5 disc what kind of use...\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
}
]
}