
{
"keywords":[
"1",
"2",
"3",
"4",
"5",
"6",
"7",
"8",
"9",
"10"
],
"reviews":[
{
"review":"5.0 out of 5 stars\nCoolest AC game!!!!\nBykarunakaran thiagarajanon 20 February 2017\nHardware Platform: Playstation 3\n|\nVerified Purchase\nAssassins creed black flag is one of the best assassins creed game I've ever played!!!!!.The hero is just amazing and the graphics are mind blowing.Its really fun playing this and the best comes in the ship levels!!!!The story never gets boring from the very beginning to the end of the game and all the characters in the game were unique and fascinating.It is a must play for action-adventure addicts,so don't think about it just buy the game and enjoy!!!!\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"1.0 out of 5 stars\nOne Star\nByAmazon Customeron 28 February 2017\nHardware Platform: Pc\n|\nVerified Purchase\nNot working . Always asking for update\nComment\n|\n2 people found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"1.0 out of 5 stars\nPlease check the compatibility with OS & graphic card.\nByAmazon Customeron 30 November 2016\nHardware Platform: Pc\n|\nVerified Purchase\nPlease check the compatibility with OS & graphic card.\nComment\n|\nOne person found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nFive Stars\nByAditya karapurkaron 2 March 2017\nHardware Platform: Pc\n|\nVerified Purchase\nGreat game\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"4.0 out of 5 stars\nFour Stars\nByPixelon 27 June 2016\nHardware Platform: Pc\n|\nVerified Purchase\nAwesome gaming!! Love this game..\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"1.0 out of 5 stars\nits more comfortable\nByAmazon Customeron 12 February 2017\nHardware Platform: Pc\n|\nVerified Purchase\nfirst of all lemme tell you that im a big fab of assassin series. i bought this game and thus my problems started. indtalled the game and after that ubisoft server was continuosly down dunno for what reasons. then i re installed ubisoft but instead of running the game it started downloading the game inspite of me having been already installed the game. i chose the locate game directory still nothing would happen. plz do not buy ubisoft games .instead buy it from steam .. its more comfortable\nComment\n|\nOne person found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"1.0 out of 5 stars\nGiving false promises. Ordered for my son. He ...\nByVivekon 6 April 2016\nHardware Platform: Playstation 3\n|\nVerified Purchase\nGiving false promises. Ordered for my son. He was excited to receive the statue and other goodies promised along with the game cd. Received only the cd and no explanation about the rest. Frustrated, I am returning the same. Either deliver what you publish or correct your features and details section.\nComment\n|\nOne person found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"1.0 out of 5 stars\nDisappointed!\nByArindamon 16 March 2017\nHardware Platform: Playstation 4\n|\nVerified Purchase\nThe delivery was right on time, but as the picture says \"60 mins of exclusive gaming\" wasn't given along the game. Also, the game came in Arabic Subtitles, which could be switched to English. Still it was a bummer that such version came to me.\nAlso didn't get my UPLAY Passport Leaflet. Thus, can't activate the game so can't play it either.😑\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"2.0 out of 5 stars\nNot for laptop users\nByAmazon Customeron 24 January 2017\nHardware Platform: Pc\n|\nVerified Purchase\nI have a latest Dell Inspiron laptop with windows 10 and still the games runs quiet slow. I adjusted the lowest graphics settings for best performance but still it gives me 1/4 th of the real speed . Besides that game is cool\nbut you won't enjoy it in a laptop\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"1.0 out of 5 stars\nIt does not work in Xbox purchased out of India ...\nBySurinder Kauron 14 December 2016\nHardware Platform: Xbox 360\n|\nVerified Purchase\nIt does not work in Xbox purchased out of India . The seller does not accept the return at all.\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"1.0 out of 5 stars\nOne Star\nBydalviron 16 June 2015\nHardware Platform: Playstation 3\n|\nVerified Purchase\nSuch a boring gane\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nBest AC So far.\nByAkhil Polaon 27 January 2016\nHardware Platform: Playstation 4\nThis has to be the best AC game for the next generation console so far ( Syndicate is pretty good as well)\nWe all knew Unity was a disaster at launch.\nHaving played Unity as well, I can say if you had to choose between Unity and Black Flag , ALWAYS go for Black Flag.\nThe open world map is pretty huge. It takes a lot of time to travel all around the West Indies.\nI always loved the pirate themes i.e. POTC movies , One Piece anime. This game lets you like the life of a pirate.\nThis game has content for more than 100 hours easily.\nThe side missions are an absolute blast. The main story is pretty good as well.\nBut nothing comes to close to those naval battles. Fighting ships with your Jackdaw is pretty amazing.\nThe fighting is better than Unity hands down.\nThe graphics are pretty amazing.\nThe game is pretty cheap IMO. You can find better deals if you buy the digital version. The PlayStation Store usually has some deals.\nKudos to Ubisoft for creating such a brilliant game which is still popular more than 2 years after its release.\nComment\n|\n5 people found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"1.0 out of 5 stars\nOne Star\nByAmazon Customeron 26 October 2016\nHardware Platform: Pc\n|\nVerified Purchase\nWorst delivery from delhivery\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"1.0 out of 5 stars\nit does not activate in my\nByAmazon Customeron 8 January 2016\nHardware Platform: Pc\n|\nVerified Purchase\nit does not activate in my laptop\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"4.0 out of 5 stars\nA very beautiful game from the Assasins Creed franchise that presents us ...\nByPathikrit Ghoshon 5 May 2015\nHardware Platform: Pc\n|\nVerified Purchase\nA very beautiful game from the Assasins Creed franchise that presents us with a lovely world with tons to do. The story is a little weak in my opinion but the naval battle in this game more than makes up for it. I would suggest any fan of the assasins creed series to go for this gam. You will not regret it.\nAs for the delivery and packaging, Amazon did a fantastic job.\nComment\n|\n3 people found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nFive Stars\nByAnonymouson 27 March 2017\nHardware Platform: Pc\nAwesome ubisoft gAme\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nThe game's veryyyyyyyyyy good!\nByOhm R. Charanon 12 April 2014\nHardware Platform: Pc\nThe game's very good and if you don't believe me see the other reviews and you will know and don't believe the 1 star reviews as they are just frustrated the game didn't work on their pc as the game requires high graphics, fast processor and high ram to work in full resolution. The game has many weapons like the previous Ac3 game and interesting and adventurous main missions and side missions like naval contracts, assassin contracts, underwater exploring,etc. which are amazing. And if that's not enough you can explore the whole Caribbean sea with the Jackdaw and fight and hunt down ships, board them for fun and use the resources obtained for upgrading the Jackdaw or including it to our own fleet of ships and there are many islands for us to explore. The game's story is strong and very finely detailed and will keep you hooked to it until it gets completed. The present day story is not so much interesting and the only reason Ubisoft kept it was to continue the present day story of the previous games. The only thing you will find a little interesting is hacking computers of the other abstergo employees. And back in the main game the most important Thing is that is it has been rated as the best pirate game ever made so its recommended for you to buy it and a must for every assassin's creed series lover.\nComment\n|\nOne person found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nPirates of the Caribbean\nByCJ BrosTOP 100 REVIEWERon 20 October 2016\nHardware Platform: Playstation 4\nIt is 1715. Pirates rule the Caribbean and have established a lawless pirate republic. You are a young captain named Edward Kenway. His exploits earn the respect of pirate legends like Blackbeard, but draw him into an ancient war that may destroy everything the pirates have built.\nThis pirate themed Assassin's Creed is too good. There is massive caribbean to sail. There are gorgeous and unique islands to explore. There are tombs to raid and much more to do. Black Flag is all about embracing freedom and carving your own path through the world. Naval battles are awesome. You will love sailing the ships for sure. The main story is very catchy. Side missions are also good. This game was launched in 2013 but the graphics are really next gen. I also have Assassin's Creed: Syndicate (PS4). But i will definitely say that Black Flag is better than Syndicate. There is Version 1.04 (2.314 GB) patch that fixes some bugs. According to HLTB, the main story is around 22.5 hours.\nThanks for reading. Happy gaming.\nAdd me on PSN: \"jenishtrambadiya\"\nComment\n|\nOne person found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nAwesome\nBySandeep Mahendraon 28 August 2015\nHardware Platform: Playstation 3\n|\nVerified Purchase\nIts a great a game all the assasins creed are best . Now the delivery i chose two day delivery and it reached in 14 hours not even a day that was really nice by zupitex. The storyline and graphics both are good. So i will give it\nGameplay-10\nGraphics-10\nStoryline-9\nBuy this a great pick for AC lovers\nComment\n|\n2 people found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"4.0 out of 5 stars\nEpic Game !\nByVaibhavon 11 December 2014\nHardware Platform: Pc\nAssassin Game + Pirate Theme + Naval Combat + Stunning Visuals = Black Flag !\nThis game is simply epic. The visuals are stunning and very much improved over it's predecessor (AC III).\nNaval Combat - The best part of this game is naval combat .You can upgrade your own ship & can ride with it wherever you want , you can attack other ships for loot and can take their crew.\nStory - Story is above average , Not the best but certainly not the worst.You will have no problem with it.\nGameplay - The Gameplay is awesome , Naval combat is Excellent , Open world which is designed beautifully by Ubisoft. There are plenty of things to do other than story missions. Combat is great & Variety Of Missions.\nI loved the Soundtrack also .\nThe presentations is awesome & you will love pretty much everything about this game , fully enjoyable.\nComment\n|\n5 people found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nOne of the best ever made\nByaddi kohlion 2 October 2014\nHardware Platform: Playstation 3\nThis game is a total package, this game is worth the price.The main character is pretty promising and talking about the story , it talks about a pirate turned assassin and thats what makes the story special. The graphics and the gameplay both are pretty smooth.Ac4 also has its ultimate naval gameplay which is pretty enjoyable. Go for it\nComment\n|\nOne person found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nGreat buy!\nByGautamon 25 January 2015\nHardware Platform: Playstation 4\n|\nVerified Purchase\nI've never liked the Assassin Creed series prior to this title, but this setting (The Caribbean) was irresistible. I haven't had any cause to regret this purchase and this has become one of the very few titles that I finished in one sitting. Worth the money!\nComment\n|\nOne person found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\ngreat game 9.5\\10\nByaayush kumar chaurasiaon 24 March 2016\nHardware Platform: Playstation 3\n|\nVerified Purchase\nThis game is a must-have for the ps3 I loved every moment of mowing down British and Spanish soldiers and plundering ships, though you will start feeling disappointed for the first 4-6 missions, but will soon love it after completing the main 6 missions consisting of you disguising yourself as Duncan Walpole to freeing yourself with adewale. The story is great too and of course the huge variety of missions and activities I'd give this game a 9.5\\10 pros :- everything pirate and assassin\nCons :- frame rate drops in Havana for the ps3 super slim and the stupid be online to access the fleet and getting additional 60 min gameplay\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"4.0 out of 5 stars\nGood game\nByGauresh Kapooron 13 April 2016\nHardware Platform: Playstation 4\n|\nVerified Purchase\nAwesome game. Best of all assassins creed series. Also good delivery by Amazon but the cover of the game had another language. Don't worry gameplay is in English\nComment\n|\nOne person found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nOne of best game ever\nByHari govindon 1 September 2016\nHardware Platform: Pc\n|\nVerified Purchase\nOne of the best games of all time !!!!!\nGreat graphics ang gameplay.I can say one thing for sure \"you are gonna spend hours playing this game\"!!!\nComment\n|\nOne person found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nBest game ever played\nByCustomer 404on 26 October 2016\nHardware Platform: Pc\n|\nVerified Purchase\nThis is the most amazing game i have ever played. Fantastic graphics, amazing story, its like living history. Sailing across seas in the Caribbean, fighting on land and sea is really really breath taking. I was expecting it like ac3 but its totally different, really really good. The night time sail, tail and kill looks so cool. I have high end pc so graphics were smooth all across the game at 1080p, 27inch 144hz. Best game ever. Crysis and every other fps stands no where near this game.\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"4.0 out of 5 stars\nsooooooooooooooooooooooooooooooooo nice..\nBysurya prakashon 28 September 2015\nHardware Platform: Playstation 3\nsooooooooooooooooooooooooooooooooo nice....after a long time after ac revelations this isa superb story...graphics are more than expected.....naval gameplay is pretty much fun.. shoudl buy ..my fv order of ac is: ac 1, ac 2 , ac revelations, ac4 and ac 3.\nthis game is a worth price to buy.. tnk u amazon ...ac is leading to a next gen games\nonline is very pretty fun.......lots of weapons to play...dont think to buy.. go and buy this....dont miss this.and this is also a big game\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"4.0 out of 5 stars\nYa its a good game having a strong storyline and graphics are well ...\nByganeshkaranon 14 June 2015\nHardware Platform: Playstation 3\n|\nVerified Purchase\nYa its a good game having a strong storyline and graphics are well improved comparing previous series. If u like pirates kind of genera u will love this game. Apart from main storyline side missions are also fascinating. U can dive underwater to find treasure and lot more.\nI gave 4 stars because game looks somewhat slow. U can't play it through out the day. U will get bored.\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"4.0 out of 5 stars\nChange of heart from selfish pirate to the creed of assassins\nByTanveer Mamunon 10 June 2015\nHardware Platform: Pc\n|\nVerified Purchase\nIt's fresh, blends well with the historical period of piracy. Different outfits and great combating style and capture and plunder ships and forts. The plot of the game tells us about the pirate turned assassin Edway Kenway along with the present day attempts of assasins in finding the schemes of templars in abstergo entertainment using the DNA sample of the deceased Desmond Miles.\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nBest Graphics For Last gen Consoles\nByAmazon Customeron 7 October 2016\nHardware Platform: Xbox 360\n|\nVerified Purchase\nThis game is very hard but I complete this after 3 months lot more cutscene and missions and storylines\nComment\n|\nOne person found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"4.0 out of 5 stars\nNice game but I have a problem in online because ...\nByAjay Kumaron 14 May 2015\nHardware Platform: Pc\n|\nVerified Purchase\nNice game but I have a problem in online because it's asking for update. When I try to connect to online.It's ask for updates I don't know what to do with this. ...can any one help i have been installed this game three times but it's still ask for updates to play in online for multiplayer or single player\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nAssassin + Pirate + Own Ship+ The Sea Songs + Pillaging = Mind-The-Blowing!!!\nByKiran Kishoreon 29 July 2014\nHardware Platform: Pc\n|\nVerified Purchase\nGuys, apart from some minor glitches here and there, the game is a MUST play!\nBy far the coolest AC of all! Especially when you do not have to play that stupid idiot Desmond!\nBuy a controller like Gamepad F310-AP and you are all set for a great experience!\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nI felt the game is super entertaining. Playing as a notorious pirate Edward Kenway ...\nBySouvik D.on 27 February 2017\nHardware Platform: Pc\nI felt the game is super entertaining. Playing as a notorious pirate Edward Kenway was fun. Plundering ships, destroying sea side fortress, searching treasures by analyzing the treasure maps and other side games were also absolute delight.. delivery was also satisfactory..\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nAmazing game!\nByShubhodeepon 23 May 2015\nHardware Platform: Playstation 3\n|\nVerified Purchase\nAmazing game!!! Yea, tits n bits of gameplay & player control could do with some improvement but the free roam, ship battles & the music is epic!\n\"Aye, tis a pirate's life for me\" :D\nAnd thx amazon for making the delivery in only three days.\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nDon't Miss Such a Step Benchmark Title\nByAmazon Customeron 7 June 2016\nHardware Platform: Playstation 3\n|\nVerified Purchase\nDon't Miss The Game at all. The Game is itself a benchmark that is pushing the whole series in a new direction. All Tactics are improved more than\npredecessor games.\nLove Assassins Creed and love the whole series.\nThank You Amazon.\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"2.0 out of 5 stars\nSlow on laptop\nByAshrivon 13 August 2016\nHardware Platform: Pc\n|\nVerified Purchase\nThis game is not good for laptop users.All the graphics take a lot of time to load and then it is always a very slow progress.Since the game is quite big so you need that you are completing game and playing them at ease but since you play it on laptop that's why it is not worth it.\n1 Comment\n|\n3 people found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nThough food for though --- Assassin creed series is like avoid one and play one\nByvikason 25 February 2016\nHardware Platform: Playstation 4\nA must Play for Xbox 360 n ps3 gen ...... Though food for though --- Assassin creed series is like\navoid one and play one .... Must Play AC2 ...avoid AC3 ......must play AC4 ....avoid AC unity....and now must play AC : Syndicate.\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nGrrreeeaaaattttt\nByLav Chaudharyon 11 July 2014\nHardware Platform: Xbox 360\n|\nVerified Purchase\nIts the best title in the series , amazing graphics , one of the best graphics game available for xbox 360 even the story line is amazing which take you to the journey of a pirate to become an assassin and rule the seas.\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nAmazing graphics. Awesome music\nByNBon 31 July 2016\nHardware Platform: Playstation 4\nImmensely satisfying and interesting gameplay. Superb naval combat. Ocean diving. Sailing. Upgrading. Amazing graphics. Awesome music. Will get deeply engrossed and tied up with the game for a long time. Played on PS4.\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"4.0 out of 5 stars\nGraphics problem\nByMukesh guptaon 11 August 2016\nHardware Platform: Xbox 360\n|\nVerified Purchase\nGraphics is not up to mark on x box 360 overall pit is good\nComment\n|\nOne person found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\ndont buy this games from amazon\nByNarendaron 31 July 2015\nHardware Platform: Playstation 3\namazon taking 200rs extra on this game i have from other its only 999rs.now the game graphic is amazing if u have intel hd graphic card so my experience is awesome the charcter is joining templars group its different\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nFive Stars\nByAnuron Mitraon 17 April 2015\nHardware Platform: Pc\n|\nVerified Purchase\nBrillianto game by ubisoft. this is what you call a game.\nComment\n|\nOne person found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"4.0 out of 5 stars\nCool story and gameplay makes this a great edition\nBySiddharth Saikiaon 21 December 2016\nHardware Platform: Playstation 4\n|\nVerified Purchase\nA very good game with a good visual experience, mechanics, gameplay and story. I have been a great fan of the series specially Assassins Creed 2 which made me a lifelong fan of the franchise.Must play for gamers.\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nmuch better:)\nBySkywalkeron 19 March 2015\nHardware Platform: Xbox 360\nfantastic game, ubisoft has surely realized all its mistake and has improved it like-\n1) the free roam in the previous game was a bit boring. now you are a captain of a ship so you roam around the carriben seas. if you don't like sailing a ship you may fast travel if the location is discovered.\n2) the story line which was in assassin creed 3 was a bit complicated, you would have to play it twice to understand so now they have made it a simple and sweet storyline.\n3) in the previous assassins game there were only contracts on (land) as you were only in one location but now you also have navy contracts.\n4)the graphics are improved.\nthat's all the improvement in the game and there may be some more but you reading this review from a assassins creed fan for sure.\nComment\n|\n2 people found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nEpilogue to AC III starts with Captain Kenway,\nByDipen Enzo Gabrielon 3 April 2015\nHardware Platform: Playstation 3\n|\nVerified Purchase\nEpilogue to AC III starts with Captain Kenway, a Pirate who poses as an Assassin in the beginning however most of the times you are on water sailing and upgrading Captain Kenway's Ship the JackDaw\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nIf you Obey All The Rules Then you WIll Miss All The Fun\nByhrithikrajon 9 October 2014\nHardware Platform: Playstation 3\n|\nVerified Purchase\nThe game is awesome one of the best among its series .The carebian world is amazing ..the new age of piracy :) Overall it is one of my favourate action adventure title i have ever played....\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nFive Stars\nBysubrata boseon 15 November 2015\nHardware Platform: Playstation 4\n|\nVerified Purchase\nGreat game :)\n1 Comment\n|\n2 people found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"4.0 out of 5 stars\nDiscover Game!\nByThangarajon 6 July 2014\nHardware Platform: Playstation 3\n|\nVerified Purchase\nGood graphics and perfection of animation in this game. I and my nephews and sons were played together.\nDefinitely i recommend to my friends to buy this game.\nThankyou\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nGreat Game!!!\nByAjay Raikwaron 23 June 2014\nHardware Platform: Pc\n|\nVerified Purchase\nIf you have a good gaming PC, you won't stop playing it. Such a huge and adventurous game. The game is beautiful. Ubisoft has raised the bar for Graphic and open world gameplay.\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nMust Play!\nByPiyush Shuklaon 19 June 2014\nHardware Platform: Pc\n|\nVerified Purchase\nThis game has some really kick-ass graphics, although not next gen like Infamous:Second Son, but they're really GREAT!!\nThe game might seem to be a drag at some point of time(just like this review),but it gets better if you continue. My Rig couldn't run it at the highest specs available(graphics card isn't that great after all), but even high specs seem really good.\nAmazon's delivery system is really great..if you want, order it here.(cheapest!)\nComment\n|\n2 people found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
}
]
}