
{
"keywords":[
"1",
"2",
"3",
"4",
"5",
"6",
"7",
"8",
"9",
"10"
],
"reviews":[
{
"review":"5.0 out of 5 stars\nBatman is still living upto expectations great entertainer\nByDEVon 13 May 2016\nHardware Platform: Playstation 3\n|\nVerified Purchase\nWell batman is batman u doubtedly great game ,its more elobarate bigger world and great graphics with super villains all that u need in batman game ,i can definitely so though arkham city was impressive game but this one is better ,personally i think arkham asylum is best amomg all games of batman till now because of its unique psycho horror theme but for batman fans or ps3 owners its a must buy\nthe exceptionaly amazing thing in this game is music bgm is really movie like i say better than that even if u hve home theater or even simple tv .\nstages are well defined nothing seems repetitive which u may find frequently uin even amy good games,\ndont mess with difficulty level u may find AI more teasing than expected\nflawless moves are easy to achive (if u know and hvae played earlier games) easier than arkham city and when batman is in flawless mode he rocks with heavy combos .\na great game for all gamers ,specially ps3 ones PC etc platform wont have great grahic or motion rate and tahnu need dowloads too best is get pss and get this game , an important game in any gamers collection ,has tremendous re play value\nComment\n|\n7 people found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"4.0 out of 5 stars\nAmazing but not as great as Arkham City!!!!\nByVipulon 1 October 2016\nHardware Platform: Pc\n|\nVerified Purchase\nNice prequel but not as great as Arkham City. I'm glad that i didn't received that cheap looking cardboard box instead it came in nice premium plastic case.\nComment\n|\n4 people found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"3.0 out of 5 stars\nPlease specify\nByAmazon Customeron 17 March 2017\nHardware Platform: Playstation 3\n|\nVerified Purchase\nThe game itself is good but the disc you'll receive is a Japanese one . The game will work and run in English but the DLC's cannot be validated in an Indian account as it is region locked.\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nFive Stars\nByAmazon Customeron 25 March 2017\nHardware Platform: Playstation 3\n|\nVerified Purchase\nBeing a Batman fan it's absolutely amazing.\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nAwesome game. Must buy for all batman fans\nByA Customeron 17 January 2015\nHardware Platform: Playstation 3\n|\nVerified Purchase\nAwesome game from what I have read so far.Didn't get the time to try it yet though.will post a detailed review after I get a chance to complete the game\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"4.0 out of 5 stars\nHAD TO DOWNLOAD AN HUGE UPDATE BEFORE PLAYING\nByAmazon Customeron 18 November 2015\nHardware Platform: Pc\n|\nVerified Purchase\nI HAD TO DOWNLOAD AN UPDATE OF 16.2gb. THE GAME HAS GREAT GRAPHICS BUT THE THEME IS NOT AS GOOD AS ARKHAM CITY\nMoreover it is an ordinary EDITION .\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nUltimate game must buy\nByMEHTABon 14 March 2017\nHardware Platform: Pc\n|\nVerified Purchase\nClassic game must buy and play\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"1.0 out of 5 stars\nOne Star\nByAmazon Customeron 9 March 2017\nHardware Platform: Pc\n|\nVerified Purchase\ndoesnt work properly\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"4.0 out of 5 stars\narkham origins-xbox 360\nByniranjan kedambadion 19 August 2015\nHardware Platform: Xbox 360\n|\nVerified Purchase\nthis game is same as the other two games previous to this... doesnt feel different at all... u r lead straight away into combat... not much story build up... but the game is enjoyable... make sure to buy an extra controller along with the game dvd... the buttons are going to be squashed quite hard especially during boss fight (death stroke fight in particular)...\ni got the game at a discounted rate... got all the dlcs wit it... whch u wil hv to download frm net by redeeming the dlc codes...\namazon service is top notch as usual...\nbuy the game only if u r a batman fan... if u hv played the previous arkham asylum and arkham city... u wont miss anythng by not buying ths game...\nComment\n|\nOne person found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"4.0 out of 5 stars\nFor the love of Batman\nBytoofast1227on 21 December 2014\nHardware Platform: Xbox 360\n|\nVerified Purchase\nIt's been a long while since I last played Batman games (Dark Tomorrow, Vengeance, Rise of Sin Tzu). I was apprehensive about getting this one as the continuity will be lost quickly with Arkham Knight being next-gen only. But I wanted to see why Arkham Origins characters were so much over-powered on the Injustice mobile game. Also, a lot of reviews mention that only the boss fights were significant improvements over Rocksteady's Arkham games. But, hey, I never played those games.\nThe story is just... well it's the story of Batman and is just what it should be. Though I haven't tried it yet, there is a DLC covering the origin story as well. Brawling mechanics are eased up a lot. This is a relief for me, not having touched brawlers in a while. Experienced players might find the fights too easy. And, may be I'm playing it wrong but stealth did not seem to work very well for me.\nCrime scene investigations look great but there is a serious lack of need for player's decision making here (would have been awesome if the story is effected by player's decision making like it does in The Wolf Among Us or any other Telltale game series). Similarly, more could have been done with Cryptographic Desequencer.\nVery disappointing things though, are, lack of variation in objectives (yes, there are tiny puzzles around the collectibles but they are just not enough) and a vast but empty city - seriously, Batman is fighting for justice, but justice for who? The only people you see around who are not thugs are hostages.\nOverall, I give this game an 8.5/10. Yes, there is a lot of scope for improvement in terms of gameplay and presentation. Yes, there is going to be a lack of continuity on old-gen consoles. But most of what I'm looking for in a Batman game is the story and there's plenty of that in this game.\nEDIT: Just realized Arkham Knight continues 1 year after where Arkham City left off. In any case, future of Arkham Origins is uncertain.\nComment\n|\n5 people found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"1.0 out of 5 stars\n... no issues in packaging but the game was not good.. While steaming the percentage never went above ...\nByRahul Jainon 2 May 2016\nHardware Platform: Pc\n|\nVerified Purchase\nPackage was safe no issues in packaging but the game was not good.. While steaming the percentage never went above 27% and it closed the window by itself so had to return it\nComment\n|\n2 people found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"4.0 out of 5 stars\nAn awesome game\nByRahul Bhamraon 22 September 2015\nHardware Platform: Playstation 3\nI never really understood why this game got so much criticism.It copied the fighting mechanics from arkham city, agreed,but the huge open world,the plot and boss battles all were really great.I loved this game,despite what others want to say.\nComment\n|\nOne person found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nBat is rocking!!!!\nByharichakaravarthion 29 December 2014\nHardware Platform: Xbox 360\n|\nVerified Purchase\nBest super-hero game I've ever played\nHats off to amazon got it in time and I finished the game in 6 days\nPros:-\nStory [a quite long story ] but u can finish the game in a week if u play continusly\nWeapons\nLots of weapon upgrades\nEspecially the remote control batrang is superb\nFree roam\nNtng special in FR but this is an expanded Gotham city with lots of cops and theifs so after finishing the story get ready to kick some ass\nETC\nCons:-\nGraphics could have been better\nCannot ride batmobile\nBut it is not a big problem........\nGo for it\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"4.0 out of 5 stars\nDont listen to these PC fools\nByAmazon Customeron 21 October 2016\nHardware Platform: Playstation 3\nFirst of all, I'd ask the PC gamers to go and post their complaints on the PC version of this product..why are you spoiling the game's name ? Go for this game if you want more of arkham city..\nComment\n|\nOne person found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nSuper !\nByDhirajon 4 April 2015\nHardware Platform: Playstation 3\n|\nVerified Purchase\nThe best game of the Batman series so far. They just keep improving these games each time. Better graphics, gameplay and script. Cant wait for the next installment !\nComment\n|\nOne person found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"1.0 out of 5 stars\nMoney tottaly waste. 😣😩\nBySmiton 13 March 2015\nHardware Platform: Pc\n|\nVerified Purchase\nDo not buy this game. Always needs a internet connection to start. No use of these CDs. Money tottaly waste. 😣😩\nComment\n|\nOne person found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"4.0 out of 5 stars\nGood Game\nBySahilon 13 September 2016\nHardware Platform: Pc\nGood game......\nOfcourse not better storyline than arkham asylum and arkham city. Boss battles like bane(all three),deathstroke and firefly on the other hand r very nice. Graphics is also much better than than the prequels (rilis wise). In other words a good game. U do have to download like 16 gb of data from steam. But still worth the money,time and data.\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nFor the lovers and love of batman\nBygroniton 23 September 2015\nHardware Platform: Xbox 360\nUltimate game ever and a nice concept and graphics,story and so much that I can't say in this words as this game is awsome batman game.a very awsome story that batman has to fight bane,deathstroke,deadshot,copperhead and many more,and black mask a villainous man who wants get the Gotham city,But the cape crusader is here to save us.i love this game\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nMust Play for those who didn't read comics & don't know What Batman is for!\nByMayuron 8 May 2015\nHardware Platform: Playstation 3\n|\nVerified Purchase\nIts the First Chapter of the Arkham Origins Series. Till Date Playing the title & found that it is vast as compared to Batman Arkham City. But the Story Part is short as far as compared to Batman Arkham Origins. I Received Two DLCs in Pack that are Knightfall Download & Deathstroke challenge Pack. An Immersive Title to be engaged.\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"1.0 out of 5 stars\nvery poor service\nByAkhilon 25 November 2014\nHardware Platform: Xbox 360\n|\nVerified Purchase\nNot right product.\nVery delayed delivery\nNo refund yet\nNo collection back yet\nComment\n|\nOne person found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"1.0 out of 5 stars\nwaste of buying dvd\nByrajeshon 9 July 2015\nHardware Platform: Pc\n|\nVerified Purchase\nInspite of purchasing game dvd also.i still need to download 7gb data is not fair.\nComment\n|\nOne person found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"4.0 out of 5 stars\nall fair :)\nByAmazon Customeron 4 August 2016\nHardware Platform: Pc\n|\nVerified Purchase\nA fine treat for gamers this is one of the best titles i have got my hands on pretty immersive story line can keep u thrilled all the way along through the gameplay the story is shirt and cold beat the game in bout 2 days and other side missions are boring\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"4.0 out of 5 stars\nRequires 16 GB download to install\nByG. Abhinavon 4 July 2015\nHardware Platform: Pc\n|\nVerified Purchase\nThe game provided is Steam version but the 3 DVDs provided are not sufficient for the installation of the game. About 16 GB of download is required from the Internet to complete the installation. But after that, no problems and the game works as expected.\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nFive Stars\nByAmazon Customeron 24 October 2016\nHardware Platform: Pc\n|\nVerified Purchase\nI love this product it's so so so good. I like it. Actually I loved it.\nComment\n|\nOne person found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"4.0 out of 5 stars\nGood game\nByAmazon Customeron 28 January 2016\nHardware Platform: Xbox 360\n|\nVerified Purchase\nAbsolutely brilliant, the game rocks.. batmans always cool. WORTH IT\nComment\n|\nOne person found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nOne to look out for...\nByDavid sawyerson 18 October 2014\nHardware Platform: Xbox 360\n|\nVerified Purchase\nAwesome Game. Loving every bit of it. Thanks amazon :)\nComment\n|\nOne person found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"2.0 out of 5 stars\nSimple the game has alot of bugs despite the steam ...\nByJethin Cherianon 9 January 2015\nHardware Platform: Pc\n|\nVerified Purchase\nSimple the game has alot of bugs despite the steam downloads. It is not upto the arkham city and arkham asylam standards; but I am hoping for arkham knight to be worth buying at the least.\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"4.0 out of 5 stars\nHeads-up! Huge patch to download!!!\nByManu Kamathon 12 May 2015\nHardware Platform: Pc\n|\nVerified Purchase\nAwesome game. I played this on an Alienware M14x R1.\nThe only heads-up I feel is the fact that you need to download a 3GB patch for this game after installing it to start playing.\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"4.0 out of 5 stars\nVery good story line and neatly placed characters with eye treating ...\nByVishwason 27 August 2015\nHardware Platform: Playstation 3\n|\nVerified Purchase\nVery good story line and neatly placed characters with eye treating graphics....loved it..y not 5 on 5, coz of the investigative part being a bit more, beats the time in few chapters..\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"4.0 out of 5 stars\nReally nice\nByHoney Gourion 19 August 2015\nHardware Platform: Xbox 360\n|\nVerified Purchase\nReally nice game. And never expected to get the special game pack. And great to know that their delivery is prompt and arrived before delivery. Purchased for my son and was damn happy\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nWOW!\nBykpmganeshon 13 July 2015\nHardware Platform: Playstation 3\n|\nVerified Purchase\nThe promptness of delivery and the package was awesome.\nThe game is classic and if you are thinking to go for it , JUST GO FOR IT !!!!\nI got it through Lightning deal :P\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"3.0 out of 5 stars\nBeware of the Bugs\nByAyan Chowdhuryon 15 February 2016\nHardware Platform: Pc\n|\nVerified Purchase\nI never have enough time to write reviews. So I am going to keep it short. The product was delivered quickly and in perfect condition. So there's nothing much to say about Amazon's service except that it is excellent. They need to keep it up and not slack off.\nAbout the game itself I will just say that it isn't as good as Arkham City but it's not totally bad either. But beware, it has a lot of bugs - some of them potentially 'game-breaking'. So research this angle before buying.\nThe serial key of the game is to be redeemed on Steam. The box contains three discs.\nComment\n|\n2 people found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nFive Stars\nByAjo Vargheseon 11 June 2016\nHardware Platform: Playstation 3\n|\nVerified Purchase\nProduct was good. Got exclusive contents.\nComment\n|\nOne person found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nAmazon is just awesome. I got this for 499\nByNischithon 14 March 2015\nHardware Platform: Pc\n|\nVerified Purchase\nFirst of all. Amazon is just awesome. I got this for 499!\nThe game is awesome. But it's not complete. You'll have to download 9GB of data from steam.\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nA must have for Batman fans\nBySandeep Sanyalon 9 February 2015\nHardware Platform: Xbox 360\n|\nVerified Purchase\nBatman fans must have this. Game mechanics are same as its previous two installments and can be repetitive and boring at times. But the story is awesome.\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"4.0 out of 5 stars\nthe game is good but not as detailed and exciting as the previous ...\nByaashish turkhadeon 5 December 2014\nHardware Platform: Playstation 3\n|\nVerified Purchase\nthe game is good but not as detailed and exciting as the previous two..\nand no Kevin Conroy as they needed a younger batman voice\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nIt is one Amazing game with a brilliant story line\nBySharanon 21 July 2015\nHardware Platform: Playstation 3\n|\nVerified Purchase\nIt is one Amazing game with a brilliant story line.\nI'll have to give whole credits to Amazon to have delivered in a day. \\nn/\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"3.0 out of 5 stars\nWatch out for downloadable contents !\nByTanuj S Jadhavon 21 August 2015\nHardware Platform: Pc\n|\nVerified Purchase\nShould have informed user regarding Downloadable Content.. Disappointed by that .. other wise game is totally great..\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nDon't miss it for the current price\nByJon J.on 29 October 2015\nHardware Platform: Xbox 360\n|\nVerified Purchase\nVery good graphics and an excellent game but lacks something that Asylum and Arkham City had. Worth the buy though!\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nFive Stars\nByPrakhar B.on 4 June 2015\nHardware Platform: Playstation 3\n|\nVerified Purchase\nThe best game i have ever payed. Awesome graphics,Awesome story line, Awesome action, Awesome stealth,Awesome game\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nSuperb Game\nBySumeet Singhon 17 June 2014\nHardware Platform: Playstation 3\n|\nVerified Purchase\nBatman & Gotham City came alive at my home theater. 3D effects are mesmerizing. Good to play and easy controls.\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"4.0 out of 5 stars\nGOOD BATMAN GAME..!!\nByPrince B.on 23 November 2016\nHardware Platform: Pc\n|\nVerified Purchase\nPackaging was fine and yup, the game also ran smoothly. But the only drawback was the loading from steam....\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nAmazing Game!\nByAvinash Raveendranon 21 February 2015\nHardware Platform: Playstation 3\n|\nVerified Purchase\nIts a great game!! Gameplay though does not match up to Arkham City..but nevertheless is good fun\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"4.0 out of 5 stars\nFour Stars\nBysangam namwadon 15 October 2015\nHardware Platform: Playstation 3\n|\nVerified Purchase\nGood game..\nSTORY.\nACTION FIGHT..\nOLD RELEASE BUT STILL WORTH IT TO PURCHASE.....\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"3.0 out of 5 stars\nadditional download annoying\nByDheerajon 2 July 2015\nHardware Platform: Pc\n|\nVerified Purchase\nits a very good game. but why should I download around 8 gb even after installing from 3 discs?\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"2.0 out of 5 stars\nSucks data..f....k\nByvinoth von 5 November 2015\nHardware Platform: Pc\n|\nVerified Purchase\nI have installed but it is asking for download 12gb. Suks my data package. Really disappointed.\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nMy Feedback\nByChinmesh Agrawalon 2 September 2015\nHardware Platform: Playstation 3\n|\nVerified Purchase\nFrom ordering to receipt of the Product, it was clear & as promised. Definitely recommended.\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nBEST GAME EVER\nByAmazon Customeron 9 December 2016\nHardware Platform: Pc\n|\nVerified Purchase\nAwesome and a must buy game . Full of thrilling,action,stealth , adventurous. Worth buy\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nAwesome ..!!\nBypradipon 19 December 2015\nHardware Platform: Pc\n|\nVerified Purchase\nThis game is one of the best pc games with great graphics .liked the game very much ...\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"4.0 out of 5 stars\nMust Buy...\nByVikramon 21 January 2015\nHardware Platform: Playstation 3\n|\nVerified Purchase\nOne hell of a game, there are so many good side missions. Feels like watching a movie.\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
}
]
}