
{
"keywords":[
"1",
"2",
"3",
"4",
"5",
"6",
"7",
"8",
"9",
"10"
],
"reviews":[
{
"review":"5.0 out of 5 stars\n... see that all these people say that the game sucks!, well the multi player maps is kinda ...\nByAmazon Customeron 15 October 2016\nHardware Platform: Pc\n|\nVerified Purchase\nyou see that all these people say that the game sucks!, well the multi player maps is kinda of confusing and takes time about 2 mins to find match, and the guns are awesome. the sinle player as all say is very easy!!!! yes it is. SO DO NOT PLAY ON EASY MODE!!!!. play it on the highest difficulty or 2nd highest diffulty to enjoy the game to the fullest! The game is not that bad. some SINGLE PLAYER missions r so fun that i replay them just to see the amazing effects and stunts! if u have played COD 1,2,3,mw1,mw2,mw3,bop1,2,3, then i would surely recommend this as a go\nU get 4 dvds so u need to just download about 500 mb from steam. thats it!\n2 Comments\n|\n4 people found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"4.0 out of 5 stars\nWorth having it in your collection!\nByPromit Royon 22 December 2016\nHardware Platform: Pc\n|\nVerified Purchase\nNabbed a copy of Ghosts from Amazon for as low as 399 rupees a couple of months back. Amazon didn't disappoint. The delivery was completed well and truly before the last date. So completely satisfied with the service.\nComing to the game now. Not only one of the most underrated CODs but also one of the most underrated games ever.\nPros-\n1. Campaign is unique and engaging\n2. Solid and diverse gameplay\n3. Multiplayer soldier customization coupled with the Squads mode are nice inclusions.\n4. Wide range of dynamic maps designed to suit the style of all types of players\n5. Extinction mode is Ubercool. Justifies the title in the truest sense of it.\n6. Last but not the least, special mention has to go to the unsung hero Riley.\nCons-\n1. Campaign is a bit short\n2. Riley, the dog, was very much underused. It, too some extent, detracted from the overall experience.\n3. Graphics is not too impressive even when maxed out.\n4. Optimization is not quite good.\n5. Cannot check out the ping or network strength.\n6. Some maps have become the playground of hackers. Should be duly noted and accordingly banned.\nP.S- This review is entirely unbiased.\nComment\n|\n2 people found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nEverything To Know Before Purchase\nByrohit gargon 2 October 2016\nHardware Platform: Pc\nCod Ghost Is A Good Game Also In this review I WOuld Like To tell Some Pros ANd Cons Of Games\nPros :--\nGame Had Good Graphics..\nThere Are Many Servers Where You can Play ..\nGame Has Many Many Guns\nsingleplayer Is Good\nCons :-\nGame Is Laggy While In Multiplayer\nU Need A Good graphics card\nShould You Buy It Or Not\nIf Yoy Have A High End Pc Then Go For It If Now Than Go For Mw3\n2 Comments\n|\n8 people found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nWorth for money...Got in lighting deal...\nByRavikiranon 28 November 2016\nHardware Platform: Xbox 360\n|\nVerified Purchase\nAmazing game no doubt and great service... Delivered before the date given ordered with the battlefield 4 and I thought they both would arrive in a single box but battlefield was delivered early coming to the game... It's better than battlefield without any glitches.. We cannot compare call of duty and battlefield but as we see call of duty has got more experience and it's player friendly\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"3.0 out of 5 stars\nThe game is like all the previous COD series but net better than ...\nByAmazon Customeron 15 February 2017\nHardware Platform: Pc\n|\nVerified Purchase\nThe Product required Steam engine update which was around 200 mb but took a lot of time due to steam engine crashing in between the update.\nAfter 2 hours of steam update the game took another 1.5 hour to install. After installation the game required an update of 2.5 GB.\nPhew finally after 5 hours I was able to play the game. The game is like all the previous COD series but net better than Black ops 2.\nCool graphics but not as good as a Battlefield. Buy it if you are a COD fan like me.\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"4.0 out of 5 stars\nReceived well in time. No damage to case or ...\nByRavi P.on 21 August 2016\nHardware Platform: Xbox One\n|\nVerified Purchase\nReceived well in time. No damage to case or disc. Seal was intact, Suprisingly no literature at all inside of the pack. Was able to install the game on my US XBox one without any hassles. Could install the game in two hours with my 4 MBPS connection.\n2 Comments\n|\nOne person found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"4.0 out of 5 stars\nEnjoyed every bit of the game.\nByAmazon Customeron 30 November 2016\nHardware Platform: Pc\n|\nVerified Purchase\nNo doubt the game is captivating.I enjoyed playing it. Really good campaigns.different environments in different campaigns.Disguise as dog and attack enemies fight with shark 60 feet under water.Graphics are awesome too.not played multiplayer yet.the only thing that dissapoints is the length of the campaigns are very less it just gets finished very soon.\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"1.0 out of 5 stars\nBut why???\nByAmazon Customeron 28 September 2016\nHardware Platform: Xbox One\n|\nVerified Purchase\nProduct doesn't contain guide!!!!! But there is place to keep it!\nComment\n|\n5 people found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"2.0 out of 5 stars\nfirst of all game has a swarm of hackers in it ( COD - Hackers paradise ) second of all Multiplayer Game lags like s*** for me c\nBySRIRAM M.on 23 February 2016\nHardware Platform: Pc\n|\nVerified Purchase\nI don't get it how this game is rated high in India.\nTwo Stars\n1. Steam Game\n2. Story Campaign\nActivision dumped whole South Asia this time\ni never purchased any of these recent COD's after they introduced PEER-PEER Multiplayer system , first of all game has a swarm of hackers in it ( COD - Hackers paradise ) second of all Multiplayer Game lags like s*** for me constant freeze on multiplayer , i have a good internet connection 100mbps still i cant pay this game also i have a PC capable of running this game on Ultra ( in fact story mode i had like constant 60 Fps)... havent had had any issues with any multiplayer games... but this one here is like s***....Asians should avoid this game.. But also i can see many people here has given thumbs up for the game...don't know how they managed to play the game...\nComment\n|\n4 people found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nThe best FPS game...\nByRavi GKon 12 October 2016\nHardware Platform: Xbox 360\n|\nVerified Purchase\nby Shaun McInnis on November 5, 2013\nLike many recent multiplatform titles, the Xbox One version of Call of Duty: Ghosts looks slightly inferior on Microsoft's new console when compared to the PlayStation 4 version. This is due primarily to a difference of resolution: Ghosts on Xbox One tops out at 720p, while the PS4 version looks sharper and clearer at 1080p. But the next-gen lighting effects found in the PS4 version are very much present, as is the series' trademark 60 frames-per-second action. Ghosts remains an enjoyable shooter no matter which new console you choose. - SM, 11/26/2013, 10:00 PST\nThe first few minutes of Call of Duty: Ghosts don't paint a terribly accurate portrait of what lies ahead. You barely have time to take stock of the idyllic Southern California setting before fire begins raining down from the heavens, destroying every car and home in sight as a shouty man commands you to follow him to safety. But whereas Infinity Ward's recent work on the Modern Warfare series was weighed down by bewildering plot twists and an affinity for restricting its most exciting moments to noninteractive set dressing, Ghosts tells a lean, straightforward story that throws you into plenty of spectacular situations, but with more breathing room to appreciate the action. Along with the outstanding new Extinction co-op mode and an abundance of clever refinements to competitive multiplayer, Call of Duty: Ghosts is a refreshing and thoroughly satisfying entry in the blockbuster shooter franchise.\nMuch of Ghosts' success stems from its own sense of humility. Infinity Ward has done a great job reining in the excesses of previous Call of Duty campaigns, replacing the crumbling Eiffel Tower and runaway Tube trains of Modern Warfare 3 with a less heavy-handed approach that employs spectacle--and there's no shortage of that here--as more of a complement to its core combat. It's a game that avoids falling in love with its own cinematic ambitions, allowing the ruthless combat and well-paced encounters to take center stage over the plot.\n2 Comments\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"1.0 out of 5 stars\nDont buy from amazon\nByAmazon Customeron 16 October 2016\nHardware Platform: Pc\n|\nVerified Purchase\nWorst service and worst product delivered by amazon my Activision code was not there and the CD was broken there were four cd\nComment\n|\n3 people found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nStoryline-good Graphics-Excellent Features-All The Same Outlet Price-Outrageous Amazon Price-Cheap think ...\nByAmazon Customeron 6 May 2016\nHardware Platform: Pc\n|\nVerified Purchase\nStoryline-good\nGraphics-Excellent\nFeatures-All The Same\nOutlet Price-Outrageous\nAmazon Price-Cheap\nthink yourself to buy or not cause I got it for just 699 only!!!!!!!!!!\n1 Comment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nAwsome game\nByV.vigneshon 13 February 2016\nHardware Platform: Xbox 360\nAwsome game,unforgettable experience. Waiting for ghosts 2.the story in this game is still continues in part 2.awsome\n2 Comments\n|\n3 people found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"1.0 out of 5 stars\nDont buy it for PC because it crashes again and ...\nByGunjanon 14 June 2016\nHardware Platform: Pc\n|\nVerified Purchase\nDont buy it for PC because it crashes again and again the game is not running properly and in Multiplayer it is also not running please dont buy it for PC\nComment\n|\n2 people found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nCOD Ghost For Pc\nByBrandon Danteson 26 May 2015\nHardware Platform: Pc\n|\nVerified Purchase\nThe product I ordered for came before the estimated delivery date . It came on the 18th . Estimated was 22nd May . Problem is that the box came in dutch language but nevertheless the game can be installed in any language and most importantly the code for steam verification was right . The 4 dual layer DVDs and box were in perfect condition... Pleased with the price offer and the product because in the stores u still get this game for ₹4200 which is way too much. On pc the graphics are amazing... And storyline is interesting. To all those who criticize this game I think they should take their word back....\n1 Comment\n|\n6 people found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nNice game, nice packing by seller.\nByPrashant Barveon 24 July 2016\nHardware Platform: Pc\n|\nVerified Purchase\nI purchase the product and found within a nice packing.\nyou have to install an then connect to internet, stream account required, need upto 4-5GB download to play the game.\nNice game with average story,\ngot before delivery time.\n2 Comments\n|\n2 people found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nFive Stars\nBySandeep kumaron 11 August 2016\nHardware Platform: Xbox 360\n|\nVerified Purchase\nNice game... enjoyed playing it\n2 Comments\n|\n3 people found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"1.0 out of 5 stars\nDefective and Fraud product - Amazon theft my money!\nByGourabon 19 October 2016\nHardware Platform: Pc\n|\nVerified Purchase\nDefective and unsatisfactory product it going on taking an unknown update and I don't know what. If anyone thinking to buy this product beware you can't able to play this game it would go on take some unknown update don't know whether it's virus or not. And amazon would also not going to refund your money for this product. Beware fraud company and fraud product! I have lost my hard earned money on buying this product! Also see the Image I have posted you would understand and it goes on... downloading.... like this..\nComment\n|\nOne person found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"4.0 out of 5 stars\nGreat game of call of duty again.\nBykumar gauravon 7 October 2016\nHardware Platform: Pc\nI am great fan of call of duty series and this one is really awesome game like all call of duty series game........great graphics and great story line of two brother.......\n2 Comments\n|\nOne person found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"4.0 out of 5 stars\nPAL game working on my NTSC xbox360\nByShashankon 15 May 2015\nHardware Platform: Xbox 360\n|\nVerified Purchase\nToday 14-may-15 i received the package..\nThe DISC is PAL version but because of region free, this game is working on my NTSC (US version) console.\n2 Comments\n|\nOne person found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"4.0 out of 5 stars\nCould've been better.\nByJustin Harryon 1 June 2016\nHardware Platform: Xbox 360\n|\nVerified Purchase\nThis is the typical Call of duty that is released every year. (even months).\nand Activision knows that kids will buy them anyhow.\nanyway the all round story is 7 out of 10.\nand leaves a taste of what ghosts 2 is going to be about.\nThe same old graphics and zebra u.i.\nThe online is also...um...meh\nMy favorite is Kill Confirmed and Infected\nThe selling price is also very inexpensive on amazon I got it for ₹849\nI would rate it 7.8 out of 10\nmust play for the love of COD 😜\nComment\n|\nOne person found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"3.0 out of 5 stars\nvery short game\nByvishnuprakashon 12 September 2016\nHardware Platform: Pc\nno problem with the packaging or delivery time\nbut the thing is i finished the game in just 3...\nits just toooo damn short\nComment\n|\nOne person found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"1.0 out of 5 stars\njunkkkk\nByShashi Kanthon 25 December 2015\nHardware Platform: Xbox 360\n|\nVerified Purchase\nInstead of this I suggest u to buy gta5 it is best ever game but this call of duty is not good game worst story just worest\nComment\n|\nOne person found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\n4GB RAM GAME WONT WORK\nBytony mathewon 18 April 2016\nHardware Platform: Pc\n|\nVerified Purchase\nits good game !! 4gb download !! but u need to have atleast 6 gb ram to run this game ! otherwise it aint gonna work !!\nComment\n|\nOne person found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"1.0 out of 5 stars\nDamaged Product Received\nByArishon 30 December 2016\nHardware Platform: Xbox One\n|\nVerified Purchase\nReceived the product in damaged condition as the box was broken, also the manual and code is missing from the box.\nComment\n|\nOne person found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"4.0 out of 5 stars\ngraphics is good. didnt try the multiplayer yet\nByRajeshon 2 January 2015\nHardware Platform: Xbox One\n|\nVerified Purchase\nonly 4hours of campaign gameplay. graphics is good. didnt try the multiplayer yet. but the storyline and the gameplay is good.\n2 Comments\n|\n4 people found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nAwesome Game !!!!!!\nByPS3Feveron 2 June 2014\nVerified Purchase\nThis is the best Call Of Duty game I have ever played. Although it is costly, it is worth the price.It is a must buy for a Hardcore Gamer. The multiplayer mode is too good.Do not look at the price tag, just order it, you won't regret it.\nComment\n|\n3 people found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"3.0 out of 5 stars\nGood game, easy to play\nByBagga Singhon 1 November 2016\nHardware Platform: Xbox 360\n|\nVerified Purchase\nGood game,easy to play,good graphics. But i completed this games in 1week 3days. Very short games\nComment\n|\nOne person found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"1.0 out of 5 stars\nWorst game\nByShivamon 12 October 2016\nHardware Platform: Xbox One\nNever ever buy this game its has the worst graphics which a Xbox game could have.\nComment\n|\nOne person found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"3.0 out of 5 stars\nDisappointed\nByInfernapeXavieron 16 March 2014\nHardware Platform: Xbox 360\n|\nVerified Purchase\nWith a very short campaign, which lasted mere 5 hours, this game has a wonderful storyline, but fails to engage a player due to the short duration. Ghosts are supposed to be masters in stealth, but very often you find yourself in the middle of the battle, all guns blazing. Biggest let off is that it doesn't support more than 2 player split screen!! With a good arsenal of modes and maps, Multiplayer is good. The other good things about the game are then new Extinction and Squads mode.This has proven to be the most disappointing. If you're looking for a stealth game try Splintercell Blacklist, Ghosts is not meant for stealth.\nComment\n|\nOne person found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"3.0 out of 5 stars\nSatisfying Experience\nByVedSarkaron 7 November 2015\nHardware Platform: Pc\nCall of duty: Ghosts provides 3 play type campaign multiplayer and extinction\nThe campaign features a present time America where the government has fallen and few brave souls known as ghosts (dog included) fight the enemy for the country. The installment features 2-4 man squad and put them in all possible battle ground including space, deep ocean and even provide a playable dog as a teammate. There is nothing new in the play type as usual bunch of goons running and shooting and story leaves you with bit disappointment at the end.\nThe multiplayer includes 15 maps and which lack the space and the underwater and is almost identical to the previous releases. The only noticeable difference is the health which is lesser that call of duty black ops2. The environment fells brighter and realistic than the older instalments.\nFINAL conclusion: The game is worth giving a try for a COD fan, not a must play if you aren’t a COD fan.\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"2.0 out of 5 stars\nInstallation problem\nByAmazon Customeron 6 August 2016\nHardware Platform: Pc\n|\nVerified Purchase\nService is good. But at the time of installation and updating its taking too much time after updated the stream application. May i know how much size and time it will take for update the game???????\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nGood game, Great Buy but there are more better Options !!!\nByUtkarsh V.on 7 January 2016\nHardware Platform: Xbox One\n|\nVerified Purchase\nYou can read lots of Review about Call of Duty: Ghosts so I will spare you that, its a good game no doubt there. (very short one though, when you will you feel you are just getting started it will end)\nOrdered it, got it before time as expected, it was sealed packed. Xbox did some 7GB update before launching it. Graphics looks cool on Xbox one. It has been quite some time since this game came out So I know this game disc will have no re-sale value (getting no offers on Olx). Once I am done with it it will kept in my old dusty movie/game disc collection.\nIt was better if I purchased this digitally during Black Friday Deals in much cheaper which came later. I would suggest wait for a Deal to get games like this digitally if you have good Broadband Connection otherwise this is a great buy.\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"3.0 out of 5 stars\nThree Stars\nByAmanon 14 July 2016\nHardware Platform: Xbox One\n|\nVerified Purchase\nNice game but you can complete it in 6 hrs\nComment\n|\nOne person found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nExcellent single player campain\nByviral patelon 24 October 2015\nHardware Platform: Xbox 360\n|\nVerified Purchase\nExcellent single player campain.. good variety of missions from deep blue sea to outer space..excellent graphics. . I wish if campaign would littel bit long.. finished it in just 3 days..\n1 Comment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"3.0 out of 5 stars\nCan i get 4 DVDs in this package on PC ...\nByRatul S.on 21 November 2016\nHardware Platform: Pc\nCan i get 4 DVDs in this package on PC version.i have an steam account and i already purchase this game but i want 4 dvds can it possible to activate same account but different steam ky? Plz\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nGood one from COD...:)\nByGowtzon 18 October 2016\nHardware Platform: Xbox 360\n|\nVerified Purchase\nIt is a good game with better graphics. But not upto modern warfare series. The story line very good and more interesting. The game does not finish it continues... Waiting for second part...\n1 Comment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"1.0 out of 5 stars\nNothing works\nBymanu s.on 11 August 2016\nHardware Platform: Pc\n|\nVerified Purchase\nFirst when i ran this game it said to download 6 gb content for single player and 6 gb mor for multiplayer and after that it says UNKNOWN ERROR\nComment\n|\n3 people found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"1.0 out of 5 stars\nDon't Buy\nByAmazon Customeron 8 February 2017\nHardware Platform: Pc\nBad Graphics, few people in multiplayer.\nComment\n|\nOne person found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nGood cod game\nByvikram pvon 17 October 2015\nHardware Platform: Xbox 360\n|\nVerified Purchase\nI myself a cod fan and I first started playing cod modern warfare 4 and then ghosts on pc and black ops 1 and 2\nSo it is a game worth of playing for first-person shooter games fan\n1 Comment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"2.0 out of 5 stars\nThe game rocks!!\nByKARTHIKon 16 February 2016\nHardware Platform: Xbox One\n|\nVerified Purchase\nI usually give Amazon 5 stars. Although the game was good I didn't feel the same about the product.The manual was missing!? How can that happen?! Unless you opened it up and took it.\n1 Comment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nBest cod title\nBydilip rananawareon 2 April 2015\nHardware Platform: Xbox 360\n|\nVerified Purchase\nGot it today...playing from the first minute!\nTrue fun for all those who are true lovers of first person shooting...\nMust buy it...and a very good delivery from amazon!\n1 Comment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"4.0 out of 5 stars\nA very nice game. Very well thought\nByAmazon Customeron 4 November 2016\nHardware Platform: Xbox One\n|\nVerified Purchase\nA very nice game. Very well thought, diverse terrains. Offers an array of weapons. The only limiting factor is that the playtime is very less. Very immersing game otherwise.\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"1.0 out of 5 stars\nnot addictable\nByConsumeron 14 January 2017\nHardware Platform: Xbox 360\n|\nVerified Purchase\nNot addictable and boring gameplay.\nComment\n|\nOne person found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"3.0 out of 5 stars\nThis game sucks real bad\nByAmazon Customeron 10 June 2016\nHardware Platform: Pc\n|\nVerified Purchase\nThis game sucks real bad.... Really short game..... Gets completed in 1 day......U should better buy cod 4 modern warfare..... Amazing story and not so complex\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"1.0 out of 5 stars\nHeadache updates required.\nByAmazon Customeron 15 July 2016\nHardware Platform: Pc\n|\nVerified Purchase\nNeeds an alots and alots of updates required to play..... i hate it. Still updating dont know when i going to play.\nComment\n|\n3 people found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"1.0 out of 5 stars\nOne Star\nByThiru Vigneshon 12 June 2016\nHardware Platform: Pc\n|\nVerified Purchase\nTerrible... THE GAME DOESNT WORK\nComment\n|\nOne person found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"2.0 out of 5 stars\nFFFFUUUUUUCCCKKKKK!!!!\nByaniketon 17 February 2017\nHardware Platform: Pc\n|\nVerified Purchase\nThe game was good but this game didn't have the season pass . wheres it? I want it back. I also found the seal open so i think that amazon stole it.\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nAmazing game and service\nByArshad Abdulon 24 October 2015\nHardware Platform: Xbox 360\n|\nVerified Purchase\nAmazing servicw from Amazon. Loved to shop from them. The game is awesome. With pretty good storyline and new features like we can play as a dog too.\n1 Comment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\ncool and old classic\nByAmazon Customeron 26 November 2015\nHardware Platform: Xbox 360\nWell for starters it is a very old but well designed game. It has good multiplayer and its pal. Just deal with 10 year old kids in the multiplayer\n1 Comment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
}
]
}