
{
"keywords":[
"1",
"2",
"3",
"4",
"5",
"6",
"7",
"8",
"9",
"10"
],
"reviews":[
{
"review":"5.0 out of 5 stars\nIt's the code not the game! You need to download it your self!!\nByAbhinav utkarshon 4 September 2016\nVerified Purchase\nFirstly I would like to make it clear That in box you get a code and a CD, which when inserted gets connected to steam and then for DOWNLOADING CS:GO it asks the key! So remember you need to download! And it's pretty large! Otherwise the code worked perfectly fine\n1 Comment\n|\n15 people found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\n... steam sales but having a physical disk is a fun thing. You will have to download around 3gb ...\nByShyam Vasudevon 29 June 2016\nVerified Purchase\nYou may get it cheaper during the steam sales but having a physical disk is a fun thing. You will have to download around 3gb of data anyway. If you don't need something to show off in ur shelf then buy this during the sales .\nComment\n|\n5 people found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nCS : Global Offensive\nByJatin G Dabholkaron 1 November 2015\nVerified Purchase\nPlease note : This game requires internet connection for installation. A minimum of 10.4 gb data is downloaded during the process. If you have a very good internet connection then it will be fine otherwise it will take a whole day.\nTalking about the game it is best as CS always has been. And one more thing you can also play it offline with bots.\nI am playing it on my Windows 8.1 and its running smoothly.\nComment\n|\n6 people found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nMind Blast-actic game :p\nByAmazon Customeron 23 September 2016\nVerified Purchase\nVery good game Earlier I used to play in a cracked version offline but when I thought of buying an original cd the only site I trusted for buying it was amazon. I got the delivery in just 2 days and of course a mind blowing game.\nComment\n|\n3 people found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"1.0 out of 5 stars\nReply or i will report\nByKamalneet k.on 3 October 2016\nHey Valve\ntoday in afternoon i received the product and now when i am activating my game it is saying.......... Duplicate product code...........\nPlease reply or i will for sure report you guys on amazon and on steam ...........\n2 Comments\n|\n87 people found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"4.0 out of 5 stars\nCs go review\nByAmazon Customeron 21 November 2016\nVerified Purchase\nAmazon j always trusted you with the quality of your product but this time my CD was completely corrupted and j have to download 5gb on steam by my weak Internet connection which took me around 5days to install it thankfully the product code was real and I got the game and enjoying it.\nHappy gaming.\nComment\n|\n2 people found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nOne of the greatest multiplayer game of all time\nBySanson 28 December 2015\nVerified Purchase\nOne of the greatest FPS Multiplayer games of all type after Counter-Strike 1.6\nYou won't look back if you get used to this game with immense graphics, better maps and weapons. It will be hard to get used to after playing 1.6 but it is worth it.\nNOTE : This CD doesn't contain installation, it just allows you to register the game online on your steam account i.e you have to DOWNLOAD the game online and keep it updated.\n2 Comments\n|\n34 people found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"1.0 out of 5 stars\nCD was corrupt, and no returns..!!\nByGenuine Buyeron 7 March 2017\nVerified Purchase\nThe CD was corrupt and I was unable to install the game. And to top it, there is no return policy on this item..!! This is highly irresponsible. Is amazon listening?\n1 Comment\n|\n6 people found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nThe Best Co-op Game\nByBhaveshon 15 March 2017\nVerified Purchase\nI bought this game like 10 months ago so I know the best about it and I bought it from right here. I got the Steam Key Code and then installed it. Listen this game is insane. Get ready to spend thousands of hours on this game because the urge to rankup will never leave u alone. New players don't go compi and casual asap first practice a lot with bots and aim maps then think of going online. PS: Skins are so sexy I spent almost Rs.2000 on them. Try to stay away from them 😶\nComment\n|\nOne person found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"1.0 out of 5 stars\nThe Serial key provided in this game is not working ...\nByJimmyon 27 February 2017\nVerified Purchase\nThe Serial key provided in this game is not working. It is prompting that it is already in use. Any idea what can be done of the same.:(\nComment\n|\n6 people found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nReview for delivery, how Steam works and the game...\nByMithil Bhorason 1 November 2015\nGot this game for just 240 rupees in the lightning deal. Yeah, better than what Steam is offering! And that too before expected time, great job Amazon.\nAs I got the game just today, I'll focus only on the Steam aspect:\n-You have to have a steam account, it's free.\n-But to activate it, you have to put some money in the steam wallet (don't worry, the money will remain in your account, won't go anywhere and you don't have to pay anything extra after buying the game). I guess you can put any amount you want but am not sure. I put a dollar and it worked fine for me.\n-Since this retail version is 2014 package, you have to download a very huge update of exactly 5.5 gb. No more, no less. You cannot play this game without this update.\nThese do seem to be the downside but it's at least better than buying the game on steam for the following reasons:\n-Currently it costs $14 there. Too expensive.\n-Even if you buy from Steam, you'll have to download the entire game which is well over 10 gb (even over 15 gb I guess). So it's better to buy the cheap retail cd as it already has half of the game. That ways, it won't eat away your entire internet data pack.\nI've uploaded a pic of how your steam account will look after installing the game. The great news is you can install it any number of times on any other laptop or pc system. This cd will also run on a mac! Just be sure that you install steam first and login into your account before installing it on another system.\nSo, hope this solves all the questions you had reading all the reviews given here. You have to sacrifice something but it's better to buy this game here to save as much internet as possible.\nYou can play single player but it gets really repetitive. So please try multiplayer.\nWill update on the game soon as I'm done playing it for hours! :)\nUpdate: The game is mind-blowing. Played for hours and couldn't stop, my God! It's extremely improved version of the original CS, with rich dialog work, nice environmental touches (eg: chickens run around in some of the maps), multiple approaches to our objective... In addition, there's a tool that allows you to make your own maps, or so I've heard. You can make your own maps using the Steam Workshop eventually when you get bored of the game. In addition, you can download other players map for free from Steam! There more than a hundred thousand of these things. There's absolutely no limit to this game!\n3 Comments\n|\n48 people found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nCounter Chicken\nBySanon 28 November 2015\nVerified Purchase\nThere I was, a cs operative shooting chickens and minding my own bussiness, suddenly out of no where a flashbang and a few shots, I was on the ground, a chicken next to me looking straight into my eyes, it was thinking that finally I have paid for the genocide I commited on its kin, my team mate appeared and shot that chicken, and I died in peace contemplating what cs go would be without chickens. Shooting chickens has never been so fun\n10/10 will shoot chikens again\n2 Comments\n|\n61 people found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nBuy it From here Not from steam\nByJayaprasadon 25 March 2017\nVerified Purchase\nThe product was delivered to me 4 days earlier for which I am really thankful,It contains CD and A Card with instructions and steam code. The CD has 700MB data in it, However you will have to download the rest of the data which is approximately 6GB.This comes 100RS chepaer than in steam and you also save 700MB data,So i believe this waa better value for money. Make sure to download steam to your pc before purchase to make installing Ease. Hope i helped :)\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"3.0 out of 5 stars\nIt's alright\nByAmazon Customeron 27 June 2016\nVerified Purchase\nYou better buy it from Steam, I've learnt my lesson. They will give you 1.3 MB/s download speed regardless of your normal Internet speed.\nYou have to today download 11 GB and you won't be able to access the community or sell skins. Now I must spend at least $5 to get an unlimited account.\nComment\n|\nOne person found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nGreat Deal\nByAbhi S.on 30 March 2017\nVerified Purchase\nI Love it I was curious about CD Key many people complained that the Product keys are Fake but it's not (those who complained About keys are Fake they probably Wanted to shame to Amazon ) i buy this Game i didn't face Any Problem So Guy's go ahead and buy it i got this Deal at 391/- Rupees - and Thanks Amazon for Fast Delivery _Love You Amazon you always make me proud on you i have to buy Products From You\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nawsome game, fast delivery\nByAmazon Customeron 20 May 2016\nVerified Purchase\nI have seen a lot of bad reviews because people are not able to install game properly and have to download it from internet so here's some steps to install most of the game from CD\n1. Go to steampowered.com and download steam\n2. Let it update and then make your account or login\n3. Insert the disc and double click on it\n4. Install Cs go\nThis procedure will result in 4.8 GB to be copied from the disk and only 2 GB of updates downloaded from the internet. Loving the game but have to wait 15 days before purchasing any skins\nComment\n|\n5 people found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"1.0 out of 5 stars\nproduct code showing error\nByravikiranon 24 September 2016\nVerified Purchase\ni got the game dvd but product code has showing duplicate actiovation code wat to do please feed back this\n1 Comment\n|\n14 people found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"3.0 out of 5 stars\nA Must Buy Game\nBySlowon 8 November 2015\nVerified Purchase\nDecent game.. a must buy game for pc gamers.. i'm into run and gun unrealistic stuff so yea.. I wanna make things clear since everyone just make it sound like u need to add money to steam just to add friends and stuff.. without payin anythin(for free) u can do almost anythin except tradin n sellin.. thats just it..\nComment\n|\nOne person found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nAmazing game\nByAmazon Customeron 19 August 2016\nVerified Purchase\nBut if you are using a credit card to buy this product then buy it from steam itself.\nYou will get a premium account if you buy from steam.\nIt is only 10 rs expensive on steam\nI live the game.\nComment\n|\nOne person found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nGreat game and awesome service by Amazon\nByCodeblackon 7 July 2015\nVerified Purchase\nOrdered on 3rd an got it on 6th. No problem in installation. Good service by Amazon. Requires a 5.5gb update to play. To trade skins and items on steam u need a non limited steam account. Can play offline. There a over 10,000+ servers with players. Need to rank up to level 3 to play competitive matchmaking.\n1 Comment\n|\n23 people found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"1.0 out of 5 stars\nFake Fake Fake Pirated\nByBaljot S.on 6 February 2017\nVerified Purchase\nFake Fake Fake Dont buy they gave me pirated CD dont buy and they are not returning it . I just fired a case.\nComment\n|\n9 people found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nMust buy for gamers\nBybhavesh pathadeon 2 November 2015\nGood Game\nU need a good internet to play online but if you dont have internet you can always play with bots.\ndownloads around 5.5gb while installing so make sure you have you internet topped before installing this game.\nAs always Amazon's lightning deals are amazing i got the game at just 199 rps and the delivery time and product quality was spot on.\nComment\n|\nOne person found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nAwesome Game!!!!!\nByWinter_Soldieron 25 July 2016\nVerified Purchase\nReceived it much before the given date, product was nicely packaged into cardboard box. Kudos to Amazon for fast delivery and packaging.\nComing to the game we get a CD which is of no use and a steam code which can activated online on steam client.\nTried couple of times to run CD but it wasn't installing game.. Finally had to download whole game of 6.4GB from steam. It took nearly 2hrs on my Internet connection to download game.\n#PROS:\n1.Game has now lot details and high end graphics which is definitely gonna be liked by all.\n2.Plenty of steam add on's\n#CONS:\n1.If you're used to play Counter strike source alot... Then u'll find bit difficult to handle guns in this edition. U've to be more precise and accurate with your targets.\n2.Needs very good Internet connection.\nConclusion :\nThis is an awesome game and all gaming freaks shouldn't miss this.. I'm totally in love with it.. And spending my holidays on it day and night :)\nDon't wait, just buy it.\nComment\n|\n2 people found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"3.0 out of 5 stars\nBuy it from g2a india from amazon n not online ...\nByIshan Dhimanon 29 August 2016\nVerified Purchase\nBuy it from g2a india from amazon n not online. You'll get 200 rs gift card extra. This game also worked but after g2a well i regret buying it from this buyer\nComment\n|\n4 people found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"3.0 out of 5 stars\nGo for the Game code, not the CD\nBySamarTOP 500 REVIEWERon 17 January 2017\nVerified Purchase\nCounter Strike Global Offensive is one of the most popular global multiplayer game. After CS 1.6 and CS source, Valve has released CSGO, and this game is awesome. The graphics has improved, you get better weapons, it has become more realistic. There are abundance of online players and valve servers are very good too. With a speed of over 1MBps, you can easily play CSGO online with friends accross the world. The network connection must be static and at least 3G speed. When the game runs, you should turn off all the downloading stuffs in the background or else your ping will falter and be very high.\nIt's a cool FPS game with vast multiplayer experience. Two thumbs up for buying the game.\nBut this come in CD format, i won't recommend to buy CD, purchase it directly from Steam, or purchase the CSGO code from Amazon. It's easy to redeem the code and get the game in your STEAM library. After adding the game to your library you just need to download and install the game files on the computer, it will start automatically. After that ready your gears and roll out in the world of chickens and dufuse kits... hehe ENJOY\nComment\n|\n5 people found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nbest fps\nByAmazon Customeron 30 January 2017\nVerified Purchase\nDon't panic by reading the comments.\nYou didn't buy CS go to play offline right?\nYou have an internet connection.\nJust install steam form the net and then under add steam product give the Cs Go serial code.It will automatically start downloading.Will take a night to complete. Enjoy the headahots.EZ\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nAwesome game but Steam full features not there\nByAmazon Customeron 1 November 2016\nVerified Purchase\nAmazing game. Loads of scope of improvement & trust me, you will never master this time. You will always be learning & this makes the game interesting! Only con of buying from here, Steam features like adding friends are not there for you unless you spend or deposit $5 in Steam. Be ready to spend 6 GB data to get the game going.\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nPure FPS\nBySwapnil A.on 6 November 2016\nThis game doesnt need any introduction. The game is purely FPS and the constant steam support only makes it better. As for the delivery, it was just as expected and was on time. Packaging was sufficient to protect the contents insod. The product key was not duplicate or already used( as reported by other users). It was a new item amd worth buying if you are a gamer!\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\ni dont like this game but i love this game\nByakshay kanojiyaon 11 September 2016\ni dont like this game but i love this game . it was good game for epic shooters .but it was hard for new gamers.\nthis is very cool great game . just you buy and install in your pc and update this game 6.5gb and play\nComment\n|\n9 people found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nWorth your time and Money!\nByVipul Sakpalon 18 April 2016\nVerified Purchase\nBeen playing CS 1.6 for a decade now.Had eyes on CS GO for a few years but did not play it because of my studies.Finally ordered it got it delivered in less than 24 hrs.This is the reason i like amazon.About the game,typical steam,had to download 6.7 GB which took around 12 hrs for me.The game is a lot different than the original.But i like the new tactics and gameplay.Overall satisfied!\nComment\n|\n7 people found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nSteam Version : Works Perfectly\nByTuhinadri Banerjeeon 30 April 2015\nVerified Purchase\nOrdered and got the delivery within 48hours.\nPacking quality was satisfactory.\nOpened Box\nCD Key was there already.\nRegistered with Steam.\nI had a previous backup of CS:GO (Steam) so I just restored it.\nPerfect working condition.\n10/10.\nA must buy.\nComment\n|\nOne person found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\n10/10 ON PACKAGING AND DELIVERY and the game also works fine. From the dvd it installed 1\nByArjunon 10 September 2016\nVerified Purchase\nI ordered this and fallout 4, i got it 2 days early. 10/10 ON PACKAGING AND DELIVERY and the game also works fine. From the dvd it installed 1.4gb out of 6.5gb and the rest we download from STEAM.\nMONEY WELL SPENT for my bday gift thanks AMAZON.\nComment\n|\n4 people found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nGood game.\nByArjunon 3 December 2015\nVerified Purchase\nThe game is good. I've been playing only csgo after buying it. The disk is actually waste though. You have to download about 6 gb of game files from steam. Or copy the game file from a friend who has it.\nComment\n|\nOne person found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nBEST FPS GAME EVER!!!!\nByAmazon Customeron 23 November 2016\nVerified Purchase\nI bought it for 350 and recieved it in 2 days. Since then I've been playing it everyday for 2 hours minimum. The main problem is that we have to download the whole 6+ GB game files from steam, but that's OK Cuz I left it downloading overnight and started playing it the next day.\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nBuying again I got the original key in the previous order I hope i will get again\nByShaneon 24 December 2016\nVerified Purchase\nAgain buying hope i will get the orginal! :D\nI recently ordered this item for my smurf account, I don't know I will get the original or fake product key I wish I will get original love from Me, Valve, Steam\n#Steam # Valve @Valve @Steam\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"3.0 out of 5 stars\nGood product, better if you buy it from Steam.\nByKunal Raneon 10 February 2017\nVerified Purchase\nIt will have a disc with outdated Steam installer on it. Will have a product key to be brought from Steam. After which it will download 5 to 6 GB of game and then updates of around 1 GB.\nDon't buy it. Better alternative, install Steam online anyways it is free. Pay amount via steam and download. Same result.\nWhy? Buying this disc won't register as Steam purchase. Thus few features of Steam will not be unlocked like Friend invites and Community market. Buying it via Steam will activate those features by default.\nComment\n|\n7 people found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"4.0 out of 5 stars\nVery nice game but make sure to have Internet connectivity.\nByMehulon 13 October 2014\nVerified Purchase\nI must the say the packaging of the CD was very nice and decent..i bought this game for 525.:P in an offer and got in delivered within one day.The game-play of CS-GO is just awesome and addictive too..:P only reason i gave four star is that after inserting CD:\n1) Steam is installed\n2) Steam is updated which is about 200 or 300 mb\n3) CS-GO installation starts ,but you still cant play game after installation is completed\n4) a 4.2 gb update is required for CS-GO to play the game\nso make sure you have internet connection of decent quality like WiFi or 3g\nComment\n|\n25 people found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"4.0 out of 5 stars\nNo Review Needed!!!\nBycivinon 12 December 2016\nVerified Purchase\nRussian Speaking With There Broken Mics 12Yrs Old Abusing Like They Own The Game 11/10 Would Buy Again( 3 And Counting)By The way CD's never Worked For The Ones I Recieved So Get Ready To Download 6Gb Or Ask A Friend For Backup Of Their Game\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"1.0 out of 5 stars\nCd is good but if you are using cd key then valve ...\nByAmazon Customeron 17 December 2015\nVerified Purchase\nCd is good but if you are using cd key then valve will limit your account.\nIf you have to use community market, send friend requests. Then again you have to add $5 in stream wallet. So its better to buy from stream account rather than cd. If you are happy with limited user account then go for it.\nI purchased the cd for₹500/- later I added $5 in steam wallet approx 850/- what's the use.\nBuy from steam @479/-\nComment\n|\n4 people found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nGot the perfect thing to waste my perfect 4 years of college ...\nByDogge_Shoton 14 June 2016\nVerified Purchase\nGot the perfect thing to waste my perfect 4 years of college life with. No regrets, no sadness, no pain. Its all Skills and No luck now. Gamers never die. we re-spawn.\nI should get a life but I prefer not to.\n11/10\nComment\n|\n7 people found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"4.0 out of 5 stars\nGreat game. Updates to download comes around 5.5 GB\nByAkshayon 3 November 2015\nSuperb game. This is my favourite game from the cs series. You have to install steam first and the install this game. Updates has to be downloaded before playing this game. Updates come to around 5.5 GB. Internet connection is needed to play the game online and also to activate and update the game for the first time. I bought this for 199 rupees. And this game is totally worth every paise.\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"1.0 out of 5 stars\nDon't buy, selling used games!\nByAmazon Customeron 2 October 2016\nProduct code duplicate message on Steam, so I can't play online, and Amazon says I can't return it either! What nonsense!\n1 Comment\n|\n11 people found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\n... much content and quality within this price I would recommend you to buy this game from steam for steam ...\nByAmazon Customeron 29 April 2016\nVerified Purchase\nA must buy for all fps gamers u wont find any online fps game that provides u this much content and quality within this price\nI would recommend you to buy this game from steam for steam wallet so you can add friends and play as a team\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"4.0 out of 5 stars\nThe gameplay is awesome! It's very addictive but' the reason i gave ...\nByAmazon Customeron 6 May 2016\nVerified Purchase\nThe gameplay is awesome! It's very addictive but' the reason i gave only 4 star is because you need to update about 4-5 gb to play the game!\nI bought this game for 398rs which is better than the offers from steam I love this game!\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nGreat game. Only drawback is this purchase won't make ...\nByVaibhav Kulkarnion 17 November 2015\nVerified Purchase\nWorked perfectly. Great game. Only drawback is this purchase won't make you eligible for adding friends on steam. For that you have to make purchase on steam itself. I'd advise you to do it now, since purchases on steam are now in Rupees (earlier it was in USD, costing more, so the retail purchase made sense).\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nRECOMMENDED\nByNaznina Sultana Ahmedon 2 November 2015\nVerified Purchase\nIt's actually a great game even tho it's an old game,The graphichs are amazing too and physics also.I highly recommend this game to FPS gamers including begginers.It's better to play this game with the 'Dragon war ELE G9 MOUSE'and if u want to play with me,then add me my id is S4tan3.Thank You.\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"5.0 out of 5 stars\nGamezone seller is just awesome!! Got it in 2 working days\nByPavanon 26 August 2015\nVerified Purchase\nGamezone seller is just awesome !! Got it in 2 working days !! It installs from disc itself..!! But it updates 5.2 gb from server cant help it...!! Go for backup if any of your friends have steam !! It updated in 20 min in 30 mbps net..!! Its just amazing ! Best addiction online game ever for me !! Go for gamezone seller guys !!\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"1.0 out of 5 stars\nOne Star\nByAmazon Customeron 15 March 2017\nVerified Purchase\nI received my order today, the key was not genuine it was already used by some.\nNeed refund.\nComment\n|\n7 people found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"1.0 out of 5 stars\nRecieved a duplicate key\nByAshutosh Mathuron 6 October 2016\nProduct code duplicate message on Steam, so I can't play online, and Amazon says I can't return it either! What nonsense!\nComment\n|\n22 people found this helpful. Was this review helpful to you?\nYes\nNo\nReport abuse"
},
{
"review":"1.0 out of 5 stars\nMust have FPS!! But shit!!\nBybranden t.on 13 March 2016\nVerified Purchase\nThe first time i bought this game it was alright but this time it says duplicate CD key but the game was packed with plastic cover and didn't seemed to be opened; how is it even possible but anyway cant replace or return 😒\nComment\n|\nWas this review helpful to you?\nYes\nNo\nReport abuse"
}
]
}
